{
  "kategori": "Dzikir",
  "hadits": [
    {
      "number": 1269,
      "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu 'Ubaid] dari [Abu Hurairah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Diperkenankan bagi salah seorang diantara kalian selama ia tidak terburu-buru, ia mengatakan; aku telah berdoa namun belum dikabulkan.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عُبَيْدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُسْتَجَابُ لِأَحَدِكُمْ مَا لَمْ يَعْجَلْ فَيَقُولُ قَدْ دَعَوْتُ فَلَمْ يُسْتَجَبْ لِي"
    },
    {
      "number": 1275,
      "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Ibnu Lahi'ah] dari [Hafsh bin Hasyim bin 'Utbah bin Abu Waqqash] dari [As Saib bin Yazid] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam apabila berdoa maka beliau mengangkat kedua tangannya dan mengusap wajahnya dengan keduanya. ",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ حَفْصِ بْنِ هَاشِمِ بْنِ عُتْبَةَ بْنِ أَبِي وَقَّاصٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَعَا فَرَفَعَ يَدَيْهِ مَسَحَ وَجْهَهُ بِيَدَيْهِ"
    },
    {
      "number": 1283,
      "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdullah bin Daud] dari [Hani` bin Utsman] dari [Humaidhah binti Yasir] dari [Yusairah] ia telah mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam memerintahkan mereka (para wanita) agar menjaga takbir, pensucian Allah, serta tahlil, dan menghitung dzikir menggunakan ruas-ruas jari, karena ruas-ruas tersebut akan ditanya dan diminta untuk berbicara. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ هَانِئِ بْنِ عُثْمَانَ عَنْ حُمَيْضَةَ بِنْتِ يَاسِرٍ عَنْ يُسَيْرَةَ أَخْبَرَتْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُنَّ أَنْ يُرَاعِينَ بِالتَّكْبِيرِ وَالتَّقْدِيسِ وَالتَّهْلِيلِ وَأَنْ يَعْقِدْنَ بِالْأَنَامِلِ فَإِنَّهُنَّ مَسْئُولَاتٌ مُسْتَنْطَقَاتٌ"
    },
    {
      "number": 1313,
      "id": "Telah menceritakan kepada Kami [Muslim bin Ibrahim], telah menceritakan kepada Kami [Hisyam Ad Dastuwai] dari [Yahya] dari [Abu Ja'far] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tiga doa yang akan dikabulkan, dan tidak diragukan padanya, yaitu: doa orang tua, doa orang yang bersafar, dan doa orang yang dizhalimi.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ يَحْيَى عَنْ أَبِي جَعْفَرٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثُ دَعَوَاتٍ مُسْتَجَابَاتٌ لَا شَكَّ فِيهِنَّ دَعْوَةُ الْوَالِدِ وَدَعْوَةُ الْمُسَافِرِ وَدَعْوَةُ الْمَظْلُومِ"
    },
    {
      "number": 1314,
      "id": "Telah menceritakan dari Kami [Muhammad bin Al Mutsanna], telah menceritakan kepada Kami [Mu'adz bin Hisyam], telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [Abu Burdah bin Abdullah] bahwa [ayahnya] telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam apabila khawatir kepada suatu kaum beliau berdoa: \"Ya Allah, sesungguhnya Kami menjadikanMu di leher-leher mereka (yaitu menghadapi mereka) dan Kami berlindung kepadaMu dari kejahatan mereka.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي بُرْدَةَ بْنِ عَبْدِ اللَّهِ أَنَّ أَبَاهُ حَدَّثَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَافَ قَوْمًا قَالَ اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ"
    },
    {
      "number": 1318,
      "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zubair Al Makki] dari [Thawus] dari [Abdullah bin Abbas] bahwa Rasulullah shallAllahu wa'alaihi wa sallam pernah mengajari mereka doa ini sebagaimana mengajarkan kepada mereka satu surat dari Al Qur'an. Beliau mengucapkan: \"ALLAAHUMMA INNII A'UUDZU BIKA MIN 'ADZAABI JAHANNAMA WA A'UUDZU BIKA MIN 'ADZAABIL QABRI WA A'UUDZU BIKA MIN FITNATIL MASIIHID DAJJAAL, WA A'UUDZU BIKA MIN FITNATIL MAHYAA WAL MAMAAT\" (Ya Allah, aku berlindung kepadaMu dari adzab Jahannam, dan berlindung kepadaMu dari adzab kubur, dan berlindung kepadaMu dari fitnah Al Masih Ad Dajjal, serta berlindung kepadaMu dari fitnah kehidupan serta fitnah kematian.) ",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ طَاوُسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعَلِّمُهُمْ هَذَا الدُّعَاءَ كَمَا يُعَلِّمُهُمْ السُّورَةَ مِنْ الْقُرْآنِ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ"
    },
    {
      "number": 1319,
      "id": "Telah menceritakan kepada Kami [Ibrahim bin Musa Ar Razi], telah memberitakan kepadaku [Isa] telah menceritakan kepada Kami [Hisyam] dari [ayahnya] dari [Aisyah] radliallahu 'anha bahwa Nabi shallallahu 'alaihi wasallam pernah berdoa dengan kalimat-kalimat ini, yaitu: \"ALLAAHUMMA INNII A'UUDZU BIKA MIN FITNATIN NAARI WA 'ADZAABIN NAARI, WA MIN SYARRIL GHINAA WAL FAQRI\" (Ya Allah, aku berlindung kepadaMu dari fitnah Neraka dan adzab Neraka, dari keburukan kekayaan dan kefakiran.\"",
      "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ وَمِنْ شَرِّ الْغِنَى وَالْفَقْرِ"
    },
    {
      "number": 2367,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdullah bin Wahb], telah menceritakan kepada kami [Huyai] dari [Abu Abdurrahman Al Hubuli], dari [Abdullah bin 'Amr], bahwa Rasulullah shallallahu 'alaihi wasallam keluar pada saat perang Badr bersama tiga ratus lima belas orang. Rasulullah shallallahu 'alaihi wasallam berdoa: \"Ya Allah, mereka adalah orang-orang yang tidak beralas kaki maka berilah mereka tunggangan, mereka adalah orang-orang yang telanjang maka berilah mereka pakaian, sesungguhnya mereka adalah orang-orang yang lapar maka kenyangkanlah mereka.\" Kemudian Allah memberi beliau kemenangan pada perang Badr. Sehingga mereka berbalik kondisi mereka, tidak ada seorangpun diantara mereka melainkan ia telah pulang dengan membawa satu atau dua ekor unta, dan mereka berpakaian serta merasa kenyang. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا حُيَيٌّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ بَدْرٍ فِي ثَلَاثِ مِائَةٍ وَخَمْسَةَ عَشَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنَّهُمْ حُفَاةٌ فَاحْمِلْهُمْ اللَّهُمَّ إِنَّهُمْ عُرَاةٌ فَاكْسُهُمْ اللَّهُمَّ إِنَّهُمْ جِيَاعٌ فَأَشْبِعْهُمْ فَفَتَحَ اللَّهُ لَهُ يَوْمَ بَدْرٍ فَانْقَلَبُوا حِينَ انْقَلَبُوا وَمَا مِنْهُمْ رَجُلٌ إِلَّا وَقَدْ رَجَعَ بِجَمَلٍ أَوْ جَمَلَيْنِ وَاكْتَسَوْا وَشَبِعُوا"
    },
    {
      "number": 2494,
      "id": "Telah menceritakan kepada kami [Ar Rabi' bin Sulaiman Al Muadzdzin], telah menceritakan kepada kami [Ibnu Wahb] dari [Sulaiman bin Bilal] dari [Al 'Ala` bin Abdurrahman], dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seorang muslim meninggal, maka amalannya terputus kecuali dari tiga perkara; sedekah jariyah, ilmu yang bermanfaat, atau anak shalih yang mendoakannya.\"",
      "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ الْمُؤَذِّنُ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ سُلَيْمَانَ يَعْنِي ابْنَ بِلَالٍ عَنْ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ أُرَاهُ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةِ أَشْيَاءَ مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ"
    },
    {
      "number": 4108,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Abdullah Al Aghar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap malam Rabb kita turun ke langit dunia di sepertiga malam yang akhir. Lalu Dia berfirman: \"Siapa yang berdoa kepada-Ku maka akan Aku kabulkan, siapa yang meminta kepada-Ku maka akan Aku beri dan siapa yang meminta ampun kepada-Ku maka akan Aku ampuni.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَعَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ رَبُّنَا كُلَّ لَيْلَةٍ إِلَى سَمَاءِ الدُّنْيَا حَتَّى يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ"
    }
  ]
}