{
  "kategori": "Makanan",
  "hadits": [
    {
      "number": 168,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al-Laits] dari ['Uqail] dari [Az-Zuhri] dari [Ubaidullah bin Abdullah] dari [Ibnu Abbas] bahwasanya Nabi shallallahu 'alaihi wasallam pernah minum susu, setelah itu beliau meminta air, lalu berkumur-kumur, kemudian bersabda: \"Sesungguhnya susu itu mengandung lemak.\"",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا فَدَعَا بِمَاءٍ فَتَمَضْمَضَ ثُمَّ قَالَ إِنَّ لَهُ دَسَمًا"
    },
    {
      "number": 1432,
      "id": "Telah menceritakan kepada Kami [Ali bin Al Husain bin Ibrahim bin Isykab], telah menceritakan kepada Kami [Abu Badr], telah menceritakan kepada Kami [Abu Khalid] yang pernah singgah di Bani Dalan, dari [Nubaih] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Siapapun seorang muslim yang memakaikan pakaian kepada muslim yang lainnya karena ia tidak berpakaian maka Allah akan memakaikan kepadanya pakaian dari pakaian yang hijau di Surga, dan siapapun seorang muslim yang memberikan makan kepada muslim lainnya yang dalam keadaan lapar maka Allah memberinya makanan dari buah-buahan di Surga, dan siapapun seorang muslim yang memberi minum muslim lainnya yang dalam keadaan haus maka Allah akan memberinya minum dari Ar Rahiq Al Makhtum (arak Surga).\"",
      "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ بْنِ إِشْكَابَ حَدَّثَنَا أَبُو بَدْرٍ حَدَّثَنَا أَبُو خَالِدٍ الَّذِي كَانَ يَنْزِلُ فِي بَنِي دَالَانَ عَنْ نُبَيْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا عَلَى عُرْيٍ كَسَاهُ اللَّهُ مِنْ خُضْرِ الْجَنَّةِ وَأَيُّمَا مُسْلِمٍ أَطْعَمَ مُسْلِمًا عَلَى جُوعٍ أَطْعَمَهُ اللَّهُ مِنْ ثِمَارِ الْجَنَّةِ وَأَيُّمَا مُسْلِمٍ سَقَى مُسْلِمًا عَلَى ظَمَإٍ سَقَاهُ اللَّهُ مِنْ الرَّحِيقِ الْمَخْتُومِ"
    },
    {
      "number": 2183,
      "id": "Telah menceritakan kepada kami [Musa bin Marwan Ar Raqi], telah menceritakan kepada kami [Marwan bin Mu'awiyah], dari [Abu Hayyan], telah menceritakan kepada kami [Abu Zur'ah], dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam menamakan kuda betina Faras. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ الرَّقِيُّ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ أَبِي حَيَّانَ حَدَّثَنَا أَبُو زَرْعَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُسَمِّي الْأُنْثَى مِنْ الْخَيْلِ فَرَسًا"
    },
    {
      "number": 2251,
      "id": "Telah menceritakan kepada kami ['Ayyasy bin Al Walid Ar Raqqam], telah menceritakan kepada kami [Abdul A'la], telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang diantara kalian datang kepada hewan ternak, apabila ada pemiliknya maka hendaknya ia meminta izin kepadanya, apabila ia mengizinkannya maka silahkan ia memeras susunya dan minum. Dan jika tidak ada pemiliknya maka hendaknya ia memanggil (pemiliknya) tiga kali, jika ia menjawabnya maka hendaknya ia meminta izin, jika tidak maka hendaknya ia memerah, minum dan tidak membawanya.\"",
      "arab": "حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ الرَّقَّامُ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَتَى أَحَدُكُمْ عَلَى مَاشِيَةٍ فَإِنْ كَانَ فِيهَا صَاحِبُهَا فَلْيَسْتَأْذِنْهُ فَإِنْ أَذِنَ لَهُ فَلْيَحْتَلِبْ وَلْيَشْرَبْ فَإِنْ لَمْ يَكُنْ فِيهَا فَلْيُصَوِّتْ ثَلَاثًا فَإِنْ أَجَابَهُ فَلْيَسْتَأْذِنْهُ وَإِلَّا فَلْيَحْتَلِبْ وَلْيَشْرَبْ وَلَا يَحْمِلْ"
    },
    {
      "number": 2435,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Israil], telah menceritakan kepada kami [Simak], dari [Ikrimah] dari [Ibnu Abbas], mengenai firman Allah: \"Sesungguhnya syaitan itu membisikkan kepada kawan-kawannya.\" Mereka mengatakan; apa yang Allah sembelih janganlah kalian makan dan apa yang kalian sembelih makanlah! Kemudian Allah 'azza wajalla menurunkan ayat: \"Dan jangan kalian makan apa yang yang belum disebutkan nama Allah padanya.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا إِسْرَائِيلُ حَدَّثَنَا سِمَاكٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍفِي قَوْلِهِ{ وَإِنَّ الشَّيَاطِينَ لَيُوحُونَ إِلَى أَوْلِيَائِهِمْ }يَقُولُونَ مَا ذَبَحَ اللَّهُ فَلَا تَأْكُلُوا وَمَا ذَبَحْتُمْ أَنْتُمْ فَكُلُوا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَلَا تَأْكُلُوا مِمَّا لَمْ يُذْكَرْ اسْمُ اللَّهِ عَلَيْهِ }"
    },
    {
      "number": 2466,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], dari ['Ashim Al Ahwal] dari [Asy Sya'bi], dari [Adi bin Hatim] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila engkau memanah dengan anak panahmu dan engkau sebutkan nama Allah, kemudian engkau mendapatinya keesokan hari dan engkau tidak mendapatinya di air serta tidak ada padanya bekas selain anak panahmu maka makanlah. Dan apabila bercampur anjingmu bercampur dengan anjing yang lain, maka jangan engkau maka. Engkau tidak tahu, bisa jadi buruan tersebut dibunuh anjing yang lain.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَمَيْتَ بِسَهْمِكَ وَذَكَرْتَ اسْمَ اللَّهِ فَوَجَدْتَهُ مِنْ الْغَدِ وَلَمْ تَجِدْهُ فِي مَاءٍ وَلَا فِيهِ أَثَرٌ غَيْرُ سَهْمِكَ فَكُلْ وَإِذَا اخْتَلَطَ بِكِلَابِكَ كَلْبٌ مِنْ غَيْرِهَا فَلَا تَأْكُلْ لَا تَدْرِي لَعَلَّهُ قَتَلَهُ الَّذِي لَيْسَ مِنْهَا"
    },
    {
      "number": 2467,
      "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Zaidah], telah mengabarkan kepadaku ['Ashim Al Ahwal], dari [Asy Sya'bi] dari [Adi bin Hatim], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila buruan yang engkau panah terjatuh dalam air kemudian tenggelam dan mati, janganlah engkau makan!\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ أَخْبَرَنِي عَاصِمٌ الْأَحْوَلُ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا وَقَعَتْ رَمِيَّتُكَ فِي مَاءٍ فَغَرِقَ فَمَاتَ فَلَا تَأْكُلْ"
    },
    {
      "number": 2477,
      "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], Telah menceritakan kepada kami [Hammad bin Khalid Al Khayyath], dari [Mu'awiyah bin Shalih] dari [Abdurrahman bin Jubair bin Nufair], dari [ayahnya], dari [Tsa'labah Al Khusyani], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila engkau memanah hewan buruan kemudian engkau mendapatinya setelah tiga malam dan anak panahmu ada padanya, maka makanlah selama belum membusuk!\"",
      "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَمَيْتَ الصَّيْدَ فَأَدْرَكْتَهُ بَعْدَ ثَلَاثِ لَيَالٍ وَسَهْمُكَ فِيهِ فَكُلْهُ مَا لَمْ يُنْتِنْ"
    },
    {
      "number": 2987,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Ayyub] dan [Hisyam] serta [Habib] dari [Muhammad bin Sirin] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membeli kambing yang telah ditahan kantong susunya (tidak diperah), maka ia memiliki hak memilih selama tiga hari. Apabila ia menghendaki maka ia mengembalikannya ditambah satu sha' makanan tidak mesti harus gandum samra`.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ وَهِشَامٌ وَحَبِيبٌ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى شَاةً مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ إِنْ شَاءَ رَدَّهَا وَصَاعًا مِنْ طَعَامٍ لَا سَمْرَاءَ"
    },
    {
      "number": 3061,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari ['Umarah bin 'Umair] dari [Bibinya] bahwa ia pernah bertanya kepada [Aisyah] radliallahu 'anha, \"Dalam asuhanku terdapat seorang anak yatim. Apakah aku boleh memakan sebagian dari hartanya? Aisyah menjawab, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik dari apa yang dimakan oleh seorang laki-laki adalah yang berasal dari hasil usahanya, dan anak adalah hasil dari usahanya.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ عَمَّتِهِ أَنَّهَا سَأَلَتْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَافِي حِجْرِي يَتِيمٌ أَفَآكُلُ مِنْ مَالِهِ فَقَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَطْيَبِ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَوَلَدُهُ مِنْ كَسْبِهِ"
    },
    {
      "number": 3209,
      "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid] dari ['Auf] dari [Abu Al Qamush Zaid bin Ali] telah menceritakan kepadaku [seorang laki-laki] yang termasuk di antara delegasi yang datang kepada Nabi shallallahu 'alaihi wasallam dari Abdul Qais. 'Auf mengira namanya adalah Qais bin An Nu'man. Kemudian beliau bersabda: \"Janganlah kalian minum dalam An naqir, Al muzaffat, Ad dubba dan hantam. Minumlah dalam kantung kulit yang terikat kepalanya, kemudian apabila telah mengeras maka stabilkan dengan air, dan apabila membuatmu tidak sadar maka tumpahkanlah!\" ",
      "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ عَوْفٍ عَنْ أَبِي الْقَمُوصِ زَيدِ بْنِ عَلِيٍّ حَدَّثَنِي رَجُلٌ كَانَ مِنْ الْوَفْدِ الَّذِينَ وَفَدُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَبْدِ الْقَيْسِ يَحْسَبُ عَوْفٌ أَنَّ اسْمَهُ قَيْسُ بْنُ النُّعْمَانِ فَقَالَلَا تَشْرَبُوا فِي نَقِيرٍ وَلَا مُزَفَّتٍ وَلَا دُبَّاءٍ وَلَا حَنْتَمٍ وَاشْرَبُوا فِي الْجِلْدِ الْمُوكَى عَلَيْهِ فَإِنْ اشْتَدَّ فَاكْسِرُوهُ بِالْمَاءِ فَإِنْ أَعْيَاكُمْ فَأَهْرِيقُوهُ"
    },
    {
      "number": 3229,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang seorang laki-laki minum dalam keadaan berdiri.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَشْرَبَ الرَّجُلُ قَائِمًا"
    },
    {
      "number": 3232,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] bahwa ia mendengar ['Ubaidullah bin Abdullah] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam melarang minum dari mulut bejana minuman.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ أَنَّهُ سَمِعَ عُبَيْدَ اللَّهِ ابْنَ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ اخْتِنَاثِ الْأَسْقِيَةِ"
    },
    {
      "number": 3237,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari [Abu Al Mukhtar] dari [Abdullah bin Abu Aufa] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang memberi minum kepada suatu kaum hendaklah yang paling akhir minumnya.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي الْمُخْتَارِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَىأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَاقِي الْقَوْمِ آخِرُهُمْ شُرْبًا"
    },
    {
      "number": 3243,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] telah mengabarkan kepadaku ['Atha] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tutuplah pintumu dan sebutlah nama Allah, sesungguhnya setan tidak akan membuka pintu yang tertutup. Matikan lampu kalian dan sebutlah nama Allah! Tutuplah bejanamu walaupun hanya dengan sebatang ranting yang merintang di atasnya, dan sebutlah nama Allah! Ikatlah tempat minum kalian, dan sebutlah nama Allah!\" Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] dari [Malik] dari [Abu Az Zubair] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini dan tidak secara lengkap. Beliau bersabda: \"Sesungguhnya setan tidak membuka pintu yang tertutup, tidak akan melepas ikatan, serta tidak membuka bejana. Sesungguhnya tikus-tikus dapat membakar rumah manusia.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَغْلِقْ بَابَكَ وَاذْكُرْ اسْمَ اللَّهِ فَإِنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا وَأَطْفِ مِصْبَاحَكَ وَاذْكُرْ اسْمَ اللَّهِ وَخَمِّرْ إِنَاءَكَ وَلَوْ بِعُودٍ تَعْرِضُهُ عَلَيْهِ وَاذْكُرْ اسْمَ اللَّهِ وَأَوْكِ سِقَاءَكَ وَاذْكُرْ اسْمَ اللَّهِحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْخَبَرِ وَلَيْسَ بِتَمَامِهِ قَالَ فَإِنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا غَلَقًا وَلَا يَحُلُّ وِكَاءً وَلَا يَكْشِفُ إِنَاءً وَإِنَّ الْفُوَيْسِقَةَ تُضْرِمُ عَلَى النَّاسِ بَيْتَهُمْ أَوْ بُيُوتَهُمْ"
    },
    {
      "number": 3275,
      "id": "Telah menceritakan kepada kami [Muammal bin Hisyam] telah menceritakan kepada kami [Isma'il] dari [Hisyam bin Abu Abdullah Ad Dastuwai] dari [Budail] dari [Abdullah bin 'Ubaid] dari seorang wanita di antara mereka yang dipanggil [Ummu Kultsum] dari [Aisyah] radliallahu 'anhuma, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian makan, maka hendaknya ia menyebutkan nama Allah Ta'ala. Jika ia lupa untuk menyebut nama Allah Ta'ala di awal, hendaklah ia mengucapkan: BISMILLAAHI AWWALAHU WA AAKHIRAHU (dengan nama Allah pada awal dan akhirnya) '.\"",
      "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ هِشَامٍ يَعْنِي ابْنَ أَبِي عَبْدِ اللَّهِ الدَّسْتُوَائِيَّ عَنْ بُدَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدٍ عَنْ امْرَأَةٍ مِنْهُمْ يُقَالُ لَهَا أُمُّ كُلْثُومٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَذْكُرْ اسْمَ اللَّهِ تَعَالَى فَإِنْ نَسِيَ أَنْ يَذْكُرَ اسْمَ اللَّهِ تَعَالَى فِي أَوَّلِهِ فَلْيَقُلْ بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ"
    },
    {
      "number": 3280,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari ['Atha bin As Saib] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seorang di antara kalian makan makanan maka janganlah ia makan dari atas piring, tetapi hendaknya ia makan dari bawahnya, sesungguhnya berkah turun dari atasnya.\" ",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَلَا يَأْكُلْ مِنْ أَعْلَى الصَّحْفَةِ وَلَكِنْ لِيَأْكُلْ مِنْ أَسْفَلِهَا فَإِنَّ الْبَرَكَةَ تَنْزِلُ مِنْ أَعْلَاهَا"
    },
    {
      "number": 3283,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] telah mengabarkan kepadaku [Abu Bakr bin 'Ubaidullah bin Abdullah bin Umar] dari kakeknya [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian makan, maka hendaknya ia makan dengan menggunakan tangan kanannya, dan apabila minum maka hendaknya ia minum dengan tangan kanannya, karena sesungguhnya setan makan dan minum menggunakan tangan kirinya.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ جَدِّهِ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَإِذَا شَرِبَ فَلْيَشْرَبْ بِيَمِينِهِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ"
    },
    {
      "number": 3292,
      "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepadaku [Abu 'Amir] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam melarang dari meminum susu hewan Jallalah.\" ",
      "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنِي أَبُو عَامِرٍ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لَبَنِ الْجَلَّالَةِ"
    },
    {
      "number": 3299,
      "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dan [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa bibinya telah memberi hadiah mentega, biawak dan keju kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau memakan sebagian dari mentega dan keju, serta meninggalkan biawak karena merasa jijik. Dan biawak tersebut dimakan di atas meja makan beliau, seandainya biawak itu haram, maka biawak tersebut tidak akan dimakan di atas meja makan Rasulullah shallallahu 'alaihi wasallam.\"",
      "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ خَالَتَهُ أَهْدَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمْنًا وَأَضُبًّا وَأَقِطًا فَأَكَلَ مِنْ السَّمْنِ وَمِنْ الْأَقِطِ وَتَرَكَ الْأَضُبَّ تَقَذُّرًا وَأُكِلَ عَلَى مَائِدَتِهِ وَلَوْ كَانَ حَرَامًا مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
    },
    {
      "number": 3308,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Idris Al Khaulani] dari [Abu Tsa'labah Al Khusyani] bahwa Rasulullah shallallahu 'alaihi wasallam melarang makan semua binatang buas yang bertaring.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السَّبُعِ"
    },
    {
      "number": 3327,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru] bahwa [Bakr bin Sawadah] telah menceritakan kepadanya, bahwa [Abu An Najib] mantan budak Abdullah bin Sa'd menceritakan kepadanya, bahwa [Abu Sa'id Al Khudri] menceritakan kepadanya, bahwa disebutkan bawang putih dan bawang merah di hadapan Rasulullah shallallahu 'alaihi wasallam. Dikatakan, \"Wahai Rasulullah, di antara yang ada, yang paling keras baunya adalah bawang putih. Apakah anda mengharamkannya?\" Nabi shallallahu 'alaihi wasallam bersabda: \"Makanlah, siapa di antara kalian yang telah memakannya, maka janganlah ia mendekati masjid kami hingga baunya hilang.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ بَكْرَ بْنَ سَوَادَةَ حَدَّثَهُ أَنَّ أَبَا النَّجِيبِ مَوْلَى عَبْدِ اللَّهِ بْنِ سَعْدٍ حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ حَدَّثَهُأَنَّهُ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثُّومُ وَالْبَصَلُ وَقِيلَ يَا رَسُولَ اللَّهِ وَأَشَدُّ ذَلِكَ كُلُّهُ الثُّومُ أَفَتُحَرِّمُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُوهُ وَمَنْ أَكَلَهُ مِنْكُمْ فَلَا يَقْرَبْ هَذَا الْمَسْجِدَ حَتَّى يَذْهَبَ رِيحُهُ مِنْهُ"
    },
    {
      "number": 3328,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Asy Syaibani] dari [Adi bin Tsabit] dari [Zirr bin Khubaisy] dari [Hudzaifah] aku mengira dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa meludah ke arah kiblat, maka pada hari kiamat ia akan datang sementara ludahnya ada di antara kedua matanya. Dan barangsiapa makan sebagian dari sayur yang berbau busuk ini, maka janganlah ia mendekati masjid kami!\" Beliau mengatakannya sebanyak tiga kali.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الشَّيْبَانِيِّ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ حُذَيْفَةَأَظُنُّهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَفَلَ تُجَاهَ الْقِبْلَةِ جَاءَ يَوْمَ الْقِيَامَةِ تَفْلُهُ بَيْنَ عَيْنَيْهِ وَمَنْ أَكَلَ مِنْ هَذِهِ الْبَقْلَةِ الْخَبِيثَةِ فَلَا يَقْرَبَنَّ مَسْجِدَنَا ثَلَاثًا"
    },
    {
      "number": 3329,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan sebagian dari pohon ini, maka janganlah ia mendekati masjid-masjid!\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلَا يَقْرَبَنَّ الْمَسَاجِدَ"
    },
    {
      "number": 3333,
      "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Haiwah bin Syuraih] telah menceritakan kepada kami [Baqiyyah] dari [Bahir] dari [Khalid] dari [Abu Ziyad Khiyar bin Salamah] bahwa ia pernah bertanya kepada [Aisyah] mengenai bawang merah, lalu ia menjawab, \"Sesungguhnya makanan terakhir yang dimakan Rasulullah shallallahu 'alaihi wasallam adalah makanan yang padanya terdapat bawang merah.\"",
      "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا ح و حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدٍ عَنْ أَبِي زِيَادٍ خِيَارِ بْنِ سَلَمَةَأَنَّهُ سَأَلَ عَائِشَةَ عَنْ الْبَصَلِ فَقَالَتْ إِنَّ آخِرَ طَعَامٍ أَكَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامٌ فِيهِ بَصَلٌ"
    },
    {
      "number": 3338,
      "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ayahnya] dari [Abdullah bin Ja'far] bahwa Nabi shallallahu 'alaihi wasallam pernah makan mentimun dengan ruthab (kurma segar).\"",
      "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ الْقِثَّاءَ بِالرُّطَبِ"
    },
    {
      "number": 3344,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari ['Ubaidillah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] bahwa ada seekor tikus yang jatuh ke dalam mentega, lalu aku beritahukan kepada Nabi shallallahu 'alaihi wasallam. Kemudian beliau bersabda: \"Buanglah sekitarnya dan makanlah!\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ فَأُخْبِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلْقُوا مَا حَوْلَهَا وَكُلُوا"
    },
    {
      "number": 3347,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam jika makan makanan, beliau menjilat jari-jarinya sebanyak tiga kali, beliau bersabda: \"Jika suapan salah seorang dari kalian jatuh, maka hendaknya ia membersihkannya dari kotoran dan memakannya, dan janganlah ia membiarkannya untuk setan!\" Dan beliau memerintahkan kami agar mengusap piring. Beliau bersabda: \"Sesungguhnya tidak seorangpun di antara kalian mengetahui dibagian makanan makanakah ia diberi berkah.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَكَلَ طَعَامًا لَعِقَ أَصَابِعَهُ الثَّلَاثَ وَقَالَ إِذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ فَلْيُمِطْ عَنْهَا الْأَذَى وَلْيَأْكُلْهَا وَلَا يَدَعْهَا لِلشَّيْطَانِ وَأَمَرَنَا أَنْ نَسْلُتَ الصَّحْفَةَ وَقَالَ إِنَّ أَحَدَكُمْ لَا يَدْرِي فِي أَيِّ طَعَامِهِ يُبَارَكُ لَهُ"
    },
    {
      "number": 3350,
      "id": "Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin 'Urwah] dari [Abdurrahman bin Sa'dan] dari [Ibnu Ka'b bin Malik] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam makan menggunakan tiga jari, dan tidak mengusap tangannya hingga beliau menjilatnya.\"",
      "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ بِثَلَاثِ أَصَابِعَ وَلَا يَمْسَحُ يَدَهُ حَتَّى يَلْعَقَهَا"
    },
    {
      "number": 3352,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Hasyim Al Wasithi] dari [Isma'il bin Rabah] dari [Ayahnya atau selainnya] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam jika selesai makan beliau mengucapkan: 'Al HAMDULILLAAHILLADZII ATH'AMANAA WA SAQAANAA WA JA'ALANAA MUSLIMIIN (Segala puji bagi Allah Yang telah memberi makan serta minum kami dan menjadikan kami orang-orang muslim) '.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي هَاشِمٍ الْوَاسِطِيِّ عَنْ إِسْمَعِيلَ بْنِ رَبَاحٍ عَنْ أَبِيهِ أَوْ غَيْرِهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا فَرَغَ مِنْ طَعَامِهِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ"
    },
    {
      "number": 3378,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hasyim bin Hasyim] dari ['Amir bin Sa'd bin Abu Waqqash] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa pada pagi hari makan tujuh butir kurma 'ajwah, maka pada hari itu ia tidak akan terkena racun dan sihir.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَصَبَّحَ سَبْعَ تَمَرَاتٍ عَجْوَةٍ لَمْ يَضُرَّهُ ذَلِكَ الْيَوْمَ سَمٌّ وَلَا سِحْرٌ"
    },
    {
      "number": 3424,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Mufadldlal bin Fadlalah] dari [Habib bin Asy Syahid] dari [Muhammad bin Al Munkadir] dari [Jabir], bahwa Rasulullah shallallahu 'alaihi wasallam menggandeng tangan orang yang menderita penyakit kusta, kemudian beliau meletakkan tangan orang tersebut di atas nampan seraya bersabda: \"Makanlah dengan percaya kepada Allah dan bertawakal kepada-Nya.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا مُفَضَّلُ بْنُ فَضَالَةَ عَنْ حَبِيبِ بْنِ الشَّهِيدِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِ مَجْذُومٍ فَوَضَعَهَا مَعَهُ فِي الْقَصْعَةِ وَقَالَ كُلْ ثِقَةً بِاللَّهِ وَتَوَكُّلًا عَلَيْهِ"
    }
  ]
}