{
  "kategori": "Pemerintahan",
  "hadits": [
    {
      "number": 1068,
      "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Utsman bin Hakim] telah menceritakan kepadaku [Sa'id bin Yasar] dari [Abdullah bin Abbas] bahwa kebanyakan yang di baca Rasulullah shallallahu 'alaihi wasallam dalam dua raka'at fajar adalah \"Kami beriman kepada Allah dan apa yang diturunkan kepada kami\" (QS Al Baqarah; 136). Kata Ibnu Abbas; \"ayat ini di baca beliau di raka'at pertama, sedangkan di raka'at terakhir beliau membaca \"……kami beriman kepada Allah; dan saksikanlah bahwa Sesungguhnya kami adalah orang-orang yang berserah diri.\" (QS Ali Imran; 52). ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ أَخْبَرَنِي سَعِيدُ بْنُ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ كَثِيرًا مِمَّا كَانَ يَقْرَأُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَكْعَتَيْ الْفَجْرِ بِ{ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا }هَذِهِ الْآيَةُ قَالَ هَذِهِ فِي الرَّكْعَةِ الْأُولَى وَفِي الرَّكْعَةِ الْآخِرَةِ بِ{ آمَنَّا بِاللَّهِ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ }"
    },
    {
      "number": 1384,
      "id": "Telah menceritakan kepada Kami [Nashr bin Ali], telah mengabarkan kepada Kami [ayahku], telah mengabarkan kepada Kami [Ibrahim bin 'Atha`] mantan budak Imran bin Hushain dari [ayahnya] bahwa Ziyad atau sebagian pemimpin telah mengutus [Imran bin Hushain] untuk mengambil, kemudian tatkala ia kembali maka Ziyad bertanya kepadanya; dimanakah hartanya? Dia menjawab; apakah untuk harta engkau mengutusku? Kami telah mengambilnya dari tempat yang dahulu Kami pada masa Rasulullah shallla Allahu 'alaihi wa sallam mengambilnya dan Kami telah menempatkannya di tempat yang dahulu Kami tempatkan pada masa Rasulullah shallallahu 'alaihi wasallam.",
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا أَبِي أَخْبَرَنَا إِبْرَاهِيمُ بْنُ عَطَاءٍ مَوْلَى عِمْرَانَ بْنِ حُصَيْنٍ عَنْ أَبِيهِأَنَّ زِيَادًا أَوْ بَعْضَ الْأُمَرَاءِ بَعَثَ عِمْرَانَ بْنَ حُصَيْنٍ عَلَى الصَّدَقَةِ فَلَمَّا رَجَعَ قَالَ لِعِمْرَانَ أَيْنَ الْمَالُ قَالَ وَلِلْمَالِ أَرْسَلْتَنِي أَخَذْنَاهَا مِنْ حَيْثُ كُنَّا نَأْخُذُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوَضَعْنَاهَا حَيْثُ كُنَّا نَضَعُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
    },
    {
      "number": 1396,
      "id": "Telah menceritakan kepada Kami [Hafsh bin Umar An Namari], telah menceritakan kepada Kami [Syu'bah] dari [Abdul Malik bin 'Umair] dari [Zaid bin 'Uqbah Al Fazari] dari [Samurah] dari Nabi shalla Allahu 'alaihi wa sallam beliau bersabda: \"Sesungguhnya meminta-minta itu perbuatan buruk, dengannya seseorang mencoreng wajahnya, barangsiapa yang mau maka ia biarkan coreng di wajahnya dan barangsiapa yang mau maka ia tinggalkan, kecuali jika seseorang meminta kepada pemimpin atau meminta sesuatu yang harus ia dapatkan.\"",
      "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ زَيْدِ بْنِ عُقْبَةَ الْفَزَارِيِّ عَنْ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَسَائِلُ كُدُوحٌ يَكْدَحُ بِهَا الرَّجُلُ وَجْهَهُ فَمَنْ شَاءَ أَبْقَى عَلَى وَجْهِهِ وَمَنْ شَاءَ تَرَكَ إِلَّا أَنْ يَسْأَلَ الرَّجُلُ ذَا سُلْطَانٍ أَوْ فِي أَمْرٍ لَا يَجِدُ مِنْهُ بُدًّا"
    },
    {
      "number": 1573,
      "id": "Telah menceritakan kepada Kami [Ali bin Bahr], telah menceritakan kepada Kami [Hatim bin Isma'il], telah menceritakan kepada Kami [Muhammad bin 'Ajlan] dari [Al Qa'qa' bin Hakim] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: lima binatang yang boleh dibunuh di tanah suci adalah: ular, kalajengking, burung rajawali, tikus dan anjing buas. ",
      "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ حَدَّثَنِي مُحَمَّدُ بْنُ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَمْسٌ قَتْلُهُنَّ حَلَالٌ فِي الْحُرُمِ الْحَيَّةُ وَالْعَقْرَبُ وَالْحِدَأَةُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ"
    },
    {
      "number": 3100,
      "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Fudlail bin Sulaiman] telah menceritakan kepada kami ['Amru bin Abu 'Amru] dari [Sa'id Al Maqburi] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjabat sebagai hakim, maka sungguh ia telah disembelih tanpa menggunakan pisau.\"",
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا فُضَيْلُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَمْرُو بْنُ أَبِي عَمْرٍو عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ وَلِيَ الْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ"
    },
    {
      "number": 3101,
      "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Bisyr bin Umar] dari [Abdullah bin Ja'far] dari [Utsman bin Muhammad Al Akhnasi] dari [Al Maqburi] serta [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa dijadikan sebagai hakim di antara manusia, maka sungguh ia telah disembelih tanpa menggunakan pisau.\"",
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ الْأَخْنَسِيِّ عَنْ الْمَقْبُرِيِّ وَالْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ"
    },
    {
      "number": 3146,
      "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Abdurrazzaq] dari [Ma'mar] dari [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] bahwa Nabi shallallahu 'alaihi wasallam menahan seorang laki-laki karena suatu tuduhan.\"",
      "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ"
    }
  ]
}