{
  "kategori": "Perjalanan",
  "hadits": [
    {
      "number": 469,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu Abi Dzi`b] dari [Abdurrahman bin Mihran] dari [Abdurrahman bin Sa'd] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Semakin jauh perjalanan seorang untuk berjamaah ke masjid, maka semakin besar pahalanya.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَبْعَدُ فَالْأَبْعَدُ مِنْ الْمَسْجِدِ أَعْظَمُ أَجْرًا"
    },
    {
      "number": 1460,
      "id": "Telah menceritakan kepada Kami [Makhlad bin Khalid], telah menceritakan kepada Kami [Abdurrazzaq], telah mengabarkan kepada Kami [Ma'mar] dari ['Amr bin Muslim] dari [Ikrimah], aku mengira dari [Abu Hurairah] radliallahu 'anhu bahwa Nabi shalla Allahu 'alaihi wa sallam bersabda: \"Unta yang terlepas yang disembunyikan maka dendanya adalah seperti onta tersebut dan ditambah dengan yang semisalnya.",
      "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عَمْرِو بْنِ مُسْلِمٍ عَنْ عِكْرِمَةَ أَحْسَبُهُ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ضَالَّةُ الْإِبِلِ الْمَكْتُومَةُ غَرَامَتُهَا وَمِثْلُهَا مَعَهَا"
    },
    {
      "number": 1504,
      "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Abu Khalid Al Ahmar] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir], dan telah mengabarkan kepadaku [Abdurrahman bin Sabith] bahwa Nabi shallallahu 'alaihi wasallam dan para sahabatnya menyembelih unta yang diikat kaki kirinya dalam keadaan berdiri dengan kakinya yang lain. ",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ سَابِطٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ كَانُوا يَنْحَرُونَ الْبَدَنَةَ مَعْقُولَةَ الْيُسْرَى قَائِمَةً عَلَى مَا بَقِيَ مِنْ قَوَائِمِهَا"
    },
    {
      "number": 1637,
      "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdullah bin Daud] dari [Salamah bin Nubaith] dari [seorang laki-laki] dari Al Hayy, dari [ayahnya yaitu Nubaith], bahwa ia melihat Nabi shallallahu 'alaihi wasallam berdiri di 'Arafah di atas unta mererah beliau berkhutbah. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ سَلَمَةَ بْنِ نُبَيْطٍ عَنْ رَجُلٍ مِنْ الْحَيِّ عَنْ أَبِيهِ نُبَيْطٍأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا بِعَرَفَةَ عَلَى بَعِيرٍ أَحْمَرَ يَخْطُبُ"
    },
    {
      "number": 2206,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Suhail bin Abu Shalih], dari [ayahnya], dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian bersafar di tempat yang subur maka berilah unta haknya, dan apabila kalian bersafar di tempat yang tandus maka percepatlah jalan. Apabila kalian hendak singgah untuk bermalam maka menjauhlah dari jalan!\" telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan kepada kami [Hisyam], dari [Al Hasan] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam seperti ini. Setelah ucapan \"haknya\" ia mengatakan; dan janganlah kalian melampaui tempat-tempat persinggahan (yang sudah biasa). ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَافَرْتُمْ فِي الْخِصْبِ فَأَعْطُوا الْإِبِلَ حَقَّهَا وَإِذَا سَافَرْتُمْ فِي الْجَدْبِ فَأَسْرِعُوا السَّيْرَ فَإِذَا أَرَدْتُمْ التَّعْرِيسَ فَتَنَكَّبُوا عَنْ الطَّرِيقِحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامٌ عَنْ الْحَسَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا قَالَ بَعْدَ قَوْلِهِ حَقَّهَا وَلَا تَعْدُوا الْمَنَازِلَ"
    },
    {
      "number": 2241,
      "id": "Telah menceritakan kepada kami [Ali bin Bahr bin Barri], Telah menceritakan kepada kami [Hatim bin Isma'il], telah menceritakan kepada kami [Muhammad bin 'Ajlan], dari [Nafi'], dari [Abu Salamah], dari [Abu Sa'id Al Khudri], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ada tiga orang yang keluar dalam suatu perjalanan, maka hendaknya mereka menunjuk salah seorang dari mereka sebagai pemimpin!\"",
      "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرِ بْنِ بَرِّيٍّ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ عَنْ نَافِعٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا خَرَجَ ثَلَاثَةٌ فِي سَفَرٍ فَلْيُؤَمِّرُوا أَحَدَهُمْ"
    },
    {
      "number": 2396,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Jarir] dari [Mughirah] dari [Asy Sya'bi] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya sebaik-baik waktu seseorang menemui keluarganya apabila ia datang dari sebuah safar adalah awal malam.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ الشَّعْبِيِّ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحْسَنَ مَا دَخَلَ الرَّجُلُ عَلَى أَهْلِهِ إِذَا قَدِمَ مِنْ سَفَرٍ أَوَّلَ اللَّيْلِ"
    },
    {
      "number": 2411,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Wahb] dari [Ayyub], dari [Abu Qilabah], dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam menyembelih tujuh unta dengan tangannya dalam keadaan berdiri, dan beliau di Madinah berkurban dengan dua domba yang bertanduk dan berwarna abu-Abu. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وَهْبٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ سَبْعَ بَدَنَاتٍ بِيَدِهِ قِيَامًا وَضَحَّى بِالْمَدِينَةِ بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ"
    },
    {
      "number": 2968,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah], dari [Malik] dari [Ibnu Syihab] dari [Ibnu Muhayyishah] dari [ayahnya] bahwa ia meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk menyewakan tukang bekam, kemudian beliau melarangnya. Namun ia terus memohon dan minta izin hingga beliau memerintahkannya: \"Berilah makan untamu yang digunakan untuk mengairi air, serta budakmu!\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ مُحَيِّصَةَ عَنْ أَبِيهِأَنَّهُ اسْتَأْذَنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِجَارَةِ الْحَجَّامِ فَنَهَاهُ عَنْهَا فَلَمْ يَزَلْ يَسْأَلُهُ وَيَسْتَأْذِنُهُ حَتَّى أَمَرَهُ أَنْ أَعْلِفْهُ نَاضِحَكَ وَرَقِيقَكَ"
    },
    {
      "number": 3072,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Husain Al Mu'allim] dari ['Amru bin Syu'aib] dari [Thawus] dari [Ibnu Umar] dan [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal bagi seorang laki-laki yang memberi suatu pemberian kemudian mengambilnya kembali, kecuali orang tua mengambil apa yang ia berikan kepada anaknya. Dan permisalan orang yang memberi suatu pemberian kemudian mengambilnya seperti anjing yang makan, maka setelah kenyang ia muntah kemudian menelan muntahannya kembali.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ طَاوُسٍ عَنْ ابْنِ عُمَرَ وَابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِرَجُلٍ أَنْ يُعْطِيَ عَطِيَّةً أَوْ يَهَبَ هِبَةً فَيَرْجِعَ فِيهَا إِلَّا الْوَالِدَ فِيمَا يُعْطِي وَلَدَهُ وَمَثَلُ الَّذِي يُعْطِي الْعَطِيَّةَ ثُمَّ يَرْجِعُ فِيهَا كَمَثَلِ الْكَلْبِ يَأْكُلُ فَإِذَا شَبِعَ قَاءَ ثُمَّ عَادَ فِي قَيْئِهِ"
    },
    {
      "number": 3098,
      "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit Al Marwazi] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Haram bin Muhayyishah] dari [Ayahnya] bahwa unta Al Bara bin 'Azib masuk ke dalam kebun seorang laki-laki lalu merusaknya. Kemudian Rasulullah shallallahu 'alaihi wasallam mewajibkan atas pemilik harta (kebun) agar menjaganya pada siang hari, dan bagi pemilik hewan agar menjaganya pada malam hari.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ حَرَامِ بْنِ مُحَيِّصَةَ عَنْ أَبِيهِأَنَّ نَاقَةً لِلْبَرَاءِ بْنِ عَازِبٍ دَخَلَتْ حَائِطَ رَجُلٍ فَأَفْسَدَتْهُ عَلَيْهِمْ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَهْلِ الْأَمْوَالِ حِفْظَهَا بِالنَّهَارِ وَعَلَى أَهْلِ الْمَوَاشِي حِفْظَهَا بِاللَّيْلِ"
    },
    {
      "number": 3134,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal Adl Dlarir] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ibnu Abu 'Arubah] dari [Qatadah] dari [Sa'id bin Abu Burdah] dari [Ayahnya] dari kakeknya [Abu Musa Al Asy'ari] bahwa ada dua orang laki-laki mengklaim seekor unta atau seekor hewan kepada Nabi shallallahu 'alaihi wasallam, sementara keduanya tidak memiliki bukti. Nabi shallallahu 'alaihi wasallam lalu membagi unta tersebut untuk keduanya.\" Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Sa'id] dengan sanad dan maknanya.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammam] dari [Qatadah] dengan makna sanadnya, bahwa dua orang yang mengklaim seekor unta pada zaman Nabi shallallahu 'alaihi wasallam, lalu keduanya mengirimkan dua orang saksi, Nabi shallallahu 'alaihi wasallam kemudian membagi unta tersebut untuk mereka berdua.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ أَبِي مُوسَى الْأَشْعَرِيِّأَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا أَوْ دَابَّةً إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَتْ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَاحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ سَعِيدٍ بِإِسْنَادِهِ وَمَعْنَاهُ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ بِمَعْنَى إِسْنَادِهِ أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَ كُلُّ وَاحِدٍ مِنْهُمَا شَاهِدَيْنِ فَقَسَمَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا نِصْفَيْنِ"
    },
    {
      "number": 3176,
      "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Ayahnya] dari [Sahl bin Sa'dan] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Demi Allah, sekiranya Allah memberi petunjuk kepada seorang laki-laki melalui perantaramu, maka itu lebih baik bagimu dari unta merah.\"",
      "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ سَهْلٍ يَعْنِي ابْنَ سَعْدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَاللَّهِ لَأَنْ يَهْدِيَ اللَّهُ بِهُدَاكَ رَجُلًا وَاحِدًا خَيْرٌ لَكَ مِنْ حُمْرِ النَّعَمِ"
    }
  ]
}