{
  "kategori": "Pertanian",
  "hadits": [
    {
      "number": 382,
      "id": "Telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami [Ubaidullah bin Musa] dari [Syaiban] dari [Firas] dari ['Athiyyah] dari [Ibnu Umar] Bahwasanya Masjid Nabi shallallahu 'alaihi wasallam, tiang-tiang penyangganya adalah dari batang pohon kurma, bagian atasnya dibuat naungan dengan pelepah pohon kurma. Kemudian ia menjadi usang pada masa khilafah Abu Bakar, maka beliau merenovasinya dengan batang pohon dan pelepah kurma. Kemudian ia usang kembali pada masa khilafah Utsman, maka beliau merenovasinya dengan batu bata, maka ia masih tetap kokoh hingga sekarang. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ ابْنِ عُمَرَأَنَّ مَسْجِدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ سَوَارِيهِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ جُذُوعِ النَّخْلِ أَعْلَاهُ مُظَلَّلٌ بِجَرِيدِ النَّخْلِ ثُمَّ إِنَّهَا نَخِرَتْ فِي خِلَافَةِ أَبِي بَكْرٍ فَبَنَاهَا بِجُذُوعِ النَّخْلِ وَبِجَرِيدِ النَّخْلِ ثُمَّ إِنَّهَا نَخِرَتْ فِي خِلَافَةِ عُثْمَانَ فَبَنَاهَا بِالْآجُرِّ فَلَمْ تَزَلْ ثَابِتَةً حَتَّى الْآنَ"
    },
    {
      "number": 1415,
      "id": "Telah menceritakan kepada Kami [Abdul Aziz bin Yahya Al Harrani], telah menceritakan kepadaku [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Muhammad bin Yahya bin Hibban] dari [pamannya yaitu Wasi' bin Habban] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan dari setiap buah yang berjumlah sepuluh wasaq kurma diambil satu tandan dan digantungkan di masjid untuk orang-orang miskin. ",
      "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ مِنْ كُلِّ جَادِّ عَشْرَةِ أَوْسُقٍ مِنْ التَّمْرِ بِقِنْوٍ يُعَلَّقُ فِي الْمَسْجِدِ لِلْمَسَاكِينِ"
    },
    {
      "number": 1591,
      "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Abu Usamah] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam keluar dari jalan pohon (yang berada di samping Masjid Dzul Hulaifah), dan masuk melalui jalan Al Mu'arras. ",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ مِنْ طَرِيقِ الشَّجَرَةِ وَيَدْخُلُ مِنْ طَرِيقِ الْمُعَرَّسِ"
    },
    {
      "number": 1743,
      "id": "Telah menceritakan kepada kami [Muhammad bin Hafsh Abu Abdurrahman Al Qathtan], telah menceritakan kepada kami [Muhammad bin Khalid], telah mengabarkan kepadaku [Kharijah bin Al Harits Al Juhani], telah mengabarkan kepadaku [ayahku], dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: larangan ditebang dan potongnya pohon adalah aturan yang ditetapkan Rasulullah shallallahu 'alaihi wasallam, akan tetapi boleh digoyangkan dengan pelan agar daunnya berjatuhan. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَفْصٍ أَبُو عَبْدِ الرَّحْمَنِ الْقَطَّانُ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ أَخْبَرَنِي خَارِجَةُ بْنُ الْحَارِثِ الْجُهَنِيُّ أَخْبَرَنِي أَبِي عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُخْبَطُ وَلَا يُعْضَدُ حِمَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ يُهَشُّ هَشًّا رَفِيقًا"
    },
    {
      "number": 2248,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id?], telah menceritakan kepada kami [Al Laits], dari [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam telah membakar pohon kurma milik Bani Nadhir, dan memotong pohon, yaitu di Buwairah. Kemudian Allah 'azza wajalla menurunkan ayat: \"Apa saja yang kamu tebang dari pohon kurma (milik orang-orang kafir) atau yang kamu biarkan (tumbuh) ……..\"",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّقَ نَخْلَ بَنِي النَّضِيرِ وَقَطَعَ وَهِيَ البُوَيْرَةُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا"
    },
    {
      "number": 2498,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] bahwa [Syu'aib bin Ishaq] telah menceritakan kepada mereka dari [Hisyam bin 'Urwah] dari [Wahb bin Kaisan], dari [Jabir bin Abdullah], bahwa ia telah mengabarkan kepadanya bahwa ayahnya telah meninggal dan meninggalkan untuknya hutang tiga puluh wasaq kepada seorang yahudi. Kemudian Jabir meminta penangguhan kepadanya, dan orang yahudi tersebut menolak. Lalu Jabir berbicara kepada Nabi shallallahu 'alaihi wasallam agar beliau menjadi perantaranya kepada orang yahudi tersebut dan berbicara kepada orang yahudi agar ia mengambil buah pohon kurmanya untuk menggantikan apa yang menjadi kewajibannya kepada orang yahudi tersebut. Dan Rasulullah shallallahu 'alaihi wasallam berbicara kepadanya agar memberinya tangguhan, namun orang yahudi tersebut menolak. Dan ia pun menyebutkan hadits tersebut. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ شُعَيْبَ بْنَ إِسْحَقَ حَدَّثَهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ أَخْبَرَهُأَنَّ أَبَاهُ تُوُفِّيَ وَتَرَكَ عَلَيْهِ ثَلَاثِينَ وَسْقًا لِرَجُلٍ مِنْ يَهُودَ فَاسْتَنْظَرَهُ جَابِرٌ فَأَبَى فَكَلَّمَ جَابِرٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَشْفَعَ لَهُ إِلَيْهِ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَلَّمَ الْيَهُودِيَّ لِيَأْخُذَ ثَمَرَ نَخْلِهِ بِالَّذِي لَهُ عَلَيْهِ فَأَبَى عَلَيْهِ وَكَلَّمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُنْظِرَهُ فَأَبَى وَسَاقَ الْحَدِيثَ"
    },
    {
      "number": 2960,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], dari [Al Laits] dari [Muhammad bin Abdurrahman bin Ghanaj] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam menyerahkan pohon kurma dan tanah Khaibar kepada orang-orang yahudi Khaibar, agar mereka mengolahnya dengan modal mereka dan Rasulullah shallallahu 'alaihi wasallam mendapatkan setengah buahnya. ",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ اللَّيْثِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ غَنَجٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْتَمِلُوهَا مِنْ أَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرَ ثَمَرَتِهَا"
    },
    {
      "number": 3216,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari ['Atha bin Abu Rabbah] dari [Jabir bin Abdullah] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau telah melarang anggur dan kurma dibuat perasaan bersama-sama, beliau juga melarang kurma mentah dan kurma segar dibuat perasan secara bersamaan.\"",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يُنْتَبَذَ الزَّبِيبُ وَالتَّمْرُ جَمِيعًا وَنَهَى أَنْ يُنْتَبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا"
    },
    {
      "number": 3217,
      "id": "Telah menceritakan kepada kami [Abu Salamah Musa bin Isma'il] telah menceritakan kepada kami [Aban] telah menceritakan kepadaku [Yahya] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] bahwa ia telah melarang dari pencampuran anggur dan kurma, pencampuran zahw (kurma mentah) dan kurma segar.\" Beliau bersabda: \"Peraslah masing-masing secara tersendiri!\" Dan telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] dari [Abu Qatadah] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini.\"",
      "arab": "حَدَّثَنَا أَبُو سَلَمَةَ مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنِي يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِأَنَّهُ نَهَى عَنْ خَلِيطِ الزَّبِيبِ وَالتَّمْرِ وَعَنْ خَلِيطِ الْبُسْرِ وَالتَّمْرِ وَعَنْ خَلِيطِ الزَّهْوِ وَالرُّطَبِ وَقَالَ انْتَبِذُوا كُلَّ وَاحِدَةٍ عَلَى حِدَةٍقَالَ و حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي قَتَادَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ"
    },
    {
      "number": 3220,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Daud] dari [Mis'ar] dari [Musa bin Abdullah] dari [seorang wanita Bani Asad] dari [Aisyah] radliallahu 'anha, bahwa Rasulullah shallallahu 'alaihi wasallam dibuatkan perasan anggur, beliau lalu memasukkan kurma ke dalam perasan anggur tersebut, dan memasukkan anggur dalam perasan kurma.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوَدَ عَنْ مِسْعَرٍ عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ عَنْ امْرَأَةٍ مِنْ بَنِي أَسَدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنْبَذُ لَهُ زَبِيبٌ فَيُلْقِي فِيهِ تَمْرًا وَتَمْرٌ فَيُلْقِي فِيهِ الزَّبِيبَ"
    }
  ]
}