{
  "kategori": "Puasa",
  "hadits": [
    {
      "number": 1121,
      "id": "Telah menceritakan kepada kami [Husain bin Yazid Al Kufi] telah menceritakan kepada kami [Hafsh] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa di bangunkan oleh Allah Azza wa Jalla di setiap malam, dan tidaklah datang waktu sahur melainkan beliau telah menyelesaikan (bacaan) wiridnya.\"",
      "arab": "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الْكُوفِيُّ حَدَّثَنَا حَفْصٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُوقِظُهُ اللَّهُ عَزَّ وَجَلَّ بِاللَّيْلِ فَمَا يَجِيءُ السَّحَرُ حَتَّى يَفْرُغَ مِنْ حِزْبِهِ"
    },
    {
      "number": 1123,
      "id": "Telah menceritakan kepada kami [Abu Taubah] dari [Ibrahim bin Sa'd] dari [ayahnya] dari [Abu Salamah] dari [Aisyah] dia berkata; \"Tidaklah datang waktu sahur, melainkan beliau tidur berada di dekatku.\" Maksudnya Nabi shallallahu 'alaihi wasallam. ",
      "arab": "حَدَّثَنَا أَبُو تَوْبَةَ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْمَا أَلْفَاهُ السَّحَرُ عِنْدِي إِلَّا نَائِمًا تَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
    },
    {
      "number": 1170,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Musaddad] sedangkan maksudnya sama, keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ashim] dari [Zirrin] dia berkata; aku bertanya kepada [Ubay bin Ka'b]; \"wahai Abu Mundzir, beritahukanlah kepadaku mengenai lailatul qadr!, karena sesungguhnya sahabat kami (Ibnu Mas'ud) pernah di tanya tentang lailatul qadr, lalu dia menjawab; \"Barangsiapa melakukan (qiyamullail) setahun penuh, maka ia akan mendapatkannya.\" Ubay bin Ka'b berkata; \"Semoga Allah merahmati Abu Abdurrahman, sungguh dirinya telah mengetahui bahwa lailatul qadr terjadi pada bulan Ramadhan.\" Musaddad menambahkan; \"Tapi beliau tidak senang jika kalian bergantung pada lailatul qadr -atau- beliau lebih suka jika kalian tidak bergantung pada lailatul qadr. Demi Allah, sesungguhnya lailatul qadr itu terjadi pada bulan Ramadhan yaitu pada tanggal dua puluh tujuh tanpa terkecuali.\" Tanyaku; \"Wahai Abu Mundzir, bagaimana kamu dapat mengetahui hal itu?\" dia menjawab; \"yaitu dengan tanda-tanda yang pernah di beritahukan Rasulullah shallallahu 'alaihi wasallam.\" aku berkata kepada Zirr; \"Apakah tanda-tandanya?\" dia menjawab; \"Matahari pada pagi harinya seperti baskom, tidak bercahaya hingga ia meninggi.\"",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَاصِمٍ عَنْ زِرٍّ قَالَ قُلْتُ لِأُبَيِّ بْنِ كَعْبٍ أَخْبِرْنِي عَنْ لَيْلَةِ الْقَدْرِ يَا أَبَا الْمُنْذِرِ فَإِنَّ صَاحِبَنَا سُئِلَ عَنْهَا فَقَالَ مَنْ يَقُمْ الْحَوْلَ يُصِبْهَافَقَالَ رَحِمَ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ وَاللَّهِ لَقَدْ عَلِمَ أَنَّهَا فِي رَمَضَانَ زَادَ مُسَدَّدٌ وَلَكِنْ كَرِهَ أَنْ يَتَّكِلُوا أَوْ أَحَبَّ أَنْ لَا يَتَّكِلُوا ثُمَّ اتَّفَقَا وَاللَّهِ إِنَّهَا لَفِي رَمَضَانَ لَيْلَةَ سَبْعٍ وَعِشْرِينَ لَا يَسْتَثْنِي قُلْتُ يَا أَبَا الْمُنْذِرِ أَنَّى عَلِمْتَ ذَلِكَ قَالَ بِالْآيَةِ الَّتِي أَخْبَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ لِزِرٍّ مَا الْآيَةُ قَالَ تُصْبِحُ الشَّمْسُ صَبِيحَةَ تِلْكَ اللَّيْلَةِ مِثْلَ الطَّسْتِ لَيْسَ لَهَا شُعَاعٌ حَتَّى تَرْتَفِعَ"
    },
    {
      "number": 1175,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'laa] telah mengabarkan kepada kami [Sa'id] dari [Abu Nadlrah] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Carilah (Laiatul Qadr) pada sepuluh malam yang terakhir bulan ramadhan, dan carilah pada malam sembilan, ketujuh dan kelima.\" Abu Nadlrah berkata; tanyaku; \"Wahai Abu Sa'id, sesungguhnya kamu lebih mengetahui bilangan tersebut daripada kami.\" Dia menjawab; \"ya, betul.\" Tanyaku selanjutnya; \"apakah maksud malam kesembilan, ketujuh dan kelima?\" dia menjawab; \"Jika malam kedua puluh satu telah berlalu, maka berikutnya tinggal sembilan, jika malam ketiga puluh satu telah berlalu, maka malam berikutnya tinggal tinggal tujuh, jika malam kedua puluh lima telah berlalu, maka malam berikutnya tinggal lima.\" Abu Daud berkata; \"Apakah dia (Perawi) menyembunyikan sesuatu dariku apakah tidak.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى أَخْبَرَنَا سَعِيدٌ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ وَالْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَةِ وَالْخَامِسَةِقَالَ قُلْتُ يَا أَبَا سَعِيدٍ إِنَّكُمْ أَعْلَمُ بِالْعَدَدِ مِنَّا قَالَ أَجَلْ قُلْتُ مَا التَّاسِعَةُ وَالسَّابِعَةُ وَالْخَامِسَةُ قَالَ إِذَا مَضَتْ وَاحِدَةٌ وَعِشْرُونَ فَالَّتِي تَلِيهَا التَّاسِعَةُ وَإِذَا مَضَى ثَلَاثٌ وَعِشْرُونَ فَالَّتِي تَلِيهَا السَّابِعَةُ وَإِذَا مَضَى خَمْسٌ وَعِشْرُونَ فَالَّتِي تَلِيهَا الْخَامِسَةُ قَالَ أَبُو دَاوُد لَا أَدْرِي أَخَفِيَ عَلَيَّ مِنْهُ شَيْءٌ أَمْ لَا"
    },
    {
      "number": 1176,
      "id": "Telah menceritakan kepada kami [Hakim bin Saif Ar Raqi] telah mengabarkan kepada kami ['Ubaidullah yaitu Ibnu 'Amru] dari [Zaid yaitu Ibnu Abu Unaisah] dari [Abu Ishaq] dari [Abdurrahman bin Al Aswad] dari [ayahnya] dari [Ibnu Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami; \"Carilah (lailatul Qadar) pada malam ke tujuh belas bulan Ramadhan dan malam kedua puluh satu dan malam kedua puluh tiga.\" Kemudian beliau diam.\"",
      "arab": "حَدَّثَنَا حَكِيمُ بْنُ سَيْفٍ الرَّقِّيُّ أَخْبَرَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عَمْرٍو عَنْ زَيْدٍ يَعْنِي ابْنَ أَبِي أُنَيْسَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ قَالَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطْلُبُوهَا لَيْلَةَ سَبْعَ عَشْرَةَ مِنْ رَمَضَانَ وَلَيْلَةَ إِحْدَى وَعِشْرِينَ وَلَيْلَةَ ثَلَاثٍ وَعِشْرِينَ ثُمَّ سَكَتَ"
    },
    {
      "number": 1177,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Carilah malam lailatul qadr di tujuh malam terakhir (bulan Ramadhan).\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الْأَوَاخِرِ"
    },
    {
      "number": 1179,
      "id": "Telah menceritakan kepada kami [Humaid bin Zanjuwaih An Nasa`i] telah mengabarkan kepada kami [Sa'id bin Abu Maryam] telah menceritakan kepada kami [Muhammad bin Ja'far bin Abu Katsir] telah mengabarkan kepada kami [Musa bin 'Uqbah] dari [Abu Ishaq] dari [Sa'id bin Jubair] dari [Abdullah bin Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah di tanya, dan aku mendengar mengenai lailatul qadr, beliau bersabda: \"lailatul qadr terjadi setiap bulan Ramadhan.\" Abu Daud berkata; di riwayatkan pula oleh [Sufyan] dan [Syu'bah] dari [Abu Ishaq] secara mauquf sampai [Ibnu Umar], dan dia tidak merafa'kan sampai kepada Nabi shallallahu 'alaihi wasallam.\"",
      "arab": "حَدَّثَنَا حُمَيْدُ بْنُ زَنْجُوَيْهِ النَّسَائِيُّ أَخْبَرَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ أَبِي كَثِيرٍ أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَسْمَعُ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ هِيَ فِي كُلِّ رَمَضَانَقَالَ أَبُو دَاوُد رَوَاهُ سُفْيَانُ وَشُعْبَةُ عَنْ أَبِي إِسْحَقَ مَوْقُوفًا عَلَى ابْنِ عُمَرَ لَمْ يَرْفَعَاهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
    },
    {
      "number": 1181,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah mengabarkan kepada kami [Hammad] dari ['Atha` bin As Sa`ib] dari [ayahnya] dari [Abdullah bin 'Amru] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Puasalah tiga hari dalam setiap bulan, dan bacalah Al Qur'an (khatamkan) dalam sebulan.\" Beliau mengajukan pengurangan terhadapku, dan aku pun demikian, lalu beliau bersabda: 'Berpuasalah sehari dan berbukalah sehari. ' 'Atha` berkata; \"kami berbeda (periwayatan) dari ayahku, sebagian dari kami mengatakan; \"Tujuh hari.\" Sebagian lagi mengatakan; \"Lima hari.\"",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ أَخْبَرَنَا حَمَّادٌ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُمْ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ وَاقْرَأْ الْقُرْآنَ فِي شَهْرٍ فَنَاقَصَنِي وَنَاقَصْتُهُ فَقَالَ صُمْ يَوْمًا وَأَفْطِرْ يَوْمًاقَالَ عَطَاءٌ وَاخْتَلَفْنَا عَنْ أَبِي فَقَالَ بَعْضُنَا سَبْعَةَ أَيَّامٍ وَقَالَ بَعْضُنَا خَمْسًا"
    },
    {
      "number": 1381,
      "id": "Telah menceritakan kepada Kami [Muhammad bin Al Mutsanna], telah menceritakan kepada Kami [Sahl bin Yusuf], ia berkata; [Humaid] telah mengabarkan kepada Kami dari [Al Hasan], ia berkata; [Ibnu Abbas] rahimahullah berkhutbah pada akhir Ramadhan diatas mimbar Bashrah, lalu berkata: keluarkanlah zakat puasa kalian! Seakan orang-orang belum mengetahuinya, lalu dia berkata lagi; siapakah disini dari penduduk madinah, ajarkanlah mereka karena sesungguhnya mereka belum mengetahui. Rasulullah shallla Allahu 'alaihi wa sallam telah mewajibkan zakat ini satu sha' dari kurma atau gandum atau setengah sha' dari biji gandum, bagi setiap orang yang merdeka maupun budak, laki-laki maupun wanita, yang besar maupun yang kecil. Ketika Ali Bin Abi Thalib radliallahu 'anhu datang ia melihat murahnya harga, ia berkata; Allah telah melapangkan rizki kalian kalau seandainya kalian menjadikan satu sha' pada segala sesuatu. Humaid berkata; Al Hasan berpendapat bahwa zakat Ramadhan (fitrah) adalah kewajiban orang yang berpuasa. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ قَالَ حُمَيْدٌ أَخْبَرَنَا عَنْ الْحَسَنِ قَالَخَطَبَ ابْنُ عَبَّاسٍ رَحِمَهُ اللَّهُ فِي آخِرِ رَمَضَانَ عَلَى مِنْبَرِ الْبَصْرَةِ فَقَالَ أَخْرِجُوا صَدَقَةَ صَوْمِكُمْ فَكَأَنَّ النَّاسَ لَمْ يَعْلَمُوا فَقَالَ مَنْ هَاهُنَا مِنْ أَهْلِ الْمَدِينَةِ قُومُوا إِلَى إِخْوَانِكُمْ فَعَلِّمُوهُمْ فَإِنَّهُمْ لَا يَعْلَمُونَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ الصَّدَقَةَ صَاعًا مِنْ تَمْرٍ أَوْ شَعِيرٍ أَوْ نِصْفَ صَاعٍ مِنْ قَمْحٍ عَلَى كُلِّ حُرٍّ أَوْ مَمْلُوكٍ ذَكَرٍ أَوْ أُنْثَى صَغِيرٍ أَوْ كَبِيرٍفَلَمَّا قَدِمَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ رَأَى رُخْصَ السِّعْرِ قَالَ قَدْ أَوْسَعَ اللَّهُ عَلَيْكُمْ فَلَوْ جَعَلْتُمُوهُ صَاعًا مِنْ كُلِّ شَيْءٍ قَالَ حُمَيْدٌ وَكَانَ الْحَسَنُ يَرَى صَدَقَةَ رَمَضَانَ عَلَى مَنْ صَامَ"
    },
    {
      "number": 1582,
      "id": "Telah menceritakan kepada Kami [Wahb bin Baqiyyah] dari [Khalid Ath Thahhan] dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Abdurrahman bin Abu Laila] dari [Ka'b bin 'Ujrah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melewatinya pada zaman terjadinya perjanjian Hudaibiyah. Kemudian beliau berkata: Sungguh kutu kepalamu telah mengganggumu. Ia berkata; ya. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Gundullah rambutmu, kemudian sembelihlah kambing sebagai kurban, atau berpuasalah tiga hari, atau berilah makan tiga sha' kurma kepada enam orang miskin!\"",
      "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ الطَّحَّانِ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ زَمَنَ الْحُدَيْبِيَةِ فَقَالَ قَدْ آذَاكَ هَوَامُّ رَأْسِكَ قَالَ نَعَمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْلِقْ ثُمَّ اذْبَحْ شَاةً نُسُكًا أَوْ صُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ ثَلَاثَةَ آصُعٍ مِنْ تَمْرٍ عَلَى سِتَّةِ مَسَاكِينَ"
    },
    {
      "number": 1583,
      "id": "Telah menceritakan kepada Kami [Musa bin Isma'i] telah menceritakan kepada Kami [Hammad] dari [Daud] dari [Asy Sya'bi] dari [Abdurrahman bin Abu Laila] dari [Ka'b bin 'Ujrah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Apabila engkau menghendaki maka sembelihlah hewan sembelihan, dan apabila engkau menghendaki maka berpuasalah tiga hari, dan jika engkau menghendaki maka berilah makan tiga sha' kurma kepada enam orang miskin.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ إِنْ شِئْتَ فَانْسُكْ نَسِيكَةً وَإِنْ شِئْتَ فَصُمْ ثَلَاثَةَ أَيَّامٍ وَإِنْ شِئْتَ فَأَطْعِمْ ثَلَاثَةَ آصُعٍ مِنْ تَمْرٍ لِسِتَّةِ مَسَاكِينَ"
    },
    {
      "number": 1584,
      "id": "Telah menceritakan kepada Kami [Ibnu Al Mutsanna] telah menceritakan kepada Kami [Abdul Wahhab]. Telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Nashr bin Ali], telah menceritakan kepada Kami [Yazid bin Zurai'] dan ini adalah lafazh Ibnu Al Mutsanna dari [Daud] dari ['Amir] dari [Ka'b bin 'Ujrah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melewatinya pada zaman terjadinya perjanjian Hudaibiyah….. kemudian ia menyebutkan kisah tersebut. Kemudian beliau berkata: \"Apakah engkau membawa dam (kambing atau sejenisnya)?\" Ia berkata; tidak. Beliau bersabda: \"Berpuasalah tiga hari atau bersedekahlah tiga sha' kurma kepada enam orang miskin, untuk setiap dua orang miskin satu sha'.\"",
      "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ ح و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ وَهَذَا لَفْظُ ابْنِ الْمُثَنَّى عَنْ دَاوُدَ عَنْ عَامِرٍ عَنْ كَعْبِ بْنِ عُجْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ زَمَنَ الْحُدَيْبِيَةِ فَذَكَرَ الْقِصَّةَ فَقَالَ أَمَعَكَ دَمٌ قَالَ لَا قَالَ فَصُمْ ثَلَاثَةَ أَيَّامٍ أَوْ تَصَدَّقْ بِثَلَاثَةِ آصُعٍ مِنْ تَمْرٍ عَلَى سِتَّةِ مَسَاكِينَ بَيْنَ كُلِّ مِسْكِينَيْنِ صَاعٌ"
    },
    {
      "number": 1586,
      "id": "Telah menceritakan kepada Kami [Muhammad bin Manshur], telah menceritakan kepada Kami [Ya'qub], telah menceritakan kepadaku [ayahku], dari [Ibnu Ishaq], telah menceritakan kepadaku [Aban yaitu Ibnu Shalih] dari [Al Hakam bin 'Utaibah] dari [Abdurrahman bin Abu Laila], dari [Ka'b 'Ujrah], ia berkata; aku terserang kutu kepala, sementara aku bersama Rasulullah shallAllahu wa'alaihi wa sallam pada tahun terjadinya perjanjian Hudaibiyah hingga aku mengkhawatirkan mataku. Kemudian Allah subhanahu wa ta'ala menurunkan wahyu mengenaiku: \"Jika ada di antaramu yang sakit atau ada gangguan di kepalanya (lalu ia bercukur), maka wajiblah atasnya berfid-yah, yaitu: berpuasa atau bersedekah atau berkorban.\" Kemudian Rasulullah shallAllahu wa'alaihi wa sallam memanggilku dan berkata kepadaku: \"Gundullah rambutmu, dan berpuasalah tiga hari atau berilah makan enam orang miskin, satu faraq kismis, atau sembelihlah seekor kambing!\" kemudian aku menggundul rambutku dan menyembelih kurban. Telah menceritakan kepada Kami [Abdullah bin Maslamah Al Qa'nabi] dari [Malik] dari [Abdul Karim bin Malik Al Jazari] dari [Abdurrahman bin Abu Laila] dari [Ka'b bin 'Ujrah] dalam kisah ini, ia menambahkan kata: \"Apapun yang engkau lakukan dari hal tersebut maka telah sah darimu.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ حَدَّثَنَا يَعْقُوبُ حَدَّثَنِي أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي أَبَانُ يَعْنِي ابْنَ صَالِحٍ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَأَصَابَنِي هَوَامُّ فِي رَأْسِي وَأَنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ حَتَّى تَخَوَّفْتُ عَلَى بَصَرِي فَأَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى فِيَّ{ فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ بِهِ أَذًى مِنْ رَأْسِهِ }الْآيَةَ فَدَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي احْلِقْ رَأْسَكَ وَصُمْ ثَلَاثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ فَرَقًا مِنْ زَبِيبٍ أَوْ انْسُكْ شَاةً فَحَلَقْتُ رَأْسِي ثُمَّ نَسَكْتُحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ الْكَرِيمِ بْنِ مَالِكٍ الْجَزَرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ فِي هَذِهِ الْقِصَّةِ زَادَ أَيُّ ذَلِكَ فَعَلْتَ أَجْزَأَ عَنْكَ"
    },
    {
      "number": 1697,
      "id": "Telah menceritakan kepada Kami [Abu Kamil] telah menceritakan kepada Kami [Abu 'Awanah] dari [Ibrahim bin Muhajir] dari [Abu Bakr bin Abdurrahman], telah mengabarkan kepadaku [utusan Marwan] yang dikirim kepada [Ummu Ma'qil], ia berkata; dahulu Abu Ma'qil pernah berhaji bersama Rasulullah shallAllahu wa'alaihi wa sallam, kemudian tatkala ia datang, Ummu Ma'qil berkata; sungguh engkau telah mengetahui bahwa aku wajib berhaji. Kemudian mereka berdua berjalan hingga menemui beliau. Ummu Ma'qil berkata; wahai Rasulullah, sesungguhnya saya wajib berhaji, dan sesungguhnya Abu Ma'qil memiliki unta muda. Abu Ma'qil berkata; ia benar, saya telah menjadikannya di jalan Allah. Maka Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Berikan kepadanya, dan silahkan ia berhaji dengan mengendarainya, sesungguhnya hal tersebut adalah di jalan Allah.\" Kemudian Abu Ma'qil memberikan unta muda tersebut kepadanya. Lalu Ummu Ma'qil berkata; wahai Rasulullah, sesungguhnya saya adalah seorang wanita yang telah tua, dan sakit. Apakah ada amalan yang mencukupkanku dari melakukan haji? Beliau menjawab: \"Umrah pada Bulan Ramadhan, mencukupkan dari melakukan haji.\"",
      "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَخْبَرَنِي رَسُولُ مَرْوَانَ الَّذِي أُرْسِلَ إِلَى أُمِّ مَعْقَلٍ قَالَتْكَانَ أَبُو مَعْقَلٍ حَاجًّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَدِمَ قَالَتْ أُمُّ مَعْقَلٍ قَدْ عَلِمْتَ أَنَّ عَلَيَّ حَجَّةً فَانْطَلَقَا يَمْشِيَانِ حَتَّى دَخَلَا عَلَيْهِ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ عَلَيَّ حَجَّةً وَإِنَّ لِأَبِي مَعْقَلٍ بَكْرًا قَالَ أَبُو مَعْقَلٍ صَدَقَتْ جَعَلْتُهُ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهَا فَلْتَحُجَّ عَلَيْهِ فَإِنَّهُ فِي سَبِيلِ اللَّهِ فَأَعْطَاهَا الْبَكْرَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ قَدْ كَبِرْتُ وَسَقِمْتُ فَهَلْ مِنْ عَمَلٍ يُجْزِئُ عَنِّي مِنْ حَجَّتِي قَالَ عُمْرَةٌ فِي رَمَضَانَ تُجْزِئُ حَجَّةً"
    },
    {
      "number": 1698,
      "id": "Telah menceritakan kepada Kami [Muhammad bin 'Auf Ath Thai], telah menceritakan kepada Kami [Ahmad bin Khalid Al Wahbi], telah menceritakan kepada Kami [Muhammad bin Ishaq] dari [Isa bin Ma'qil bin Ummu Ma'qil Al Asadi] yaitu Asad Khuzaimah, telah menceritakan kepadaku [Yusuf bin Abdullah bin Salam] dari [Neneknya yaitu Ummu Ma'qil], ia berkata; tatkala Rasulullah shallAllahu wa'alaihi wa sallam melakukan haji wada', dan Kami memiliki seekor unta, Abu Ma'qil menjadikannya di jalan Allah sementara Kami terserang penyakit. Dan Abu Ma'qil meninggal. Nabi shallallahu 'alaihi wasallam meninggal, dan tatkala telah selesai dari hajinya aku datang kepada beliau, lalu beliau berkata: \"Wahai Ummu Ma'qil, apa yang menghalangimu untuk keluar bersama Kami?\" ia berkata; sungguh saya telah bersiap-siap namun Abu Ma'qil meninggal, dan Kami memiliki seekor unta yang Kami gunakan untuk berhaji. Kemudian Abu Ma'qil berwasiat agar unta tersebut untuk di jalan Allah. Beliau berkata: \"Tidakkah engkau keluar dengan mengendarainya? Sesungguhnya haji adalah di jalan Allah, adapun apabila engkau telah tertinggal haji ini bersama Kami maka lakukanlah umrah pada Bulan Ramadhan, karena sesungguhnya umrah tersebut seperti haji.\" Ummu Ma'qil pernah berkata; haji adalah haji dan umrah adalah umrah. Dan Rasulullah shallAllahu wa'alaihi wa sallam telah mengatakan hal ini kepadaku, aku tidak tahu apakah hal khusus untukku? ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ الْوَهْبِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ عِيسَى بْنِ مَعْقَلِ بْنِ أُمِّ مَعْقَلٍ الْأَسَدِيِّ أَسَدِ خُزَيْمَةَ حَدَّثَنِي يُوسُفُ بْنُ عَبْدِ اللَّهِ بْنِ سَلَامٍ عَنْ جَدَّتِهِ أُمِّ مَعْقَلٍ قَالَتْلَمَّا حَجَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّةَ الْوَدَاعِ وَكَانَ لَنَا جَمَلٌ فَجَعَلَهُ أَبُو مَعْقِلٍ فِي سَبِيلِ اللَّهِ وَأَصَابَنَا مَرَضٌ وَهَلَكَ أَبُو مَعْقِلٍ وَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا فَرَغَ مِنْ حَجِّهِ جِئْتُهُ فَقَالَ يَا أُمَّ مَعْقِلٍ مَا مَنَعَكِ أَنْ تَخْرُجِي مَعَنَا قَالَتْ لَقَدْ تَهَيَّأْنَا فَهَلَكَ أَبُو مَعْقِلٍ وَكَانَ لَنَا جَمَلٌ هُوَ الَّذِي نَحُجُّ عَلَيْهِ فَأَوْصَى بِهِ أَبُو مَعْقِلٍ فِي سَبِيلِ اللَّهِ قَالَ فَهَلَّا خَرَجْتِ عَلَيْهِ فَإِنَّ الْحَجَّ فِي سَبِيلِ اللَّهِ فَأَمَّا إِذْ فَاتَتْكِ هَذِهِ الْحَجَّةُ مَعَنَا فَاعْتَمِرِي فِي رَمَضَانَ فَإِنَّهَا كَحَجَّةٍ فَكَانَتْ تَقُولُ الْحَجُّ حَجَّةٌ وَالْعُمْرَةُ عُمْرَةٌ وَقَدْ قَالَ هَذَا لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَدْرِي أَلِيَ خَاصَّةً"
    },
    {
      "number": 1699,
      "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdul Warits] dari [Amir Al Ahwal] dari [Bakr bin Abdullah] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam hendak melakukan haji, kemudian seorang wanita berkata kepada suaminya; hajikan saya bersama Rasulullah shallAllahu wa'alaihi wa sallam di atas untamu! Kemudian beliau berkata; aku tidak memiliki sesuatu untuk membawamu berhaji. Ia berkata; hajikan saya di atas untamu Fulani! Ia berkata; itu adalah unta yang tertahan untuk di jalan Allah 'azza wajalla. Kemudian ia datang kepada Rasulullah shallAllahu wa'alaihi wa sallam dan berkata; sesungguhnya isteriku mengucapkan salam dan rahmat kepadamu. Dan ia meminta kepadaku untuk melakukan haji bersamamu. Ia berkata; hajikan aku bersama Rasulullah shallAllahu wa'alaihi wa sallam Fulani! Lalu aku mengatakan unta itu adalah unta yang tertahan di jalan Allah. Kemudian beliau berkata: \"Sesungguhnya apabila engkau menghajikannya di atas unta tersebut maka hal itu adalah di jalan Allah.\" Ia berkata; dan ia memintaku untuk bertanya kepada anda, apakah yang sama dengan haji bersama anda? Kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Sampaikan salam dan rahmat serta berkah kepadanya. Umrah pada Bulan Ramadhan adalah sama dengan haji bersamaku.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ وَحَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَأَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَجَّ فَقَالَتْ امْرَأَةٌ لِزَوْجِهَا أَحِجَّنِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى جَمَلِكَ فَقَالَ مَا عِنْدِي مَا أُحِجُّكِ عَلَيْهِ قَالَتْ أَحِجَّنِي عَلَى جَمَلِكَ فُلَانٍ قَالَ ذَاكَ حَبِيسٌ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ امْرَأَتِي تَقْرَأُ عَلَيْكَ السَّلَامَ وَرَحْمَةَ اللَّهِ وَإِنَّهَا سَأَلَتْنِي الْحَجَّ مَعَكَ قَالَتْ أَحِجَّنِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ مَا عِنْدِي مَا أُحِجُّكِ عَلَيْهِ فَقَالَتْ أَحِجَّنِي عَلَى جَمَلِكَ فُلَانٍ فَقُلْتُ ذَاكَ حَبِيسٌ فِي سَبِيلِ اللَّهِ فَقَالَ أَمَا إِنَّكَ لَوْ أَحْجَجْتَهَا عَلَيْهِ كَانَ فِي سَبِيلِ اللَّهِ قَالَ وَإِنَّهَا أَمَرَتْنِي أَنْ أَسْأَلَكَ مَا يَعْدِلُ حَجَّةً مَعَكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرِئْهَا السَّلَامَ وَرَحْمَةَ اللَّهِ وَبَرَكَاتِهِ وَأَخْبِرْهَا أَنَّهَا تَعْدِلُ حَجَّةً مَعِي يَعْنِي عُمْرَةً فِي رَمَضَانَ"
    },
    {
      "number": 1750,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah], ia berkata; sungguh aku pernah berjalan bersama [Abdullah bin Mas'ud] di Mina, tiba-tiba ia bertemu dengan Utsman, kemudian ia mengajaknya menyendiri. Kemudian tatkala Abdullah melihat bahwa ia tidak memiliki keperluan dengannya ia berkata kepadaku; kemarilah wahai 'Alqamah! Kemudian aku datang. Kemudian Utsman berkata kepadanya; maukah kami menikahkanmu wahai Abu Abdurrahman dengan seorang gadis, agar kembali kepadamu semangat dan keperkasaanmu seperti dahulu? Kemudian Abdullah berkata; jika engkau mengatakan demikian sungguh aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian yang memiliki kemampuan maka hendaknya ia menikah, karena hal tersebut lebih dapat menundukkan pandangannya dan lebih menjaga kemaluannya, dan barangsiapa di antara kalian yang belum mampu maka hendaknya ia berpuasa, karena puasa adalah kendali baginya.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَإِنِّي لَأَمْشِي مَعَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ بِمِنًى إِذْ لَقِيَهُ عُثْمَانُ فَاسْتَخْلَاهُ فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَتْ لَهُ حَاجَةٌ قَالَ لِي تَعَالَ يَا عَلْقَمَةُ فَجِئْتُ فَقَالَ لَهُ عُثْمَانُ أَلَا نُزَوِّجُكَ يَا أَبَا عَبْدِ الرَّحْمَنِ بِجَارِيَةٍ بِكْرٍ لَعَلَّهُ يَرْجِعُ إِلَيْكَ مِنْ نَفْسِكَ مَا كُنْتَ تَعْهَدُ فَقَالَ عَبْدُ اللَّهِ لَئِنْ قُلْتَ ذَاكَ لَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اسْتَطَاعَ مِنْكُمْ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ"
    },
    {
      "number": 1877,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [sebagian anak-anak Abu Rafi'] mantan budak Nabi shallallahu 'alaihi wasallam, dari [Ikrimah] mantan budak Ibnu Abbas, dari [Ibnu Abbas], ia berkata; Abdu Yazid? dan saudara-saudaranya yaitu Abu Rukanah telah mencerai Ummu Rukanah dan menikahi seorang wanita dari Muzainah, kemudian wanita tersebut datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; ia tidak memberiku kepuasan kecuali seperti sehelai rambut ini. Ia mengambil sehelai rambut dari kepalanya. Maka Kemudian beliau berkata kepada orang-orang yang duduk bersamanya: \"Apakah kalian melihat Fulan menyerupai demikian dan demikian dari Abdu Yazid? dan Fulan menyerupai darinya demikian dan demikian?\" Mereka mengatakan; ya. Nabi shallallahu 'alaihi wasallam berkata kepada Abdu Yazid?: \"Ceraikan dia!\" Lalu ia melakukan hal tersebut, kemudian beliau berkata: \"Kembalilah kepada isterimu yaitu Ummu Rukanah!\" Ia berkata; sesungguhnya aku telah mencerainya tiga kali wahai Rasulullah. Beliau berkata: \"Aku telah mengetahui, kembalilah kepadanya!\" Dan beliau membacakan ayat: \"Hai Nabi, apabila kamu menceraikan isteri-isterimu maka hendaklah kamu ceraikan mereka pada waktu mereka dapat (menghadapi) iddahnya (yang wajar).\" Abu Daud berkata; dan hadits Nafi' bin 'Ujair, [Abdullah bin Ali bin Yazid? bin Rukanah] dari [ayahnya] dari [kakeknya] bahwa Rukanah telah isterinya sama sekali, kemudian Nabi shallallahu 'alaihi wasallam mengembalikannya kepada Rukanah, hadits tersebut lebih shahih karena anak seseorang dan keluarganya lebih mengetahuinya. Sesungguhnya Rukanah telah mencerai isterinya sama sekali dan Nabi shallallahu 'alaihi wasallam menjadikannya sebagai satu kali talak. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي بَعْضُ بَنِي أَبِي رَافِعٍ مَوْلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عِكْرِمَةَ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ قَالَطَلَّقَ عَبْدُ يَزِيدَ أَبُو رُكَانَةَ وَإِخْوَتِهِ أُمَّ رُكَانَةَ وَنَكَحَ امْرَأَةً مِنْ مُزَيْنَةَ فَجَاءَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ مَا يُغْنِي عَنِّي إِلَّا كَمَا تُغْنِي هَذِهِ الشَّعْرَةُ لِشَعْرَةٍ أَخَذَتْهَا مِنْ رَأْسِهَا فَفَرِّقْ بَيْنِي وَبَيْنَهُ فَأَخَذَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَمِيَّةٌ فَدَعَا بِرُكَانَةَ وَإِخْوَتِهِ ثُمَّ قَالَ لَجُلَسَائِهِ أَتَرَوْنَ فُلَانًا يُشْبِهُ مِنْهُ كَذَا وَكَذَا مِنْ عَبْدِ يَزِيدَ وَفُلَانًا يُشْبِهُ مِنْهُ كَذَا وَكَذَا قَالُوا نَعَمْ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَبْدِ يَزِيدَ طَلِّقْهَا فَفَعَلَ ثُمَّ قَالَ رَاجِعْ امْرَأَتَكَ أُمَّ رُكَانَةَ وَإِخْوَتِهِ قَالَ إِنِّي طَلَّقْتُهَا ثَلَاثًا يَا رَسُولَ اللَّهِ قَالَ قَدْ عَلِمْتُ رَاجِعْهَا وَتَلَا{ يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمْ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ }قَالَ أَبُو دَاوُد وَحَدِيثُ نَافِعِ بْنِ عُجَيْرٍ وَعَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ يَزِيدَ بْنِ رُكَانَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رُكَانَةَ طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَرَدَّهَا إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَحُّ لِأَنَّ وَلَدَ الرَّجُلِ وَأَهْلَهُ أَعْلَمُ بِهِ إِنَّ رُكَانَةَ إِنَّمَا طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَجَعَلَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدَةً"
    },
    {
      "number": 1892,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], dan [Muhammad bin Al 'Ala`] secara makna, mereka berkata; telah menceritakan kepada kami [Ibnu Idris] dari [Muhammad bin Ishaq] dari [Muhammad bin 'Amr bin 'Atho`]. Ibnu Al 'Ala` bin 'Alqamah bin 'Ayyasy berkata; dari [Sulaiman bin Yasar] dari [Salamah bin Shakhr], ia berkata; Ibnu Al 'Ala` Al Bayadhi berkata; saya dahulu adalah orang yang sering menggauli isteri tidak seperti orang selainku yang menggauli isterinya. Tatkala telah masuk Bulan Ramadhan, saya khawatir menggauli isteriku sehingga hal itu berlanjut hingga pagi hari. Maka aku menzhihar isteriku hingga Bulan Ramadhan berlalu. Ketika pada malam hari ia membantuku tiba-tiba tersingkap sedikit darinya, maka tidak lama kemudian saya menggaulinya. Kemudian tatkala pagi hari saya keluar menuju kepada kaumku dan mengabarkan hal tersebut kepada mereka, dan saya katakan; pergilah kalian bersamaku kepada Rasulullah shallallahu 'alaihi wasallam! Lalu mereka mengatakan; tidak, demi Allah kami tidak akan pergi bersamamu. Maka saya pergi kepada Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Kemudian beliau berkata: \"Wahai Salamah, apakah engkau melakukan hal ini?\" Saya katakan; saya melakukan hal ini -sebanyak dua kali-, dan saya bersabar terhadap terhadap keputusan Allah, maka putuskanlah terhadap diriku apa yang telah Allah perlihatkan kepada dirimu. Beliau bersabda: \"Bebaskan budak.\" Aku katakan; demi Dzat yang mengutusmu dengan kebenaran tidaklah saya memiliki budak selain dirinya. Beliau bersabda: \"Berpuasalah dua bulan berturut-turut!\" Lalu saya katakan; tidaklah saya tertimpa sesuatu yang menimpaku kecuali ketika saya berpuasa. Beliau bersabda: \"Berilah makan satu wasaq kurma enam puluh orang miskin.\" Lalu saya katakan; demi Dzat yang mengutusmu dengan kebenaran, sungguh kami bermalam dalam keadaan tidak memiliki makanan. Beliau berkata: \"Pergilah kepada penjaga Shadaqah Bani Zuraiq, hendaknya ia memberikannya kepadamu dan berilah makan enam puluh orang miskin satu wasaq kurma, dan makanlah sisanya bersama keluargamu.\" Kemudian saya kembali kepada kaumku dan berkata; aku dapatkan di sisi kalian kesempitan serta pendapat yang buruk, dan aku dapatkan di sisi Rasulullah shallallahu 'alaihi wasallam kelapangan dan pendapat yang baik, beliau telah memerintahkan agar aku diberi shadaqah kalian. [Ibnu Al 'Ala`] menambahkan; [Ibnu Idris] Bayadhah berkata; Marga dari Bani Zuraiq.",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ الْمَعْنَى قَالَا حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ قَالَ ابْنُ الْعَلَاءِ ابْنِ عَلْقَمَةَ بْنِ عَيَّاشٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ سَلَمَةَ بْنِ صَخْرٍ قَالَ ابْنُ الْعَلَاءِ الْبَيَاضِيُّ قَالَكُنْتُ امْرَأً أُصِيبُ مِنْ النِّسَاءِ مَا لَا يُصِيبُ غَيْرِي فَلَمَّا دَخَلَ شَهْرُ رَمَضَانَ خِفْتُ أَنْ أُصِيبَ مِنْ امْرَأَتِي شَيْئًا يُتَابَعُ بِي حَتَّى أُصْبِحَ فَظَاهَرْتُ مِنْهَا حَتَّى يَنْسَلِخَ شَهْرُ رَمَضَانَ فَبَيْنَا هِيَ تَخْدُمُنِي ذَاتَ لَيْلَةٍ إِذْ تَكَشَّفَ لِي مِنْهَا شَيْءٌ فَلَمْ أَلْبَثْ أَنْ نَزَوْتُ عَلَيْهَا فَلَمَّا أَصْبَحْتُ خَرَجْتُ إِلَى قَوْمِي فَأَخْبَرْتُهُمْ الْخَبَرَ وَقُلْتُ امْشُوا مَعِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا لَا وَاللَّهِ فَانْطَلَقْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ أَنْتَ بِذَاكَ يَا سَلَمَةُ قُلْتُ أَنَا بِذَاكَ يَا رَسُولَ اللَّهِ مَرَّتَيْنِ وَأَنَا صَابِرٌ لِأَمْرِ اللَّهِ فَاحْكُمْ فِيَّ مَا أَرَاكَ اللَّهُ قَالَ حَرِّرْ رَقَبَةً قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَمْلِكُ رَقَبَةً غَيْرَهَا وَضَرَبْتُ صَفْحَةَ رَقَبَتِي قَالَ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ قَالَ وَهَلْ أَصَبْتُ الَّذِي أَصَبْتُ إِلَّا مِنْ الصِّيَامِ قَالَ فَأَطْعِمْ وَسْقًا مِنْ تَمْرٍ بَيْنَ سِتِّينَ مِسْكِينًا قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَقَدْ بِتْنَا وَحْشَيْنِ مَا لَنَا طَعَامٌ قَالَ فَانْطَلِقْ إِلَى صَاحِبِ صَدَقَةِ بَنِي زُرَيْقٍ فَلْيَدْفَعْهَا إِلَيْكَ فَأَطْعِمْ سِتِّينَ مِسْكِينًا وَسْقًا مِنْ تَمْرٍ وَكُلْ أَنْتَ وَعِيَالُكَ بَقِيَّتَهَا فَرَجَعْتُ إِلَى قَوْمِي فَقُلْتُ وَجَدْتُ عِنْدَكُمْ الضِّيقَ وَسُوءَ الرَّأْيِ وَوَجَدْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّعَةَ وَحُسْنَ الرَّأْيِ وَقَدْ أَمَرَنِي أَوْ أَمَرَ لِي بِصَدَقَتِكُمْ زَادَ ابْنُ الْعَلَاءِ قَالَ ابْنُ إِدْرِيسَ بَيَاضَةُ بَطْنٌ مِنْ بَنِي زُرَيْقٍ"
    },
    {
      "number": 1893,
      "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Yahya bin Adam], telah menceritakan kepada kami [Ibnu Idris] dari [Muhammad bin Ishaq] dari [Ma'mar bin Abdullah bin Hanzhalah] dari [Yusuf bin Abdullah bin Salam] dari [Khuwailah binti Malik bin Tsa'labah], ia berkata; suamiku yaitu Aus bin Ash Shamit menzhiharku, kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam mengadukannya kepada beliau, sementara Rasulullah shallallahu 'alaihi wasallam berdialog denganku mengenainya, beliau berkata: \"Bertakwalah kepada Allah, ia adalah anak pamanmu!\" Tidaklah aku beranjak pergi hingga turun Al Qur'an: \"Sesungguhnya Allah telah mendengar perkataan wanita yang mengajukan gugatan kepada kamu tentang suaminya, dan mengadukan (halnya) kepada Allah. Dan Allah mendengar soal jawab antara kamu berdua. Sesungguhnya Allah Maha Mendengar lagi Maha Melihat\" hingga penyebutan kewajiban yang Allah wajibkan. Kemudian beliau berkata: \"Ia bebaskan seorang budak.\" Khuwailah berkata; ia tidak memilikinya. Beliau berkata; ia berpuasa dua bulan berturut-turut. Khuwailah berkata; wahai rasulullah, sesungguhnya ia adalah orang yang tua renta, ia tidak mampu untuk berpuasa. Beliau berkata: \"Hendaknya ia memberi makan enam orang miskin.\" Khuwailah berkata; ia tidak memiliki sesuatu yang dapat ia sedekahkan. Khuwailah berkata; kemudian pada saat itu ia diberi satu 'araq kurma. Aku katakan; wahai Rasulullah, aku akan membantunya dengan satu 'araq yang lainnya. Beliau bersabda: \"Engkau telah berbuat baik, pergilah dan berilah makan untuknya enam puluh orang miskin dan kembalilah kepada anak pamanmu.\" Ma'mar bin Abdullah bin Hanzhalah berkata; 'Araq adalah enam puluh sha'. Abu Daud berkata dalam hadits ini; sesungguhnya Khuwailah membayar kafarah untuk suaminya tanpa meminta pertimbangan darinya. Abu Daud berkata; dan orang ini adalah saudara 'Ubadah bin Ash Shamit. Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdul Aziz bin Yahya Abu Al Ashbagh Al Harrani], telah menceritakan kepada kami [Muhammad bin Salamah] dari [Ibnu Ishaq] dengan sanad ini seperti itu, hanya saja ia mengatakan; dan 'araq adalah keranjang yang memuat tiga puluh sha'. Abu Daud berkata; dan hadits ini lebih shahih daripada hadits Yahya bin Adam. Telah menceritakan kepada kami Musa bin Isma'il, telah menceritakan kepada kami Aban, telah menceritakan kepada kami Yahya dari Abu Salamah bin Abdurrahman, ia berkata; yang dimaksud dengan 'araq yaitu keranjang yang muat lima belas sha'. ",
      "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْظَلَةَ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ عَنْ خُوَيْلَةَ بِنْتِ مَالِكِ بْنِ ثَعْلَبَةَ قَالَتْظَاهَرَ مِنِّي زَوْجِي أَوْسُ بْنُ الصَّامِتِ فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشْكُو إِلَيْهِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجَادِلُنِي فِيهِ وَيَقُولُ اتَّقِي اللَّهَ فَإِنَّهُ ابْنُ عَمِّكِ فَمَا بَرِحْتُ حَتَّى نَزَلَ الْقُرْآنُ{ قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا }إِلَى الْفَرْضِ فَقَالَ يُعْتِقُ رَقَبَةً قَالَتْ لَا يَجِدُ قَالَ فَيَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ شَيْخٌ كَبِيرٌ مَا بِهِ مِنْ صِيَامٍ قَالَ فَلْيُطْعِمْ سِتِّينَ مِسْكِينًا قَالَتْ مَا عِنْدَهُ مِنْ شَيْءٍ يَتَصَدَّقُ بِهِ قَالَتْ فَأُتِيَ سَاعَتَئِذٍ بِعَرَقٍ مِنْ تَمْرٍ قُلْتُ يَا رَسُولَ اللَّهِ فَإِنِّي أُعِينُهُ بِعَرَقٍ آخَرَ قَالَ قَدْ أَحْسَنْتِ اذْهَبِي فَأَطْعِمِي بِهَا عَنْهُ سِتِّينَ مِسْكِينًا وَارْجِعِي إِلَى ابْنِ عَمِّكِقَالَ وَالْعَرَقُ سِتُّونَ صَاعًا قَالَ أَبُو دَاوُد فِي هَذَا إِنَّهَا كَفَّرَتْ عَنْهُ مِنْ غَيْرِ أَنْ تَسْتَأْمِرَهُ قَالَ أَبُو دَاوُد وَهَذَا أَخُو عُبَادَةَ بْنِ الصَّامِتِ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ الْحَرَّانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ ابْنِ إِسْحَقَ بِهَذَا الْإِسْنَادِ نَحْوَهُ إِلَّا أَنَّهُ قَالَ وَالْعَرَقُ مِكْتَلٌ يَسَعُ ثَلَاثِينَ صَاعًا قَالَ أَبُو دَاوُد وَهَذَا أَصَحُّ مِنْ حَدِيثِ يَحْيَى بْنِ آدَمَ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ يَعْنِي بِالْعَرَقِ زِنْبِيلًا يَأْخُذُ خَمْسَةَ عَشَرَ صَاعًا"
    },
    {
      "number": 1970,
      "id": "Telah menceritakan kepada kami [Nashr bin Ali bin Nashr Al Jahdhami], telah mengabarkan kepada kami [Abu Ahmad], telah mengabarkan kepada kami [Israil] dari [Abu Ishaq], dari [Al Bara`], ia berkata; dahulu seseorang apabila telah berpuasa ia tidur dan tidak makan hingga keesokan hari. Sesungguhnya Shirmah bin Qais Al Anshari datang kepada isterinya dan ia dalam keadaan berpuasa, ia berkata; apakah engkau memiliki sesuatu? Isterinya berkata; tidak, mungkin aku bisa pergi dan mencari sesuatu untukmu. Kemudian ia pergi dan Shirmah telah tertidur, lalu isterinya datang dan berkata; merugi engkau. Kemudian sebelum tengah hari ia pingsan, dan ia pada hari itu sedang bekerja di lahan tanahnya. Kemudian ia menyebutkan hal tersebut kepada Nabi shallallahu 'alaihi wasallam. Kemudian turunlah ayat: \"Dihalalkan bagi kamu pada malam hari bulan puasa bercampur dengan isteri-isteri kamu.\" Beliau membacanya hingga firmannya: \"yaitu fajar.\"",
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ الْجَهْضَمِيُّ أَخْبَرَنَا أَبُو أَحْمَدَ أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَكَانَ الرَّجُلُ إِذَا صَامَ فَنَامَ لَمْ يَأْكُلْ إِلَى مِثْلِهَا وَإِنَّ صِرْمَةَ بْنَ قَيْسٍ الْأَنْصَارِيَّ أَتَى امْرَأَتَهُ وَكَانَ صَائِمًا فَقَالَ عِنْدَكِ شَيْءٌ قَالَتْ لَا لَعَلِّي أَذْهَبُ فَأَطْلُبُ لَكَ شَيْئًا فَذَهَبَتْ وَغَلَبَتْهُ عَيْنُهُ فَجَاءَتْ فَقَالَتْ خَيْبَةً لَكَ فَلَمْ يَنْتَصِفْ النَّهَارُ حَتَّى غُشِيَ عَلَيْهِ وَكَانَ يَعْمَلُ يَوْمَهُ فِي أَرْضِهِ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَزَلَتْ{ أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ قَرَأَ إِلَى قَوْلِهِ مِنْ الْفَجْرِ }"
    },
    {
      "number": 1971,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], Telah menceritakan kepada kami [Bakr bin Mudhar] dari ['Amr bin Al Harits] dari [Bukair] dari [Yazid] mantan budak Salamah bin Al Akwa', dari [Salamah bin Al Akwa] 'ia berkata; tatkala telah turun ayat ini: WA 'ALALLADZII YUTHIIQUUNAHU FIDYATUN THA'AAMU MISKIIN (dan bagi orang yang berat menjalankannya, wajib membayar fidyah, yaitu memberi makan seorang miskin), maka barangsiapa diantara kami yang hendak berbuka dan membayar fidyah, ia boleh melakukannya, hingga turunlah ayat yang setelahnya, dan menggantikan hukum ayat tersebut. ",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرٍ عَنْ يَزِيدَ مَوْلَى سَلَمَةَ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ{ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ }كَانَ مَنْ أَرَادَ مِنَّا أَنْ يُفْطِرَ وَيَفْتَدِيَ فَعَلَ حَتَّى نَزَلَتْ هَذِهِ الْآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا"
    },
    {
      "number": 1972,
      "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad], telah menceritakan kepadaku [Ali bin Husain], dari [ayahnya], dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas]: WA 'ALALLADZII YUTHIIQUUNAHU FIDYATUN THA'AAMU MISKIIN (dan bagi orang yang berat menjalankanya, wajib membayar fidyah, yaitu memberi makan seorang miskin), maka barangsiapa diantara mereka yang hendak membayar fidyah dengan memberi makan orang miskin, ia boleh ia membayar fidyah dan telah sempurna baginya puasanya. Kemudian Allah berfirman: \"Barangsiapa yang dengan kerelaan hati mengerjakan kebajikan, maka itulah yang lebih baik baginya. Dan berpuasa lebih baik bagimu jika kamu mengetahui.\" Dan firmanNya: \"barangsiapa di antara kamu hadir (di negeri tempat tinggalnya) di bulan itu, maka hendaklah ia berpuasa pada bulan itu, dan barangsiapa sakit atau dalam perjalanan (lalu ia berbuka), maka (wajiblah baginya berpuasa), sebanyak hari yang ditinggalkannya itu, pada hari-hari yang lain.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرَمَةَ عَنْ ابْنِ عَبَّاسٍ{ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ }فَكَانَ مَنْ شَاءَ مِنْهُمْ أَنْ يَفْتَدِيَ بِطَعَامِ مِسْكِينٍ افْتَدَى وَتَمَّ لَهُ صَوْمُهُ فَقَالَ{ فَمَنْ تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ لَهُ وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ }و قَالَ{ فَمَنْ شَهِدَ مِنْكُمْ الشَّهْرَ فَلْيَصُمْهُ وَمَنْ كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ }"
    },
    {
      "number": 1974,
      "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna], telah menceritakan kepada kami [Ibnu Abu Adi] dari [Sa'id] dari [Qatadah], dari ['Azrah] dari [Sa'id bin Jubair] dari [Ibnu Abbas]: WA 'ALALLADZII YUTHIIQUUNAHU FIDYATUN THA'AAMU MISKIIN (dan bagi orang yang berat menjalankanya, wajib membayar fidyah, yaitu memberi makan seorang miskin), ia berkata; hal tersebut merupakan keringanan bagi laki-laki tua dan wanita tua, dan mereka -sementara kedua mampu melakukan puasa- agar berbuka dan memberi makan setiap hari satu orang miskin, dan keringanan bagi orang yang hamil dan menyusui apabila merasa khawatir. Abu Daud berkata; yaitu khawatir kepada anak mereka berdua, maka mereka berbuka dan memberi makan. ",
      "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ{ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ }قَالَ كَانَتْ رُخْصَةً لِلشَّيْخِ الْكَبِيرِ وَالْمَرْأَةِ الْكَبِيرَةِ وَهُمَا يُطِيقَانِ الصِّيَامَ أَنْ يُفْطِرَا وَيُطْعِمَا مَكَانَ كُلِّ يَوْمٍ مِسْكِينًا وَالْحُبْلَى وَالْمُرْضِعُ إِذَا خَافَتَاقَالَ أَبُو دَاوُد يَعْنِي عَلَى أَوْلَادِهِمَا أَفْطَرَتَا وَأَطْعَمَتَا"
    },
    {
      "number": 1976,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al 'Ataki], telah menceritakan kepada kami [Hammad], telah menceritakan kepada kami [Ayyub], dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu bulan adalah dua puluh sembilan, maka janganlah kalian berpuasa hingga melihatnya dan janganlah berbuka (berhari raya) hingga melihatnya, kemudian apabila tertutup awan maka hitunglah tiga puluh.\" Sulaiman berkata; dan Ibnu Umar apabila Bulan Sya'bah adalah dua puluh sembilan maka ia berpuasa, apabila terlihat maka itulah Ramadhan, dan apabila tidak terlihat dan tidak terhalangi oleh awan serta debu maka pagi harinya ia dalam keadaan berbuka, dan apabila terhalang awan atau debu untuk melihatnya maka di pagi hari dalam keadaan berpuasa. Ia berkata; dan Ibnu Umar berbuka bersama orang-orang dan tidak mengambil perhitungan ini. Telah menceritakan kepada kami [Humaid bin Mas'adah], telah menceritakan kepada kami [Abdul Wahhab], telah menceritakan kepadaku [Ayyub], ia berkata; [Umar bin Abdul Aziz] menulis surat kepada penduduk Bashrah mengatakan; telah sampai kepada kami dari Rasulullah shallallahu 'alaihi wasallam …. Seperti hadits tersebut Ibnu Umar, dari Nabi shallallahu 'alaihi wasallam. Ia menambahkan; dan sesungguhnya sebaik-baik hitungan adalah apabila kami melihat Hilal Sya'ban demikian dan demikian maka puasa insya Allah demikian dan demikian, kecuali apabila kalian melihat Hilal sebelum itu. ",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّهْرُ تِسْعٌ وَعِشْرُونَ فَلَا تَصُومُوا حَتَّى تَرَوْهُ وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ ثَلَاثِينَقَالَ فَكَانَ ابْنُ عُمَرَ إِذَا كَانَ شَعْبَانُ تِسْعًا وَعِشْرِينَ نَظَرَ لَهُ فَإِنْ رُئِيَ فَذَاكَ وَإِنْ لَمْ يُرَ وَلَمْ يَحُلْ دُونَ مَنْظَرِهِ سَحَابٌ وَلَا قَتَرَةٌ أَصْبَحَ مُفْطِرًا فَإِنْ حَالَ دُونَ مَنْظَرِهِ سَحَابٌ أَوْ قَتَرَةٌ أَصْبَحَ صَائِمًا قَالَ فَكَانَ ابْنُ عُمَرَ يُفْطِرُ مَعَ النَّاسِ وَلَا يَأْخُذُ بِهَذَا الْحِسَابِ حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنِي أَيُّوبُ قَالَ كَتَبَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى أَهْلِ الْبَصْرَةِ بَلَغَنَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَادَ وَإِنَّ أَحْسَنَ مَا يُقْدَرُ لَهُ أَنَّا إِذَا رَأَيْنَا هِلَالَ شَعْبَانَ لِكَذَا وَكَذَا فَالصَّوْمُ إِنْ شَاءَ اللَّهُ لِكَذَا وَكَذَا إِلَّا أَنْ تَرَوْا الْهِلَالَ قَبْلَ ذَلِكَ"
    },
    {
      "number": 1977,
      "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] dari [Ibnu Abu Zaidah], dari [Isa bin Dinar] dari [ayahnya], dari ['Amr bin Al Harits bin Abu Dhirar] dari [Ibnu Mas'ud], ia berkata; sungguh kami berpuasa bersama Nabi shallallahu 'alaihi wasallam dua puluh sembilan hari lebih sering daripada kami berpuasa bersamanya tiga puluh hari. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ عَنْ ابْنِ أَبِي زَائِدَةَ عَنْ عِيسَى بْنِ دِينَارٍ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ أَبِي ضِرَارٍ عَنْ ابْنِ مَسْعُودٍ قَالَلَمَا صُمْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعًا وَعِشْرِينَ أَكْثَرَ مِمَّا صُمْنَا مَعَهُ ثَلَاثِينَ"
    },
    {
      "number": 1978,
      "id": "Telah menceritakan kepada kami [Musaddad] bahwa [Yazid bin Zurai'] telah menceritakan kepada mereka; telah menceritakan kepada kami [Khalid Al Hadzdza`] dari [Abdurrahman bin Abu Bakrah] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam beliau berkata: \"Dua bulan 'Id tidaklah berkurang (pahalanya) yaitu Bulan Ramadhan (setelahnya adalah 'Idul Fithri), dan Bulan Dzul Hijjah (padanya 'Idul Adlha).\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ يَزِيدَ بْنَ زُرَيْعٍ حَدَّثَهُمْ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شَهْرَا عِيدٍ لَا يَنْقُصَانِ رَمَضَانُ وَذُو الْحِجَّةِ"
    },
    {
      "number": 1979,
      "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid], telah menceritakan kepada kami [Hammad] dalam hadits [Ayyub] dari [Muhammad bin Al Munkadir] dari [Abu Hurairah], Nabi shallallahu 'alaihi wasallam menyebutkan padanya, beliau berkata: \"Dan Fithri kalian adalah hari kalian berbuka, adlha kalian adalah hari kalian menyembelih, dan seluruh 'Arafah adalah tempat berwukuf, seluruh Mina adalah tempat menyembelih, dan seluruh jalan Mekkah adalah tempat untuk menyembelih dan seluruh Muzdalifah adalah tempat wukuf.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادٌ فِي حَدِيثِ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أَبِي هُرَيْرَةَذَكَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ قَالَ وَفِطْرُكُمْ يَوْمَ تُفْطِرُونَ وَأَضْحَاكُمْ يَوْمَ تُضَحُّونَ وَكُلُّ عَرَفَةَ مَوْقِفٌ وَكُلُّ مِنًى مَنْحَرٌ وَكُلُّ فِجَاجِ مَكَّةَ مَنْحَرٌ وَكُلُّ جَمْعٍ مَوْقِفٌ"
    },
    {
      "number": 1980,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepadaku [Abdurrahman bin Mahdi], telah menceritakan kepadaku [Mu'awiyah bin Shalih] dari [Abdullah bin Abu Qais], ia berkata; saya mendengar [Aisyah] radliallahu 'anha berkata; Rasulullah shallallahu 'alaihi wasallam memperhatikan Bulan Sya'ban tidak seperti perhatian beliau kepada selainnya, kemudian beliau berpuasa karena melihat Ramadhan, apabila terhalang untuk melihatnya maka beliau menggenapkan bilangan tiga puluh hari kemudian beliau berpuasa. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ قَالَ سَمِعْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا تَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَفَّظُ مِنْ شَعْبَانَ مَا لَا يَتَحَفَّظُ مِنْ غَيْرِهِ ثُمَّ يَصُومُ لِرُؤْيَةِ رَمَضَانَ فَإِنْ غُمَّ عَلَيْهِ عَدَّ ثَلَاثِينَ يَوْمًا ثُمَّ صَامَ"
    },
    {
      "number": 1981,
      "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah Al Bazzar], telah menceritakan kepada kami [Jarir bin Abdul Hamid Adh Dhabbi] dari [Manshur bin Al Mu'tamir], dari [Rib'i bin Hirasy] dari [Hudzaifah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Janganlah kalian mendahului bulan hingga melihat Hilal, atau kalian menyempurnakan bilangan, kemudian berpuasalah hingga kalian melihat Hilal atau menyempurnakan bilangan.\" Abu Daud berkata; dan hadits tersebut telah diriwayatkan oleh [Sufyan] dan [yang lainnya], dari [Manshur] dari [Rib'i] dari [seorang sahabat Nabi shallallahu 'alaihi wasallam], dan ia tidak menyebutkan Hudzaifah. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ الضَّبِّيُّ عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقَدِّمُوا الشَّهْرَ حَتَّى تَرَوْا الْهِلَالَ أَوْ تُكْمِلُوا الْعِدَّةَ ثُمَّ صُومُوا حَتَّى تَرَوْا الْهِلَالَ أَوْ تُكْمِلُوا الْعِدَّةَقَالَ أَبُو دَاوُد وَرَوَاهُ سُفْيَانُ وَغَيْرُهُ عَنْ مَنْصُورٍ عَنْ رِبْعِيٍّ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُسَمِّ حُذَيْفَةَ"
    },
    {
      "number": 1982,
      "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Husain], dari [Zaidah] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mendahului bulan dengan puasa satu hari ataupun dua hari, kecuali salah seorang diantara kalian biasa melakukannya, dan janganlah kalian berpuasa hingga melihatnya (hilal), kemudian berpuasalah hingga kalian melihatnya. Kemudian apabila terhalang oleh awan maka sempurnakan hitungan menjadi tiga puluh hari. Kemudian berbukalah! Satu bulan adalah dua puluh sembilan.\" Abu Daud berkata; hadits tersebut diriwayatkan oleh [Hatim bin Abu Shaghirah] serta [Syu'bah], dan [Al Hasan bin Shalih] dari [Simak] semakna dengannya, mereka tidak mengatakan; kemudian berbukalah! Abu Daud berkata; ia adalah Hatim bin Muslim anak Abu Shaghirah, sementara Abu Shaghirah adalah suami ibunya. ",
      "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقَدِّمُوا الشَّهْرَ بِصِيَامِ يَوْمٍ وَلَا يَوْمَيْنِ إِلَّا أَنْ يَكُونَ شَيْءٌ يَصُومُهُ أَحَدُكُمْ وَلَا تَصُومُوا حَتَّى تَرَوْهُ ثُمَّ صُومُوا حَتَّى تَرَوْهُ فَإِنْ حَالَ دُونَهُ غَمَامَةٌ فَأَتِمُّوا الْعِدَّةَ ثَلَاثِينَ ثُمَّ أَفْطِرُوا وَالشَّهْرُ تِسْعٌ وَعِشْرُونَقَالَ أَبُو دَاوُد رَوَاهُ حَاتِمُ بْنُ أَبِي صَغِيرَةَ وَشُعْبَةُ وَالْحَسَنُ بْنُ صَالِحٍ عَنْ سِمَاكٍ بِمَعْنَاهُ لَمْ يَقُولُوا ثُمَّ أَفْطِرُوا قَالَ أَبُو دَاوُد وَهُوَ حَاتِمُ بْنُ مُسْلِمٍ ابْنُ أَبِي صَغِيرَةَ وَأَبُو صَغِيرَةَ زَوْجُ أُمِّهِ"
    },
    {
      "number": 1983,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Mutharrif] dari ['Imran bin Hushain] serta [Sa'id Al Jurairi], dari [Abu Al 'Ala`], dari [Mutharrif] dari [Imran bin Hushain] bahwa Rasulullah shallallahu 'alaihi wasallam berkata kepada seorang laki-laki; apakah engkau berpuasa pada Bulan Sya'ban? Ia berkata; tidak. Beliau berkata; apabila engkau berbuka maka berpuasalah satu hari. Salah seorang diantara mereka berdua mengatakan; dua hari. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ مُطَرِّفٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَسَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ هَلْ صُمْتَ مِنْ شَهْرِ شَعْبَانَ شَيْئًا قَالَ لَا قَالَ فَإِذَا أَفْطَرْتَ فَصُمْ يَوْمًا وَقَالَ أَحَدُهُمَا يَوْمَيْنِ"
    },
    {
      "number": 1984,
      "id": "Telah menceritakan kepada kami [Ibrahim bin Al 'Ala` Az Zubaidi] dari kitabnya, telah menceritakan kepada kami [Al Walid bin Muslim], telah menceritakan kepada kami [Abdullah bin Al 'Ala`], dari [Abu Al Azhar Al Mughirah bin Firwah], ia berkata; [Mu'awiyah] berdiri diantara orang-orang di Dair Mishal yang berada di depan pintu Himsh, ia berkata; wahai para manusia; sesungguhnya kami telah melihat Hilal pada hari ini dan ini, dan aku akan mendahului. Barang siapa yang ingin melakukannya maka hendaknya ia melakukannya. Al Mughirah berkata; kemudian Malik bin Hubairah As Sabai berdiri di sampingnya dan berkata; wahai Mu'awiyah, apakah hal tersebut sesuatu yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam atau sesuatu yang berasal dari pendapatmu? Ia berkata; aku mendengarnya dari Rasulullah shallallahu wa'alaihi wa sallam. Mereka berkata; berpuasalah pada bulan tersebut dan sirrnya (awalnya). Telah menceritakan kepada kami Sulaiman bin Abdurrahman Ad Dimasyqi, mengenai hadits ini, ia berkata; Al Walid berkata; saya mendengar Abu 'Amr Al Auza'i berkata; sirrnya yaitu awalnya. Abu Daud berkata; sebagian mereka mengatakan sirrnya adalah pertengahannya, sedangkan yang lain mengatakan; akhirnya. ",
      "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْعَلَاءِ الزُّبَيْدِيُّ مِنْ كِتَابِهِ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ عَنْ أَبِي الْأَزْهَرِ الْمُغِيرَةِ بْنِ فَرْوَةَ قَالَقَامَ مُعَاوِيَةُ فِي النَّاسِ بِدَيْرِ مِسْحَلٍ الَّذِي عَلَى بَابِ حِمْصَ فَقَالَ أَيُّهَا النَّاسُ إِنَّا قَدْ رَأَيْنَا الْهِلَالَ يَوْمَ كَذَا وَكَذَا وَأَنَا مُتَقَدِّمٌ فَمَنْ أَحَبَّ أَنْ يَفْعَلَهُ فَلْيَفْعَلْهُ قَالَ فَقَامَ إِلَيْهِ مَالِكُ بْنُ هُبَيْرَةَ السَّبَئِيُّ فَقَالَ يَا مُعَاوِيَةُ أَشَيْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْ شَيْءٌ مِنْ رَأْيِكَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ صُومُوا الشَّهْرَ وَسِرَّهُحَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ فِي هَذَا الْحَدِيثِ قَالَ قَالَ الْوَلِيدُ سَمِعْتُ أَبَا عَمْرٍو يَعْنِي الْأَوْزَاعِيَّ يَقُولُ سِرُّهُ أَوَّلُهُ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ حَدَّثَنَا أَبُو مُسْهِرٍ قَالَ كَانَ سَعِيدٌ يَعْنِي ابْنَ عَبْدِ الْعَزِيزِ يَقُولُ سِرُّهُ أَوَّلُهُ قَالَ أَبُو دَاوُد وَقَالَ بَعْضُهُمْ سِرُّهُ وَسَطُهُ وَقَالُوا آخِرُهُ"
    },
    {
      "number": 1985,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Isma'il bin Ja'far], telah mengabarkan kepadaku [Muhammad bin Abu Harmalah], telah mengabarkan kepadaku [Kuraib], bahwa Ummu Al Fadhl binti Al Harits telah mengutusnya pergi kepada Mu'awiyah di Syam. Ia berkata; aku datang ke Syam, dan menunaikan keperluannya, kemudian telah nampak hilal Ramadhan sementara aku berada di Syam. Kami melihat hilal pada malam Jum'at kemudian aku datang ke Madinah pada akhir bulan. Lalu Ibnu Abbas bertanya kepadaku. -kemudian ia menyebutkan hilal. Kemudian [Ibnu Abbas] berkata; kapan kalian melihat hilal? Aku katakan; aku melihatnya pada malam Jum'at. Ia berkata; apakah engkau melihatnya? Aku katakan; ya, dan orang-orang melihatnya. Mereka berpuasa dan Mu'awiyah pun berpuasa. Ibnu Abbas berkata; akan tetapi kami melihatnya pada malam sabtu, dan kami masih berpuasa hingga kami menyempurnakan tiga puluh hari atau kami melihat hilal. Aku katakan; tidakkah engkau cukup dengan (ru`yah) yang dilihat Mu'awiyah dan puasanya? Ia berkata; tidak, demikianlah Rasulullah shallallahu 'alaihi wasallam memerintahkan kami. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ جَعْفَرٍ أَخْبَرَنِي مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ أَخْبَرَنِي كُرَيْبٌأَنَّ أُمَّ الْفَضْلِ ابْنَةَ الْحَارِثِ بَعَثَتْهُ إِلَى مُعَاوِيَةَ بِالشَّامِ قَالَ فَقَدِمْتُ الشَّامَ فَقَضَيْتُ حَاجَتَهَا فَاسْتَهَلَّ رَمَضَانُ وَأَنَا بِالشَّامِ فَرَأَيْنَا الْهِلَالَ لَيْلَةَ الْجُمُعَةِ ثُمَّ قَدِمْتُ الْمَدِينَةَ فِي آخِرِ الشَّهْرَ فَسَأَلَنِي ابْنُ عَبَّاسٍ ثُمَّ ذَكَرَ الْهِلَالَ فَقَالَ مَتَى رَأَيْتُمْ الْهِلَالَ قُلْتُ رَأَيْتُهُ لَيْلَةَ الْجُمُعَةِ قَالَ أَنْتَ رَأَيْتَهُ قُلْتُ نَعَمْ وَرَآهُ النَّاسُ وَصَامُوا وَصَامَ مُعَاوِيَةُ قَالَ لَكِنَّا رَأَيْنَاهُ لَيْلَةَ السَّبْتِ فَلَا نَزَالُ نَصُومُهُ حَتَّى نُكْمِلَ الثَّلَاثِينَ أَوْ نَرَاهُ فَقُلْتُ أَفَلَا تَكْتَفِي بِرُؤْيَةِ مُعَاوِيَةَ وَصِيَامِهِ قَالَ لَا هَكَذَا أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
    },
    {
      "number": 1986,
      "id": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz], telah mengabarkan kepada kami [Ayahku] telah menceritakan kepadaku [Al Asy'ats] dari [Al Hasan] mengenai seorang laki-laki yang berada di sebuah negeri diantara beberapa negeri, kemudian ia berpuasa Hari Senin, dan dua orang laki-laki bersaksi bahwa mereka berdua telah melihat hilal pada malam Ahad. Kemudian Al Hasan berkata; tidaklah laki-laki tersebut dan penduduk negerinya mengqadha` hari tersebut kecuali mereka mengetahui bahwa penduduk suatu negeri diantara negeri-negeri muslimin telah melakukan puasa pada hari Ahad, maka mereka mengqadha`nya. ",
      "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنِي أَبِي حَدَّثَنَا الْأَشْعَثُ عَنْ الْحَسَنِفِي رَجُلٍ كَانَ بِمِصْرٍ مِنْ الْأَمْصَارِ فَصَامَ يَوْمَ الِاثْنَيْنِ وَشَهِدَ رَجُلَانِ أَنَّهُمَا رَأَيَا الْهِلَالَ لَيْلَةَ الْأَحَدِ فَقَالَ لَا يَقْضِي ذَلِكَ الْيَوْمَ الرَّجُلُ وَلَا أَهْلُ مِصْرِهِ إِلَّا أَنْ يَعْلَمُوا أَنَّ أَهْلَ مِصْرٍ مِنْ أَمْصَارِ الْمُسْلِمِينَ قَدْ صَامُوا يَوْمَ الْأَحَدِ فَيَقْضُونَهُ"
    },
    {
      "number": 1987,
      "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair], telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari ['Amr bin Qais] dari [Abu Ishaq], dari [Shilah], ia berkata; kami pernah berada bersama ['Ammar] pada hari yang diragukan, kemudian ia membawa seekor kambing dan sebagian orang menyingkir. Kemudian 'Ammar berkata; barangsiapa yang berpuasa pada hari ini maka sungguh ia telah durhaka kepada Abu Al Qasim (Nabi Muhammad shallallahu 'alaihi wasallam). ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ أَبِي إِسْحَقَ عَنْ صِلَةَ قَالَكُنَّا عِنْدَ عَمَّارٍ فِي الْيَوْمِ الَّذِي يُشَكُّ فِيهِ فَأَتَى بِشَاةٍ فَتَنَحَّى بَعْضُ الْقَوْمِ فَقَالَ عَمَّارٌ مَنْ صَامَ هَذَا الْيَوْمَ فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
    },
    {
      "number": 1988,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam], dari [Yahya bin Abu Katsir] dari [Abu Salamah], dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian mendahului puasa Ramadhan satu hari atau dua hari, kecuali puasa yang biasa dilakukan oleh seseorang, maka silahkan ia melakukan puasa tersebut!\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُقَدِّمُوا صَوْمَ رَمَضَانَ بِيَوْمٍ وَلَا يَوْمَيْنِ إِلَّا أَنْ يَكُونَ صَوْمٌ يَصُومُهُ رَجُلٌ فَلْيَصُمْ ذَلِكَ الصَّوْمَ"
    },
    {
      "number": 1989,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah], dari [Taubah Al 'Anbari] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam bahwa ia tidak pernah berpuasa sunah satu bulan penuh kecuali Bulan Sya'ban, beliau menyambungnya dengan Ramadhan. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ تَوْبَةَ الْعَنْبَرِيِّ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ لَمْ يَكُنْ يَصُومُ مِنْ السَّنَةِ شَهْرًا تَامًّا إِلَّا شَعْبَانَ يَصِلُهُ بِرَمَضَانَ"
    },
    {
      "number": 1990,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Abdul Aziz bin Muhammad], ia berkata; 'Abbad bin Katsir datang ke Madinah kemudian ia datang ke Majelis Al 'Ala` dan menggandeng tangannya dan mengajaknya berdiri, kemudian berkata; ya Allah, orang ini telah menceritakan dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Apabila telah berlalu setengah dari bulan Sya'ban, maka janganlah kalian berpuasa!\" kemudian [Al 'Ala`] berkata; ya Allah, sesungguhnya [ayahku] telah menceritakan kepadaku dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Ats Tsuri], [Syibl bin Al 'Ala`], [Abu 'Umais], serta [Zuhair bin Muhammad], dari [Al 'Ala`]. Abu Daud berkata; dan Abdurrahman tidak menceritakannya. Aku katakan kepada Ahmad; mengapa ia mengatakan menurutnya bahwa Nabi shallallahu 'alaihi wasallam menyambung Sya'ban dengan Ramadhan sementara Abu Hurairah mengatakan dari Nabi shallallahu 'alaihi wasallam sesuatu yang menyelisihinya? Abu Daud berkata; menurutku hal ini tidaklah menyelisihinya, dan tidak ada yang meriwayatkannya selain Al 'Ala` dari ayahnya.",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ قَالَقَدِمَ عَبَّادُ بْنُ كَثِيرٍ الْمَدِينَةَ فَمَالَ إِلَى مَجْلِسِ الْعَلَاءِ فَأَخَذَ بِيَدِهِ فَأَقَامَهُ ثُمَّ قَالَ اللَّهُمَّ إِنَّ هَذَا يُحَدِّثُ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا انْتَصَفَ شَعْبَانُ فَلَا تَصُومُوافَقَالَ الْعَلَاءُ اللَّهُمَّ إِنَّ أَبِي حَدَّثَنِي عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ قَالَ أَبُو دَاوُد رَوَاهُ الثَّوْرِيُّ وَشِبْلُ بْنُ الْعَلَاءِ وَأَبُو عُمَيْسٍ وَزُهَيْرُ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ قَالَ أَبُو دَاوُد وَكَانَ عَبْدُ الرَّحْمَنِ لَا يُحَدِّثُ بِهِ قُلْتُ لِأَحْمَدَ لِمَ قَالَ لِأَنَّهُ كَانَ عِنْدَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصِلُ شَعْبَانَ بِرَمَضَانَ وَقَالَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِلَافَهُ قَالَ أَبُو دَاوُد وَلَيْسَ هَذَا عِنْدِي خِلَافُهُ وَلَمْ يَجِئْ بِهِ غَيْرُ الْعَلَاءِ عَنْ أَبِيهِ"
    },
    {
      "number": 1992,
      "id": "Telah menceritakan kepada kami [Musaddad], serta [Khalaf bin Hisyam Al Muqri`], mereka berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Manshur] dari [Rib'i bin Hirasy] dari [seorang sahabat Nabi shallallahu 'alaihi wasallam], ia berkata; orang-orang berselisih mengenai akhir hari Ramadhan. Kemudian terdapat dua orang badui yang datang dan memberikan persaksian di hadapan Nabi shallallahu 'alaihi wasallam dengan nama Allah, sungguh mereka telah menyaksikan Hilal kemarin sore. Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan orang-orang agar berbuka. Khalaf menambahkan dalam haditsnya; dan agar mereka pergi ke lapangan. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ وَخَلَفُ بْنُ هِشَامٍ الْمُقْرِئُ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَاخْتَلَفَ النَّاسُ فِي آخِرِ يَوْمٍ مِنْ رَمَضَانَ فَقَدِمَ أَعْرَابِيَّانِ فَشَهِدَا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّهِ لَأَهَلَّا الْهِلَالَ أَمْسِ عَشِيَّةً فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّاسَ أَنْ يُفْطِرُوا زَادَ خَلَفٌ فِي حَدِيثِهِ وَأَنْ يَغْدُوا إِلَى مُصَلَّاهُمْ"
    },
    {
      "number": 1993,
      "id": "Telah menceritakan kepada kami [Muhammad bin Bakkar bin Ar Rayyan], telah menceritakan kepada kami [Al Walid bin Abu Tsaur], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Al Husain Al Ju'fi] dari [Zaidah] secara makna, dari [Simak], dari [Ikrimah] dari [Ibnu Abbas], ia berkata; seorang badui telah datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; sesungguhnya aku telah melihat Hilal -Al Hasan dalam haditsnya mengatakan; yaitu Hilal Ramadhan-, kemudian beliau berkata; apakah engkau bersaksi bahwa tidak ada tuhan yang berhak disembah disembah kecuali Allah? Ia berkata; ya. Beliau berkata; apakah engkau bersaksi bahwa Muhammad adalah Rasulullah? Ia berkata; ya. Beliau berkata; wahai Bilal, umumkan kepada orang-orang agar mereka berpuasa besok. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ حَدَّثَنَا الْوَلِيدُ يَعْنِي ابْنَ أَبِي ثَوْرٍ ح و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا الْحُسَيْنُ يَعْنِي الْجُعْفِيَّ عَنْ زَائِدَةَ الْمَعْنَى عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَجَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي رَأَيْتُ الْهِلَالَ قَالَ الْحَسَنُ فِي حَدِيثِهِ يَعْنِي رَمَضَانَ فَقَالَ أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ نَعَمْ قَالَ أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ قَالَ نَعَمْ قَالَ يَا بِلَالُ أَذِّنْ فِي النَّاسِ فَلْيَصُومُوا غَدًا"
    },
    {
      "number": 1995,
      "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] serta [Abdullah bin Abdurrahman As Samarqandi], dan aku lebih yakin kepada haditsnya, mereka berkata; telah menceritakan kepada kami [Marwan bin Muhammad] dari [Abdullah bin Wahb] dari [Yahya bin Abdullah bin Salim] dari [Abu Bakr bin Nafi'] dari [ayahnya] dari [Ibnu Umar], ia berkata; orang-orang berusaha untuk melihat hilal, kemudian aku beritahukan kepada Rasulullah shallallahu 'alaihi wasallam bahwa aku telah melihatnya. Kemudian beliau berpuasa dan memerintahkan orang-orang agar berpuasa. ",
      "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ السَّمْرَقَنْدِيُّ وَأَنَا لِحَدِيثِهِ أَتْقَنُ قَالَا حَدَّثَنَا مَرْوَانُ هُوَ ابْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ سَالِمٍ عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَتَرَاءَى النَّاسُ الْهِلَالَ فَأَخْبَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي رَأَيْتُهُ فَصَامَهُ وَأَمَرَ النَّاسَ بِصِيَامِهِ"
    },
    {
      "number": 1996,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Al Mubarak], dari [Musa bin Ali Rabah], dari [ayahnya] dari [Abu Qais] mantan budak 'Amr bin Al 'Ash, dari ['Amr bin Al 'Ash], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya pembeda antara puasa kita dan puasa ahli kitab adalah makan sahur.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مُوسَى بْنِ عَلِيِّ بْنِ رَبَاحٍ عَنْ أَبِيهِ عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فَصْلَ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ"
    },
    {
      "number": 1997,
      "id": "Telah menceritakan kepada kami ['Amr bin Muhammad An Naqid], telah menceritakan kepada kami [Hammad bin Khalid Al Khayyath], telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Yunus bin Saif], dari [Al Harits bin Ziyad] dari [Abu Ruhm] dari [Al 'Irbadh bin Sariyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengundangku untuk makan sahur pada Bulan Ramadhan, beliau berkata; \"Kemarilah untuk makan siang yang mendapat berkah!\"",
      "arab": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ يُونُسَ بْنِ سَيْفٍ عَنْ الْحَارِثِ بْنِ زِيَادٍ عَنْ أَبِي رُهْمٍ عَنْ الْعِرْبَاضِ بْنِ سَارِيَةَ قَالَدَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى السَّحُورِ فِي رَمَضَانَ فَقَالَ هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ"
    },
    {
      "number": 1998,
      "id": "Telah menceritakan kepada kami [Umar bin Al Husain bin Ibrahim], telah menceritakan kepada kami [Muhammad bin Abu Al Wazir Abu Al Mutharrif], telah menceritakan kepada kami [Muhammad bin Musa] dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik (makanan) sahur bagi seorang mukmin adalah kurma.\"",
      "arab": "حَدَّثَنَا عُمَرُ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْوَزِيرِ أَبُو الْمُطَرِّفِ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نِعْمَ سَحُورُ الْمُؤْمِنِ التَّمْرُ"
    },
    {
      "number": 2004,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Hisyam], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abdullah bin Daud] dari [Hisyam] secara makna, Hisyam bin 'Urwah berkata; dari [ayahnya], dari ['Ashim bin Umar], dari [ayahnya], ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila Malam telah datang dari sini dan siang telah pergi -Musaddad menambahkan; dan matahari telah tenggelam- maka sungguh orang yang berpuasa telah berbuka.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامٌ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ هِشَامٍ الْمَعْنَى قَالَ هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَاصِمِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَاءَ اللَّيْلُ مِنْ هَا هُنَا وَذَهَبَ النَّهَارُ مِنْ هَا هُنَا زَادَ مُسَدَّدٌ وَغَابَتْ الشَّمْسُ فَقَدْ أَفْطَرَ الصَّائِمُ"
    },
    {
      "number": 2005,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abdul Wahid], telah menceritakan kepada kami [Sulaiman Asy Syaibni], ia berkata; saya mendengar [Abdullah bin Abu Aufa] berkata; kami berjalan bersama Rasulullah shallallahu 'alaihi wasallam sementara beliau sedang berpuasa, kemudian tatkala matahari telah tenggelam beliau berkata; wahai Bilal, turun dan aduklah untuk kami. Ia berkata; wahai Rasulullah, seandainya anda menunggu hingga masuk sore hari dengan sempurna! Beliau berkata: \"Turun dan aduklah untuk kami!\" Ia berkata; wahai Rasulullah, sesungguhnya anda masih berada pada siang hari. Beliau berkata: \"Turun dan aduklah untuk kami!\" Kemudian ia turun dan mengaduk. Lalu Rasulullah shallallahu 'alaihi wasallam minum kemudian bersabda: \"Apabila kalian melihat malam telah datang dari sini, maka orang yang berpuasa telah berbuka.\" Beliau menunjuk dengan jarinya ke arah timur. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولُسِرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ صَائِمٌ فَلَمَّا غَرَبَتْ الشَّمْسُ قَالَ يَا بِلَالُ انْزِلْ فَاجْدَحْ لَنَا قَالَ يَا رَسُولَ اللَّهِ لَوْ أَمْسَيْتَ قَالَ انْزِلْ فَاجْدَحْ لَنَا قَالَ يَا رَسُولَ اللَّهِ إِنَّ عَلَيْكَ نَهَارًا قَالَ انْزِلْ فَاجْدَحْ لَنَا فَنَزَلَ فَجَدَحَ فَشَرِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ إِذَا رَأَيْتُمْ اللَّيْلَ قَدْ أَقْبَلَ مِنْ هَا هُنَا فَقَدْ أَفْطَرَ الصَّائِمُ وَأَشَارَ بِأُصْبُعِهِ قِبَلَ الْمَشْرِقِ"
    },
    {
      "number": 2006,
      "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid] dari [Muhammad bin 'Amr] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau berkata: \"Agama ini akan senantiasa nampak selama orang-orang (kaum muslimin) menyegerakan berbuka, karena orang-orang yahudi dan nashrani menundanya.\"",
      "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَزَالُ الدِّينُ ظَاهِرًا مَا عَجَّلَ النَّاسُ الْفِطْرَ لِأَنَّ الْيَهُودَ وَالنَّصَارَى يُؤَخِّرُونَ"
    },
    {
      "number": 2008,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abdul Wahid bin Ziyad] dari ['Ashim Al Ahwal], dari [Hafshah binti Sirin] dari [Ar Rabab] dari [Salman bin 'Amir yang merupakan pamannya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang diantara kalian sedang berpuasa, maka hendaknya ia berbuka dengan kurma, apabila ia tidak mendapatkan kurma hendaknya dengan air, karena sesungguhnya air dapat membersihkan (zhahir dan batin, atau menghilangkan rasa haus).\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ عَمِّهَا قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ أَحَدُكُمْ صَائِمًا فَلْيُفْطِرْ عَلَى التَّمْرِ فَإِنْ لَمْ يَجِدْ التَّمْرَ فَعَلَى الْمَاءِ فَإِنَّ الْمَاءَ طَهُورٌ"
    },
    {
      "number": 2010,
      "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Yahya Abu Muhammad], telah menceritakan kepada kami [Ali bin Al Hasan], telah mengabarkan kepadaku [Al Husain bin Waqid], telah menceritakan kepada kami [Marwan bin Salim Al Muqaffa'], ia berkata; saya melihat [Ibnu Umar] menggenggam jenggotnya dan memotong jenggot yang melebihi telapak tangan. Dan ia berkata; dahulu Rasulullah shallallahu 'alaihi wasallam apabila berbuka beliau mengucapkan: DZAHABAZH ZHAMAA`U WABTALLATIL 'URUUQU WA TSABATIL AJRU IN SYAA-ALLAAH (Telah hilang dahaga, dan telah basah tenggorokan, dan telah tetap pahala insya Allah). ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ يَحْيَى أَبُو مُحَمَّدٍ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ أَخْبَرَنِي الْحُسَيْنُ بْنُ وَاقِدٍ حَدَّثَنَا مَرْوَانُ يَعْنِي ابْنَ سَالِمٍ الْمُقَفَّعَ قَالَرَأَيْتُ ابْنَ عُمَرَ يَقْبِضُ عَلَى لِحْيَتِهِ فَيَقْطَعُ مَا زَادَ عَلَى الْكَفِّ وَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَفْطَرَ قَالَ ذَهَبَ الظَّمَأُ وَابْتَلَّتْ الْعُرُوقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ"
    },
    {
      "number": 2011,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Husyaim], dari [Hushain] dari [Mu'adz bin Zuhrah], bahwa telah sampai kepadanya bahwa Nabi shallallahu 'alaihi wasallam apabila berbuka beliau mengucapkan: ALLAAHUMMA LAKA SHUMTU WA 'ALAA RIZQIKA AFTHARTU (Ya Allah, untukMu aku berpuasa, dan dengan rizqiMu aku berbuka). ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا هُشَيْمٌ عَنْ حُصَيْنٍ عَنْ مُعَاذِ بْنِ زُهْرَةَ أَنَّهُ بَلَغَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَفْطَرَ قَالَ اللَّهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ"
    },
    {
      "number": 2012,
      "id": "Telah menceritakan kepada kami [Harun bin Abdullah] dan [Muhammad bin Al 'Ala`] secara makna, mereka berkata; telah menceritakan kepada kami [Abu Usamah], telah menceritakan kepada kami [Hisyam bin 'Urwah], dari [Fathimah binti Al Mundzir], dari [Asma` binti Abu Bakr], ia berkata; pada suatu hari kami berbuka pada Bulan Ramadhan dalam cuaca yang mendung pada zaman Rasulullah shallallahu 'alaihi wasallam kemudian matahari nampak. Abu Usamah berkata; aku katakan kepada Hisyam; apakah mereka diperintahkan untuk mengqadha`? Ia menjawab, Ia harus mengqadha`nya. ",
      "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ وَمُحَمَّدُ بْنُ الْعَلَاءِ الْمَعْنَى قَالَا حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْأَفْطَرْنَا يَوْمًا فِي رَمَضَانَ فِي غَيْمٍ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ طَلَعَتْ الشَّمْسُقَالَ أَبُو أُسَامَةَ قُلْتُ لِهِشَامٍ أُمِرُوا بِالْقَضَاءِ قَالَ وَبُدٌّ مِنْ ذَلِكَ"
    },
    {
      "number": 2014,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] bahwa [Abu Bakr bin Mudhar] telah menceritakan kepada mereka, dari [Ibnu Al Had] dari [Abdullah bin Khabbab] dari [Abu Sa'id Al Khudri] bahwa ia telah mendengar Rasulullah shallallahu 'alaihi wasallam berkata: \"Janganlah kalian melakukan puasa wishal, barangsiapa diantara kalian yang menghendaki untuk melakukan wishal maka hendaknya ia melakukannya hingga waktu sahur.\" Mereka berkata; anda melakukannya. Beliau berkata: \"Sesungguhnya aku tidak seperti kalian, aku memiliki Pemberi makan dan Pemberi minum.\"",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ أَنَّ بَكْرَ بْنَ مُضَرَ حَدَّثَهُمْ عَنْ ابْنِ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُوَاصِلُوا فَأَيُّكُمْ أَرَادَ أَنْ يُوَاصِلَ فَلْيُوَاصِلْ حَتَّى السَّحَرَ قَالُوا فَإِنَّكَ تُوَاصِلُ قَالَ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنَّ لِي مُطْعِمًا يُطْعِمُنِي وَسَاقِيًا يَسْقِينِي"
    },
    {
      "number": 2016,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Puasa adalah tameng, apabila salah seorang diantara kalian berpuasa maka janganlah ia berkata kotor, dan melakukan perbuatan bodoh. Apabila terdapat seseorang memusuhinya atau mencelanya maka hendaknya ia mengatakan; aku sedang berpuasa.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الصِّيَامُ جُنَّةٌ إِذَا كَانَ أَحَدُكُمْ صَائِمًا فَلَا يَرْفُثْ وَلَا يَجْهَلْ فَإِنْ امْرُؤٌ قَاتَلَهُ أَوْ شَاتَمَهُ فَلْيَقُلْ إِنِّي صَائِمٌ إِنِّي صَائِمٌ"
    },
    {
      "number": 2017,
      "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah], telah menceritakan kepada kami [Syarik], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya] dari [Sufyan] dari ['Ashim bin 'Ubaidullah] dari [Abdullah bin 'Amir bin Rabi'ah] dari [ayahnya], ia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam memakai siwak sementara beliau sedang berpuasa. Musaddad menambahkan; yang tidak dapat aku hitung. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا شَرِيكٌ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ عَنْ أَبِيهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَاكُ وَهُوَ صَائِمٌ زَادَ مُسَدَّدٌ مَا لَا أَعُدُّ وَلَا أُحْصِي"
    },
    {
      "number": 2018,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Sumai] mantan budak Abu Bakr bin Abdurrahman, dari [Abu Bakr bin Abdurrahman] dari [sebagian sahabat Nabi shallallahu 'alaihi wasallam], beliau bersabda: \"Aku melihat Rasulullah shallallahu 'alaihi wasallam memerintahkan orang-orang ketika dalam perjalanannya pada tahun penaklukan Mekkah untuk berbuka.\" Beliau berkata: \"Perkuatlah tubuh kalian untuk menghadapi musuh!\" sementara Rasulullah shallallahu 'alaihi wasallam berpuasa. Abu Bakr berkata; telah berkata orang yang telah menceritakan kepadaku; sungguh aku telah melihat Rasulullah shallallahu 'alaihi wasallam di Al 'Arj menuangkan air ke kepalanya karena haus atau panas, sementara beliau sedang berpuasa. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ النَّاسَ فِي سَفَرِهِ عَامَ الْفَتْحِ بِالْفِطْرِ وَقَالَ تَقَوَّوْا لِعَدُوِّكُمْ وَصَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو بَكْرٍ قَالَ الَّذِي حَدَّثَنِي لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعَرْجِ يَصُبُّ عَلَى رَأْسِهِ الْمَاءَ وَهُوَ صَائِمٌ مِنْ الْعَطَشِ أَوْ مِنْ الْحَرِّ"
    },
    {
      "number": 2020,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya] dari [Hisyam], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Hasan bin Musa], telah menceritakan kepada kami [Syaiban], dari [Yahya] dari [Abu Qilabah], dari [Abu Asma` Ar Rahabi] dari [Tsauban] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Telah batal puasa orang yang berbekam dan orang yang dibekam.\" [Syaiban] berkata; telah mengabarkan kepadaku [Abu Qilabah] bahwa [Asma` Ar Rahabi] telah menceritakan kepadanya bahwa [Tsauban] mantan budak Rasulullah shallallahu 'alaihi wasallam telah mengabarkan kepadanya bahwa ia telah mendengar Nabi shallallahu 'alaihi wasallam. Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Hasan bin Musa], telah menceritakan kepada kami [Syaiban] dari [Yahya], ia berkata; telah menceritakan kepadaku [Abu Qilabah Al jarmi], bahwa ia telah mengabarkan kepadanya bahwa [Syaddad bin Aus] ketika berjalan bersama Nabi shallallahu 'alaihi wasallam ….. kemudian ia menyebutkan seperti itu.",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ هِشَامٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا شَيْبَانُ جَمِيعًا عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ يَعْنِي الرَّحَبِيَّ عَنْ ثَوْبَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ قَالَ شَيْبَانُ أَخْبَرَنِي أَبُو قِلَابَةَ أَنَّ أَبَا أَسْمَاءَ الرَّحَبِيَّ حَدَّثَهُ أَنَّ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى قَالَ حَدَّثَنِي أَبُو قِلَابَةَ الْجَرْمِيُّ أَنَّهُ أَخْبَرَهُ أَنَّ شَدَّادَ بْنَ أَوْسٍ بَيْنَمَا هُوَ يَمْشِي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ"
    },
    {
      "number": 2021,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Wuhaib], telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Abu Al Asy'ats] dari [Syaddad bin Aus] bahwa Rasulullah shallallahu 'alaihi wasallam datang kepada seseorang di Baqi' sementara orang tersebut sedang berbekam, sementara beliau menggandeng tanganku- selama delapan belas hari yang telah berlalu pada Bulan Ramadhan. Kemudian beliau berkata: \"Telah batal puasa orang yang membekam dan yang dibekam.\" Abu Daud berkata; dan [Khalid Al Hadzdza`] telah meriwayatkan dari [Abu Qilabah] dengan sanad Ayyub seperti itu. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْأَشْعَثِ عَنْ شَدَّادِ بْنِ أَوْسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى عَلَى رَجُلٍ بِالْبَقِيعِ وَهُوَ يَحْتَجِمُ وَهُوَ آخِذٌ بِيَدِي لِثَمَانِ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ فَقَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ قَالَ أَبُو دَاوُد وَرَوَى خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ بِإِسْنَادِ أَيُّوبَ مِثْلَهُ"
    },
    {
      "number": 2022,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Muhammad bin Bakr] serta [Abdurrazzaq], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ibnu Juraij], telah mengabarkan kepadaku [Makhul] bahwa [seorang tua] dari sebuah kampong, -Utsman berkata dalam haditsnya; orang yang dipercaya- telah mengabarkan kepadanya bahwa [Tsauban] mantan budak Rasulullah shallallahu 'alaihi wasallam telah mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Telah batal puasa orang yang membekam dan yang dibekam.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ وَعَبْدُ الرَّزَّاقِ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ إِبْرَاهِيمَ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي مَكْحُولٌ أَنَّ شَيْخًا مِنْ الْحَيِّ قَالَ عُثْمَانُ فِي حَدِيثِهِ مُصَدَّقٌ أَخْبَرَهُ أَنَّ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ"
    },
    {
      "number": 2023,
      "id": "Telah menceritakan kepada kami [Mahmud bin Khalid], telah menceritakan kepada kami [Marwan], telah menceritakan kepada kami [Al Haitsam bin Humaid], telah mengabarkan kepada kami [Al 'Ala` bin Al Harits] dari [Makhul] dari [Abu Asma` Ar Rahabi] dari [Tsauban] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Telah batal puasa orang yang membekam dan yang dibekam.\" Abu Daud berkata; hadits tersebut diriwayatkan oleh [Ibnu Tsauban] dari [ayahnya] dari [Makhul] dengan sanadnya seperti itu. ",
      "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا مَرْوَانُ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ أَخْبَرَنَا الْعَلَاءُ بْنُ الْحَارِثِ عَنْ مَكْحُولٍ عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ عَنْ ثَوْبَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُقَالَ أَبُو دَاوُد وَرَوَاهُ ابْنُ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ بِإِسْنَادِهِ مِثْلَهُ"
    },
    {
      "number": 2024,
      "id": "Telah menceritakan kepada kami [Abu Ma'mar Abdullah bin Umar], telah menceritakan kepada kami [Abdul Warits] dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam berbekam sementara beliau dalam keadaan berpuasa. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Wuhaib bin Khalid] dari [Ayyub] dengan sanadnya seperti itu, serta diriwayatkan oleh [Ja'far bin Rabi'ah] serta [Hisyam bin Hassan] dari [Ikrimah] dari [Ibnu Abbas] seperti itu. ",
      "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَيُّوبَ عَنْ عِكرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ صَائِمٌقَالَ أَبُو دَاوُد رَوَاهُ وُهَيْبُ بْنُ خَالِدٍ عَنْ أَيُّوبَ بِإِسْنَادِهِ مِثْلَهُ وَجَعْفَرُ بْنُ رَبِيعَةَ وَهِشَامُ بْنُ حَسَّانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ مِثْلَهُ"
    },
    {
      "number": 2026,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Abdurrahman bin 'Abis] dari [Abdurrahman bin Abu Laila], telah menceritakan kepadaku [seorang sahabat] Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang dari berbekam serta berpuasa wishal dan beliau tidak mengharamkannya sebagai belas kasih kepada para sahabatnya. Kemudian dikatakan kepada beliau; wahai Rasulullah, anda melakukan wishal hingga waktu sahur. Maka beliau berkata: \"Aku melakukan (puasa) wishal hingga waktu sahur dan Tuhanku memberiku makan dan minum.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى حَدَّثَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحِجَامَةِ وَالْمُوَاصَلَةِ وَلَمْ يُحَرِّمْهُمَا إِبْقَاءً عَلَى أَصْحَابِهِ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ إِنَّكَ تُوَاصِلُ إِلَى السَّحَرِ فَقَالَ إِنِّي أُوَاصِلُ إِلَى السَّحَرِ وَرَبِّي يُطْعِمُنِي وَيَسْقِينِي"
    },
    {
      "number": 2027,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah], telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dari [Tsabit], ia berkata; [Anas] berkata; kami tidak akan meninggalkan bekam bagi orang yang berpuasa, kecuali karena tidak menginginkan kondisi payah. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ عَنْ ثَابِتٍ قَالَ قَالَ أَنَسٌمَا كُنَّا نَدَعُ الْحِجَامَةَ لِلصَّائِمِ إِلَّا كَرَاهِيَةَ الْجَهْدِ"
    },
    {
      "number": 2028,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Zaid bin Aslam] dari [seorang laki-laki sahabatnya] dari [seorang sahabat Nabi shallallahu 'alaihi wasallam], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah batal puasa orang yang muntah, orang yang bermimpi, dan orang yang berbekam.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ رَجُلٍ مِنْ أَصْحَابِهِ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفْطِرُ مَنْ قَاءَ وَلَا مَنْ احْتَلَمَ وَلَا مَنْ احْتَجَمَ"
    },
    {
      "number": 2029,
      "id": "Telah menceritakan kepada kami [An Nufaili], telah menceritakan kepada kami [Ali bin Tsabit], telah menceritakan kepadaku [Abdurrahman bin An Nu'man bin Ma'bad bin Haudzah] dari [ayahnya], dari [kakeknya] dari Nabi shallallahu 'alaihi wasallam bahwa beliau memerintahkan untuk memakai Itsmid yang berminyak wangi ketika hendak tidur. Dan beliau berkata: \"Dan orang yang berpuasa hendaknya menghindarinya.\" Abu Daud berkata; Yahya bin Ma'in telah mengatakan kepadaku; hadits tersebut adalah hadits munkar, yaitu hadits mengenai celak. ",
      "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ النُّعْمَانِ بْنِ مَعْبَدِ بْنِ هَوْذَةَ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَمَرَ بِالْإِثْمِدِ الْمُرَوَّحِ عِنْدَ النَّوْمِ وَقَالَ لِيَتَّقِهِ الصَّائِمُقَالَ أَبُو دَاوُد قَالَ لِي يَحْيَى بْنُ مَعِينٍ هُوَ حَدِيثٌ مُنْكَرٌ يَعْنِي حَدِيثَ الْكُحْلِ"
    },
    {
      "number": 2030,
      "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah], telah mengabarkan kepada kami [Abu Mu'awiyah] dari ['Utbah Abu Mu'adz] dari [Ubaidillah bin Abu Bakr] bin Anas dari [Anas bin Malik] bahwa ia memakai celak sementara beliau dalam keadaan berpuasa. ",
      "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ عُتْبَةَ أَبِي مُعَاذٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّهُ كَانَ يَكْتَحِلُ وَهُوَ صَائِمٌ"
    },
    {
      "number": 2031,
      "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Al Mukharrimi] dan [Yahya bin Musa Al Balkhi], mereka berdua mengatakan; telah menceritakan kepada kami [Yahya bin Isa] dari [Al A'masy], ia berkata; aku tidak melihat seorang pun dari para sahabat kita yang membenci celak bagi orang yang berpuasa. Dan Ibrahim memberikan keringanan agar orang yang berpuasa bercelak menggunakan shabir. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْمُخَرِّمِيُّ وَيَحْيَى بْنُ مُوسَى الْبَلْخِيُّ قَالَا حَدَّثَنَا يَحْيَى بْنُ عِيسَى عَنْ الْأَعْمَشِ قَالَمَا رَأَيْتُ أَحَدًا مِنْ أَصْحَابِنَا يَكْرَهُ الْكُحْلَ لِلصَّائِمِوَكَانَ إِبْرَاهِيمُ يُرَخِّصُ أَنْ يَكْتَحِلَ الصَّائِمُ بِالصَّبِرِ"
    },
    {
      "number": 2032,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Isa bin Yunus], telah menceritakan kepada kami [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang muntah tanpa disengaja ketika sedang berpuasa, maka ia tidak berkewajiban untuk mengqadha`, dan apabila ia sengaja untuk muntah maka hendaknya ia mengqadha`.\" Abu Daud berkata; hadits tersebut diriwayatkan juga oleh [Hafsh bin Ghiyats] dari [Hisyam] seperti itu. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ذَرَعَهُ قَيْءٌ وَهُوَ صَائِمٌ فَلَيْسَ عَلَيْهِ قَضَاءٌ وَإِنْ اسْتَقَاءَ فَلْيَقْضِ قَالَ أَبُو دَاوُد رَوَاهُ أَيْضًا حَفْصُ بْنُ غِيَاثٍ عَنْ هِشَامٍ مِثْلَهُ"
    },
    {
      "number": 2034,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy], dari [Ibrahim] dari [Al Aswad] dan ['Alqamah] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam mencium (istrinya) dalam keadaan sedang berpuasa. Dan juga memeluk (istrinya) dalam keadaan sedang berpuasa, akan tetapi beliau adalah orang yang paling dapat menahan nafsunya. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ وَعَلْقَمَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ وَهُوَ صَائِمٌ وَيُبَاشِرُ وَهُوَ صَائِمٌ وَلَكِنَّهُ كَانَ أَمْلَكَ لِإِرْبِهِ"
    },
    {
      "number": 2035,
      "id": "Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'], telah menceritakan kepada kami [Abu Al Ahwash] dari [Ziyad bin 'Alaqah] dari ['Amr bin Maimun] dari [Aisyah], ia berkata; Nabi shallallahu 'alaihi wasallam mencium (istrinya) pada bulan puasa. ",
      "arab": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ فِي شَهْرِ الصَّوْمِ"
    },
    {
      "number": 2036,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan], dari [Sa'd bin Ibrahim] dari [Thalhah bin Abdullah bin Utsman Al Qurasyi] dari [Aisyah] radliallahu 'anha, ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah menciumku sementara beliau dalam keadaan berpuasa dan aku juga berpuasa. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ يَعْنِي ابْنَ عُثْمَانَ الْقُرَشِيَّ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُنِي وَهُوَ صَائِمٌ وَأَنَا صَائِمَةٌ"
    },
    {
      "number": 2037,
      "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Al Laits], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Isa bin Hammad], telah mengabarkan kepada kami [Al Laits bin Sa'd] dari [Bukair bin Abdullah], dari [Abdul Malik bin Sa'id] dari [Jabir bin Abdullah], ia berkata; [Umar bin Al Khathab] berkata; aku merasakan senang lalu aku mencium (istriku) sementara aku dalam keadaan berpuasa. Lalu aku katakan; wahai Rasulullah, pada hari ini aku telah melakukan suatu perkara yang besar. Saya mencium (istriku) sementara saya sedang berpuasa. Beliau berkata: \"Bagaimana pendapatmu apabila engkau berkumur-kumur menggunakan air sementara engkau sedang berpuasa?\" Isa bin Hammad berkata dalam haditsnya; aku katakan; tidak mengapa. Kemudian keduanya bersepakat mengatakan; beliau berkata; tahanlah! ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا اللَّيْثُ ح و حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِهَشَشْتُ فَقَبَّلْتُ وَأَنَا صَائِمٌ فَقُلْتُ يَا رَسُولَ اللَّهِ صَنَعْتُ الْيَوْمَ أَمْرًا عَظِيمًا قَبَّلْتُ وَأَنَا صَائِمٌ قَالَ أَرَأَيْتَ لَوْ مَضْمَضْتَ مِنْ الْمَاءِ وَأَنْتَ صَائِمٌ قَالَ عِيسَى بْنُ حَمَّادٍ فِي حَدِيثِهِ قُلْتُ لَا بَأْسَ بِهِ ثُمَّ اتَّفَقَا قَالَ فَمَهْ"
    },
    {
      "number": 2038,
      "id": "Telah menceritakan kepada kami [Muhammad bin Isa], telah menceritakan kepada kami [Muhammad bin Dinar], telah menceritakan kepada kami [Sa'd bin Aus Al 'Abdi] dari [Mishda' Abu Yahya] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam menciumnya sementara beliau sedang berpuasa, dan mengisap lidahnya. Ibnu Al A'rabi berkata; sanad ini tidak shahih. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُحَمَّدُ بْنُ دِينَارٍ حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ الْعَبْدِيُّ عَنْ مِصْدَعٍ أَبِي يَحْيَى عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُقَبِّلُهَا وَهُوَ صَائِمٌ وَيَمُصُّ لِسَانَهَاقَالَ ابْنُ الْأَعْرَابِيِّ هَذَا الْإِسْنَادُ لَيْسَ بِصَحِيحٍ"
    },
    {
      "number": 2039,
      "id": "Telah menceritakan kepada kami [Nashr bin Ali], telah menceritakan kepada kami [Abu Ahmad yaitu Az Zubairi], telah mengabarkan kepada kami [Israil] dari [Abu Al 'Anbas] dari [Al Aghar] dari [Abu Hurairah] bahwa seoerang laki-laki bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai cumbuan orang yang berpuasa, lalu beliau memberikan keringanan kepadanya. Dan orang yang lain datang kepada beliau dan bertanya mengenainya, lalu beliau melarangnya. Ternyata orang yang beliau beri keringanan adalah orang yang sudah tua, sedangkan orang yang beliau larang adalah orang yang masih muda. ",
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ يَعْنِي الزُّبَيْرِيَّ أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي الْعَنْبَسِ عَنْ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُبَاشَرَةِ لِلصَّائِمِ فَرَخَّصَ لَهُ وَأَتَاهُ آخَرُ فَسَأَلَهُ فَنَهَاهُ فَإِذَا الَّذِي رَخَّصَ لَهُ شَيْخٌ وَالَّذِي نَهَاهُ شَابٌّ"
    },
    {
      "number": 2042,
      "id": "Telah menceritakan kepada kami [Musaddad] dan [Muhammad bin Isa] secara makna, mereka berkata; telah menceritakan kepada kami [Sufyan], Musaddad berkata; telah menceritakan kepada kami [Az Zuhri] dari [Humaid bin Abdurrahman] dari [Abu Hurairah], ia berkata; seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; aku telah binasa. Kemudian beliau berkata: \"Ada apa denganmu?\" Ia berkata; aku telah menggauli isteriku pada Bulan Ramadhan. Beliau berkata: \"Apakah engkau mendapatkan sesuatu untuk membebaskan budak?\" Ia berkata; tidak. Beliau berkata: \"Apakah engkau mampu untuk melakukan puasa dua bulan berturut-turut?\" Ia berkata; tidak. Beliau berkata: \"Apakah engkau mampu untuk memberi makan enam orang miskin?\" ia berkata; tidak. Beliau berkata: \"Duduklah.\" Kemudian diberikan kepada Nabi shallallahu 'alaihi wasallam satu kerangjang yang berisi kurma, kemudian beliau berkata; bersedekahlah dengan ini. Lalu orang tersebut berkata; wahai Rasulullah, tidak ada diantara dua daerah yang berbatu hitam (yaitu Madinah) keluarga yang lebih fakir daripada kami. Kemudian Rasulullah shallallahu 'alaihi wasallam tertawa hingga terlihat gigi-gigi serinya, beliau bersabda: \"Berikanlah makan mereka dengannya.\" Musaddad berkata pada tempat yang lain; gigi-gigi taring beliau. Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dengan hadits ini dengan maknanya. Az Zuhri menambahkan; dan sesungguhnya hal ini merupakan keringanan khusus untuknya, seandainya seseorang melakukan hal tersebut sekarang maka ia harus membayar kafarah. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Al Laits bin Sa'd], [Al Auza'i], [Manshur bin Al Mu'tamir] dan ['Arak bin Malik] seperti makna hadits 'Uyainah. Al Auza'i menambahkan padanya; dan memohonlah ampunan kepada Allah!",
      "arab": "حَدَّثَنَا مُسَدَّدٌ وَمُحَمَّدُ بْنُ عِيسَى الْمَعْنَى قَالَا حَدَّثَنَا سُفْيَانُ قَالَ مُسَدَّدٌ حَدَّثَنَا الزُّهْرِيُّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَأَتَى رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَلَكْتُ فَقَالَ مَا شَأْنُكَ قَالَ وَقَعْتُ عَلَى امْرَأَتِي فِي رَمَضَانَ قَالَ فَهَلْ تَجِدُ مَا تُعْتِقُ رَقَبَةً قَالَ لَا قَالَ فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ قَالَ لَا قَالَ فَهَلْ تَسْتَطِيعُ أَنْ تُطْعِمَ سِتِّينَ مِسْكِينًا قَالَ لَا قَالَ اجْلِسْ فَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ تَصَدَّقْ بِهِ فَقَالَ يَا رَسُولَ اللَّهِ مَا بَيْنَ لَابَتَيْهَا أَهْلُ بَيْتٍ أَفْقَرُ مِنَّا فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَدَتْ ثَنَايَاهُ قَالَ فَأَطْعِمْهُ إِيَّاهُمْ و قَالَ مُسَدَّدٌ فِي مَوْضِعٍ آخَرَ أَنْيَابُهُحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ بِهَذَا الْحَدِيثِ بِمَعْنَاهُ زَادَ الزُّهْرِيُّ وَإِنَّمَا كَانَ هَذَا رُخْصَةً لَهُ خَاصَّةً فَلَوْ أَنَّ رَجُلًا فَعَلَ ذَلِكَ الْيَوْمَ لَمْ يَكُنْ لَهُ بُدٌّ مِنْ التَّكْفِيرِ قَالَ أَبُو دَاوُد رَوَاهُ اللَّيْثُ بْنُ سَعْدٍ وَالْأَوْزَاعِيُّ وَمَنْصُورُ بْنُ الْمُعْتَمِرِ وَعِرَاكُ بْنُ مَالِكٍ عَلَى مَعْنَى ابْنِ عُيَيْنَةَ زَادَ فِيهِ الْأَوْزَاعِيُّ وَاسْتَغْفِرْ اللَّهَ"
    },
    {
      "number": 2043,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Humaid bin Abdurrahman] dari [Abu Hurairah] bahwa seorang laki-laki telah berbuka pada Bulan Ramadhan, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkannya agar memerdekakan budak atau berpuasa dua bulan berturut-turut atau memberi makan enam puluh orang miskin. Ia berkata; aku tidak mendapatinya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Duduklah!\" Lalu Rasulullah shallallahu 'alaihi wasallam diberi keranjang yang berisi kurma, kemudian beliau berkata; ambillah ini. Dan bersedekahlah dengannya! Kemudian orang tersebut berkata; wahai Rasulullah, tidak ada seorang pun yang lebih membutuhkan daripada diriku. Maka Rasulullah shallallahu 'alaihi wasallam tertawa hingga nampak gigi-gigi taring beliau. Dan beliau berkata kepadanya; \"Makanlah!\" Abu Daud berkata; hadits tersebut diriwayatkan oleh [Ibnu Juraij] dari [Az Zuhri] seperti lafazh Malik; bahwa seorang laki-laki telah berbuka… dan padanya ia menyebutkan: \"atau engkau membebaskan budak, atau berpuasa dua bulan berturut-turut atau memberi makan enam orang miskin.\" Telah menceritakan kepada kami [Ja'far bin Musafir], telah menceritakan kepada kami [Ibnu Abu Fudaik], telah menceritakan kepada kami [Hisyam bin Sa'd] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah], ia berkata; seorang laki-laki telah datang kepada Nabi shallallahu 'alaihi wasallam, ia telah berbuka pada Bulan Ramadhan dengan hadits ini. Ia berkata; kemudian Rasulullah shallallahu 'alaihi wasallam diberi kerangjang yang berisi kurma seukuran lima belas sha'. Dalam hadits tersebut beliau mengatakan; makanlah engkau dan penghuni rumahmu dan berpuasalah satu hari dan mintalah ampun kepada Allah. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلًا أَفْطَرَ فِي رَمَضَانَ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعْتِقَ رَقَبَةً أَوْ يَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ أَوْ يُطْعِمَ سِتِّينَ مِسْكِينًا قَالَ لَا أَجِدُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْلِسْ فَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ خُذْ هَذَا فَتَصَدَّقْ بِهِ فَقَالَ يَا رَسُولَ اللَّهِ مَا أَحَدٌ أَحْوَجُ مِنِّي فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَدَتْ أَنْيَابُهُ وَقَالَ لَهُ كُلْهُقَالَ أَبُو دَاوُد رَوَاهُ ابْنُ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَلَى لَفْظِ مَالِكٍ أَنَّ رَجُلًا أَفْطَرَ وَقَالَ فِيهِ أَوْ تُعْتِقَ رَقَبَةً أَوْ تَصُومَ شَهْرَيْنِ أَوْ تُطْعِمَ سِتِّينَ مِسْكِينًا حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ فِي رَمَضَانَ بِهَذَا الْحَدِيثِ قَالَ فَأُتِيَ بِعَرَقٍ فِيهِ تَمْرٌ قَدْرُ خَمْسَةَ عَشَرَ صَاعًا وَقَالَ فِيهِ كُلْهُ أَنْتَ وَأَهْلُ بَيْتِكَ وَصُمْ يَوْمًا وَاسْتَغْفِرْ اللَّهَ"
    },
    {
      "number": 2044,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri], telah mengabarkan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku ['Amr bin Al Harits] bahwa [Abdurrahman bin Al Qasim] telah menceritakan kepada bahwa [Muhammad bin Ja'far bin Az Zubair] telah menceritakan kepadanya bahwa ['Abbad bin Abdullah bin Az Zubair] telah menceritakan kepadanya bahwa ia mendengar [Aisyah] isteri Nabi shallallahu 'alaihi wasallam berkata; seorang laki-laki telah datang kepada Nabi shallallahu 'alaihi wasallam di Masjid pada Bulan Ramadhan, kemudian berkata; wahai Rasulullah, aku telah melakukan dosa yang akan mengakibatkan terbakar di neraka. Kemudian Nabi shallallahu 'alaihi wasallam bertanya kepadanya; kenapa engkau? Ia berkata; aku telah mencampuri isteriku. Beliau berkata: \"Bersedekahlah!\" Ia berkata; demi Allah, aku tidak memiliki sesuatu, dan tidak mampu melakukannya. Beliau berkata: \"Duduklah!\" Kemudian orang tersebut duduk, tatkala ia dalam keadaan seperti itu terdapat seorang laki-laki yang menuntun onta yang membawa makanan. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata; \"Dimanakah orang yang telah melakukan dosa tadi?\" kemudian terdapat seorang laki-laki yang berdiri, lalu Rasulullah shallallahu 'alaihi wasallam berkata: \"Bersedekahlah dengan ini!\" Apakah aku harus bersedekah kepada selainku? Demi Allah kami adalah orang-orang yang lapar, kami tidak memiliki sesuatu. Beliau berkata: \"Makanlah!\" Telah menceritakan kepada kami [Muhammad bin 'Auf], telah menceritakan kepada kami [Sa'id bin Abu Maryam], telah menceritakan kepada kami [Ibnu Abu Az Zinad], dari [Abdurrahman bin Al Harits] dari [Muhammad bin Ja'far bin Az Zubair] dari ['Abbad bin Abdullah], dari [Aisyah] dengan kisah ini. Ia berkata; kemudian beliau diberi sebuah keranjang yang berisi dua puluh sha' kurma. ",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ حَدَّثَهُ أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ حَدَّثَهُ أَنَّ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ حَدَّثَهُ أَنَّهُ سَمِعَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُأَتَى رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فِي رَمَضَانَ فَقَالَ يَا رَسُولَ اللَّهِ احْتَرَقْتُ فَسَأَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا شَأْنُهُ قَالَ أَصَبْتُ أَهْلِي قَالَ تَصَدَّقْ قَالَ وَاللَّهِ مَا لِي شَيْءٌ وَلَا أَقْدِرُ عَلَيْهِ قَالَ اجْلِسْ فَجَلَسَ فَبَيْنَمَا هُوَ عَلَى ذَلِكَ أَقْبَلَ رَجُلٌ يَسُوقُ حِمَارًا عَلَيْهِ طَعَامٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ الْمُحْتَرِقُ آنِفًا فَقَامَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَصَدَّقْ بِهَذَا فَقَالَ يَا رَسُولَ اللَّهِ أَعَلَى غَيْرِنَا فَوَاللَّهِ إِنَّا لَجِيَاعٌ مَا لَنَا شَيْءٌ قَالَ كُلُوهُحَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ عَنْ عَائِشَةَ بِهَذِهِ الْقِصَّةِ قَالَ فَأُتِيَ بِعَرَقٍ فِيهِ عِشْرُونَ صَاعًا"
    },
    {
      "number": 2045,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], ia berkata; telah menceritakan kepada kami [Syu'bah], dan telah diriwayatkan dengan jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Katsir], ia berkata; telah mengabarkan kepada kami [Syu'bah] dari [Habib bin Abu Tsabit] dari ['Umarah bin 'Umair] dari [Ibnu Muthawwis] dari [ayahnya], [Ibnu Katsir] berkata; dari [Abu Al Muthawwis] dari [ayahnya], dari [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berbuka satu hari pada Bulan Ramadhan bukan karena sebuah rukhshah (keringanan) yang telah Allah berikan kepadanya, maka puasa satu tahun tidaklah mampu menggantikannya.\" Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan], telah menceritakan kepadaku [Habib] dari ['Umarah] dari [Ibnu Al Muthawwis], ia berkata; kemudian aku bertemu dengan [Ibnu Al Muthawwis] dan ia menceritakan kepadaku dari [ayahnya], dari [Abu Hurairah], ia berkata; Nabi shallallahu 'alaihi wasallam bersabda:... Seperti hadits Ibnu Katsir dan Sulaiman. Abu Daud berkata; dan telah diperselisihkan riwayat dari Sufyan dan Syu'bah: Ibnu Al Muthawwis serta Abu Al Muthawwis.",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ أَخْبَرَنَا شُعْبَةُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ ابْنِ مُطَوِّسٍ عَنْ أَبِيهِ قَالَ ابْنُ كَثِيرٍ عَنْ أَبِي الْمُطَوِّسِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ فِي غَيْرِ رُخْصَةٍ رَخَّصَهَا اللَّهُ لَهُ لَمْ يَقْضِ عَنْهُ صِيَامُ الدَّهْرِحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ حَدَّثَنِي حَبِيبٌ عَنْ عُمَارَةَ عَنْ ابْنِ الْمُطَوِّسِ قَالَ فَلَقِيتُ ابْنَ الْمُطَوِّسِ فَحَدَّثَنِي عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ حَدِيثِ ابْنِ كَثِيرٍ وَسُلَيْمَانَ قَالَ أَبُو دَاوُد وَاخْتُلِفَ عَلَى سُفْيَانَ وَشُعْبَةَ عَنْهُمَا ابْنُ الْمُطَوِّسِ وَأَبُو الْمُطَوِّسِ"
    },
    {
      "number": 2046,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Ayyub] dan [Habib] serta [Hisyam], dari [Muhammad bin Sirin] dari [Abu Hurairah], ia berkata; seseorang telah datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, sesungguhnya aku telah makan dan minum karena lupa sementara aku sedang berpuasa. Kemudian beliau berkata: \"Allah telah memberimu makan dan minum.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ وَحَبِيبٍ وَهِشَامٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَكَلْتُ وَشَرِبْتُ نَاسِيًا وَأَنَا صَائِمٌ فَقَالَ اللَّهُ أَطْعَمَكَ وَسَقَاكَ"
    },
    {
      "number": 2047,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Yahya bin Sa'id] dari [Abu Salamah bin Abdurrahman] bahwa ia telah mendengar [Aisyah] radliallahu 'anha berkata; sesungguhnya aku berkewajiban melakukan puasa Ramadhan dan aku tidak mampu melakukannya hingga datang Bulan Sya'ban. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا تَقُولُإِنْ كَانَ لَيَكُونُ عَلَيَّ الصَّوْمُ مِنْ رَمَضَانَ فَمَا أَسْتَطِيعُ أَنْ أَقْضِيَهُ حَتَّى يَأْتِيَ شَعْبَانُ"
    },
    {
      "number": 2048,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku ['Amr bin Al Harits] dari ['Ubaidullah bin Abu Ja'far] dari [Muhammad bin Ja'far bin Az Zubair] dari ['Urwah] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Barangsiapa yang meninggal dalam keadaan berkewajiban melakukan puasa, maka walinya berpuasa untuknya.\" Abu Daud berkata; hal ini mengenai puasa nadzar, dan hal tersebut adalah pendapat Ahmad bin Hanbal. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ قَالَ أَبُو دَاوُد هَذَا فِي النَّذْرِ وَهُوَ قَوْلُ أَحْمَدَ بْنِ حَنْبَلٍ"
    },
    {
      "number": 2049,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari [Abu Hushain] dari [Sa'id bin Jubair] dari [Ibnu Abbas], ia berkata; apabila seseorang sakit pada Bulan Ramadhan kemudian meninggal dan belum melakukan puasa maka diberikan makan untuknya dan ia tidak berkewajiban untuk mengqadha`, dan apabila ia memiliki kewajiban nadzar maka walinya yang mengqadha` untuknya. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي حُصَيْنٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ إِذَا مَرِضَ الرَّجُلُ فِي رَمَضَانَ ثُمَّ مَاتَ وَلَمْ يَصُمْ أُطْعِمَ عَنْهُ وَلَمْ يَكُنْ عَلَيْهِ قَضَاءٌ وَإِنْ كَانَ عَلَيْهِ نَذْرٌ قَضَى عَنْهُ وَلِيُّهُ"
    },
    {
      "number": 2050,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], serta [Musaddad], mereka berkata; telah menceritakan kepada kami [Hammad], dari [Hisyam bin 'Urwah] dari [ayahnya], dari [Aisyah] bahwa Hamzah Al Aslami telah bertanya kepada Nabi shallallahu 'alaihi wasallam, ia berkata; wahia Rasulullah, saya adalah seorang laki-laki yang melakukan puasa secara berturut-turut, apakah saya boleh berpuasa ketika sedang bersafar? Beliau berkata: \"Berpuasalah jika engkau menghendaki dan berbukalah jika engkau menghendaki!\"",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ حَمْزَةَ الْأَسْلَمِيَّ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَسْرُدُ الصَّوْمَ أَفَأَصُومُ فِي السَّفَرِ قَالَ صُمْ إِنْ شِئْتَ وَأَفْطِرْ إِنْ شِئْتَ"
    },
    {
      "number": 2051,
      "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Muhammad bin Abdul Majid Al Madani], ia berkata; saya mendengar [Hamzah bin Muhammad bin Hamzah Al Aslami] menyebutkan bahwa [ayahnya] telah mengabarkan kepadanya dari [kakeknya], ia berkata; aku katakan; wahai Rasulullah, aku adalah orang memiliki hewan kendaraan, aku menggunakannya, bersafar dengan mengendarainya serta menyewakannya. Terkadang aku menemui Bulan Ramadhan ini, aku kuat dan masih muda, serta saya dapati bahwa berpuasa lebih ringan bagiku daripada menundanya sehingga menjadi hutang wahai Rasulullah. Maka apakah dengan berpuasa pahalaku lebih besar atau aku berbuka wahai Rasulullah? Beliau berkata: \"Apapun yang engkau kehendaki, wahai Hamzah.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَجِيدِ الْمَدَنِيُّ قَالَ سَمِعْتُ حَمْزَةَ بْنَ مُحَمَّدِ بْنِ حَمْزَةَ الْأَسْلَمِيَّ يَذْكُرُ أَنَّ أَبَاهُ أَخْبَرَهُ عَنْ جَدِّهِ قَالَ قُلْتُيَا رَسُولَ اللَّهِ إِنِّي صَاحِبُ ظَهْرٍ أُعَالِجُهُ أُسَافِرُ عَلَيْهِ وَأَكْرِيهِ وَإِنَّهُ رُبَّمَا صَادَفَنِي هَذَا الشَّهْرُ يَعْنِي رَمَضَانَ وَأَنَا أَجِدُ الْقُوَّةَ وَأَنَا شَابٌّ وَأَجِدُ بِأَنْ أَصُومَ يَا رَسُولَ اللَّهِ أَهْوَنَ عَلَيَّ مِنْ أَنْ أُؤَخِّرَهُ فَيَكُونُ دَيْنًا أَفَأَصُومُ يَا رَسُولَ اللَّهِ أَعْظَمُ لِأَجْرِي أَوْ أُفْطِرُ قَالَ أَيُّ ذَلِكَ شِئْتَ يَا حَمْزَةُ"
    },
    {
      "number": 2052,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu 'Uwanah], dari [Manshur], dari [Mujahid] dari [Thawus] dari [Ibnu Abbas], ia berkata; Nabi shallallahu 'alaihi wasallam keluar dari Madinah menuju ke Mekkah hinggga sampai ke 'Usfan, kemudian beliau meminta bejana dan mengangkatnya ke mulut beliau agar orang-orang melihatnya. Dan hal tersebut terjadi pada Bulan Ramadhan. Ibnu Abbas berkata; Nabi shallallahu 'alaihi wasallam telah berpuasa dan berbuka, barangsiapa yang berkehendak maka ia berpuasa dan barangsiapa yang berkehendak maka ia berbuka. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِإِنَاءٍ فَرَفَعَهُ إِلَى فِيهِ لِيُرِيَهُ النَّاسَ وَذَلِكَ فِي رَمَضَانَ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ قَدْ صَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَفْطَرَ فَمَنْ شَاءَ صَامَ وَمَنْ شَاءَ أَفْطَرَ"
    },
    {
      "number": 2053,
      "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Zaidah] dari [Humaid Ath Thawil], dari [Anas], ia berkata; kami pernah bersafar bersama Rasulullah shallallahu 'alaihi wasallam pada Bulan Ramadhan, lalu sebagian kami ada yang berpuasa dan sebagian dari kami ada yang berbuka, dan orang yang berpuasa tidak mencela orang yang berbuka dan orang yang berbuka tidak mencela orang yang berpuasa. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زَائِدَةُ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسٍ قَالَسَافَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ فَصَامَ بَعْضُنَا وَأَفْطَرَ بَعْضُنَا فَلَمْ يَعِبْ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا الْمُفْطِرُ عَلَى الصَّائِمِ"
    },
    {
      "number": 2054,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], dan [Wahb bin Bayan] secara makna, mereka berkata; telah menceritakan kepada kami [Ibnu Wahb], telah menceritakan kepadaku [Mu'awiyah] dari [Rabi'ah bin Yazid] bahwa ia telah menceritakan kepadanya dari [Qaza'ah], ia berkata; aku datang kepada [Abu Sa'id Al Khudri] dan beliau sedang berfatwa kepada manusia sementara mereka berkumpul di hadapannya, maka aku menunggu kesendiriannya. Kemudian tatkala ia telah sendirian aku bertanya kepadanya mengenai puasa Ramadhan dalam perjalanan. Lalu ia berkata; kami pernah keluar bersama Nabi shallallahu 'alaihi wasallam pada Bulan Ramadhan pada tahun penaklukan Mekkah, dan Rasulullah shallallahu 'alaihi wasallam berpuasa dan kami pun berpuasa hingga beliau sampai sebuah tempat diantara tempat-tempat persinggahan. Kemudian beliau berkata; sesungguhnya kalian telah mendekati musuh dan berbuka adalah lebih kuat untuk kalian. Maka pada paginya diantara kami ada yang berpuasa dan diantara kami ada yang berbuka, peperangan tersebut merupakan tekad Rasulullah shallallahu wa'alaihi wa sallam. Abu Sa'id berkata; aku lihat diriku melakukan puasa bersama Nabi shallallahu 'alaihi wasallam sebelum itu dan setelah itu. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَوَهْبُ بْنُ بَيَانٍ الْمَعْنَى قَالَا حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي مُعَاوِيَةُ عَنْ رَبِيعَةَ بْنِ يَزِيدَ أَنَّهُ حَدَّثَهُ عَنْ قَزَعَةَ قَالَأَتَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ وَهُوَ يُفْتِي النَّاسَ وَهُمْ مُكِبُّونَ عَلَيْهِ فَانْتَظَرْتُ خَلْوَتَهُ فَلَمَّا خَلَا سَأَلْتُهُ عَنْ صِيَامِ رَمَضَانَ فِي السَّفَرِ فَقَالَ خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ عَامَ الْفَتْحِ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ وَنَصُومُ حَتَّى بَلَغَ مَنْزِلًا مِنْ الْمَنَازِلِ فَقَالَ إِنَّكُمْ قَدْ دَنَوْتُمْ مِنْ عَدُوِّكُمْ وَالْفِطْرُ أَقْوَى لَكُمْ فَأَصْبَحْنَا مِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ قَالَ ثُمَّ سِرْنَا فَنَزَلْنَا مَنْزِلًا فَقَالَ إِنَّكُمْ تُصَبِّحُونَ عَدُوَّكُمْ وَالْفِطْرُ أَقْوَى لَكُمْ فَأَفْطِرُوا فَكَانَتْ عَزِيمَةً مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو سَعِيدٍ ثُمَّ لَقَدْ رَأَيْتُنِي أَصُومُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ ذَلِكَ وَبَعْدَ ذَلِكَ"
    },
    {
      "number": 2055,
      "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi], telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Abdurrahman bin Sa'd bin Zurarah] dari [Muhammad bin 'Amr bin Hasan] dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah melihat seorang laki-laki yang dinaungi dan orang-orang mengerumuninya, lalu beliau berkata: \"Bukanlah termasuk kebaikan berpuasa dalam perjalanan.\"",
      "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ سَعْدِ بْنِ زُرَارَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَسَنٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُظَلَّلُ عَلَيْهِ وَالزِّحَامُ عَلَيْهِ فَقَالَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ"
    },
    {
      "number": 2057,
      "id": "Telah menceritakan kepada kami [Muammal bin Al Fadhl], telah menceritakan kepada kami [Al Walid], telah menceritakan kepada kami [Sa'id bin Abdul Aziz], telah menceritakan kepadaku [Isma'il bin 'Ubaidullah], telah menceritakan kepadaku [Ummu Ad Darda`] dari [Abu Darda`], ia berkata; kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam sebagian peperangan pada hari yang sangat panas hingga salah seorang diantara kami meletakkan tangannya atau telapak tangannya di atas kepalanya karena sangat panas. Tidak ada diantara kami yang berpuasa selain Rasulullah shallallahu 'alaihi wasallam, dan Abdullah bin Rawahah. ",
      "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ حَدَّثَنِي إِسْمَعِيلُ بْنُ عُبَيْدِ اللَّهِ حَدَّثَتْنِي أُمُّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ غَزَوَاتِهِ فِي حَرٍّ شَدِيدٍ حَتَّى إِنَّ أَحَدَنَا لَيَضَعُ يَدَهُ عَلَى رَأْسِهِ أَوْ كَفَّهُ عَلَى رَأْسِهِ مِنْ شِدَّةِ الْحَرِّ مَا فِينَا صَائِمٌ إِلَّا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَبْدُ اللَّهِ بْنُ رَوَاحَةَ"
    },
    {
      "number": 2058,
      "id": "Telah menceritakan kepada kami [Hamid bin Yahya], telah menceritakan kepada kami [Hasyim bin Al Qasim], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami ['Uqbah bin Mukram], telah menceritakan kepada kami [Abu Qutaibah] secara makna, mereka berdua berkata; telah menceritakan kepada kami [Abdushshamad bin Habib bin Abdullah Al Azdi], telah menceritakan kepadaku [Habib bin Abdullah], ia berkata; saya mendengar [Sinan bin Salamah bin Al Muhabbaq Al Hudzali], menceritakan dari [ayahnya], ia berkata; Rasulullah shallallahu wa'alaihi wa sallam bersabda: \"Barangsiapa yang memiliki bekal dan mampu singgah dalam keadaan kenyang, maka hendaknya ia berpuasa Ramadhan dimana pun ia mendapatinya.\" Telah menceritakan kepada kami [Nashr bin Al Muhajir], telah menceritakan kepada kami [Abdushshamad bin Abdul Warits], telah menceritakan kepada kami [Abdushshamad bin Habib], ia berkata; telah menceritakan kepadaku [ayahku], dari [Sinan bin Salamah] dari [Salamah bin Al Muhabbaq], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mendapati Bulan Ramadhan ketika dalam perjalanan….\" Kemudian ia menyebutkan hadits tersebut secara makna. ",
      "arab": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ ح و حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ حَدَّثَنَا أَبُو قُتَيْبَةَ الْمَعْنَى قَالَا حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبِ بْنِ عَبْدِ اللَّهِ الْأَزْدِيُّ حَدَّثَنِي حَبِيبُ بْنُ عَبْدِ اللَّهِ قَالَ سَمِعْتُ سِنَانَ بْنَ سَلَمَةَ بْنِ الْمُحَبَّقِ الْهُذَلِيِّ يُحَدِّثُ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ حَمُولَةٌ تَأْوِي إِلَى شِبَعٍ فَلْيَصُمْ رَمَضَانَ حَيْثُ أَدْرَكَهُ حَدَّثَنَا نَصْرُ بْنُ الْمُهَاجِرِ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبٍ قَالَ حَدَّثَنِي أَبِي عَنْ سِنَانِ بْنِ سَلَمَةَ عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَهُ رَمَضَانُ فِي السَّفَرِ فَذَكَرَ مَعْنَاهُ"
    },
    {
      "number": 2059,
      "id": "Telah menceritakan kepada kami ['Ubaidullah bin Umar], telah menceritakan kepadaku [Abdullah bin Yazid], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ja'far bin Musafir], telah menceritakan kepada kami [Abdullah bin Yahya] secara makna, telah menceritakan kepadaku [Sa'id bin Abu Ayyub] -dan [Ja'far] serta [Al Laits] menambahkan; telah menceritakan kepadaku [Yazid bin Abu Habib] - bahwa [Kulaib bin Dzuhail Al Hadhrami], telah mengabarkan kepadanya dari ['Ubaid], ia berkata; Ja'far bin Jabr berkata; aku pernah bersama [Abu Bashrah Al Ghifari] seorang sahabat Nabi shallallahu 'alaihi wasallam dalam sebuah kapal dari Al Fusthath pada Bulan Ramadhan, kemudian dihidangkan makan siangnya. Ja'far dalam haditsnya mengatakan; ia belum melewati rumah-rumah hingga ia meminta sufrah (makanan musafir). Ia berkata; mendekatlah. Aku katakan; bukankah engkau melihat rumah-rumah tersebut? Abu Bashrah mengatakan; apakah engkau membenci sunah Rasulullah shallallahu 'alaihi wasallam? Ja'far dalam haditsnya berkata; kemudian ia memakannya. ",
      "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ ح و حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى الْمَعْنَى حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ وَزَادَ جَعْفَرٌ وَاللَّيْثُ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ أَنَّ كُلَيْبَ بْنَ ذُهْلٍ الْحَضْرَمِيَّ أَخْبَرَهُ عَنْ عُبَيْدٍ قَالَ جَعْفَرٌ ابْنُ جَبْرٍ قَالَ كُنْتُ مَعَ أَبِي بَصْرَةَ الْغِفَارِيِّ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفِينَةٍ مِنْ الْفُسْطَاطِ فِي رَمَضَانَ فَرُفِعَ ثُمَّ قُرِّبَ غَدَاهُ قَالَ جَعْفَرٌ فِي حَدِيثِهِ فَلَمْ يُجَاوِزْ الْبُيُوتَ حَتَّى دَعَا بِالسُّفْرَةِ قَالَ اقْتَرِبْ قُلْتُ أَلَسْتَ تَرَى الْبُيُوتَ قَالَ أَبُو بَصْرَةَ أَتَرْغَبُ عَنْ سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَعْفَرٌ فِي حَدِيثِهِ فَأَكَلَ"
    },
    {
      "number": 2060,
      "id": "Telah menceritakan kepada kami [Isa bin Hammad], telah mengabarkan kepada kami [Al Laits bin Sa'd] dari [Yazid bin Abu Habib] dari [Abu Al Khair], dari [Manshur Al Kalbi] bahwa [Dahyah bin Khalifah] suatu kali keluar dari sebuah desa dari Damaskus menuju tempat yang berjarak seukuran menuju desa 'Uqbah di Al Fusthath, dan hal tersebut jaraknya adalah tiga mil, pada Bulan Ramadhan. Kemudian ia berbuka dan orang-orang pun berbuka berasamanya. Sementara yang lainnya tidak senang untuk berbuka. Kemudian tatkala telah kembali ke desanya ia berkata; demi Allah sungguh aku pada hari ini telah melihat suatu perkara yagn tidak aku sangka, aku melihat beberapa orang telah membenci petunjuk Rasulullah shallallahu 'alaihi wasallam dan para sahabatnya. Ia mengatakan hal tersebut kepada orang-orang yang berpuasa, kemudian pada saat itu ia berkata; ya Allah, matikan aku menuju kepadaMu! ",
      "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ أَخْبَرَنَا اللَّيْثُ يَعْنِي ابْنَ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ مَنْصُورٍ الْكَلْبِيِّ أَنَّ دِحْيَةَ بْنَ خَلِيفَةَ خَرَجَ مِنْ قَرْيَةٍ مِنْ دِمَشْقَ مَرَّةً إِلَى قَدْرِ قَرْيَةِ عُقْبَةَ مِنْ الْفُسْطَاطِ وَذَلِكَ ثَلَاثَةُ أَمْيَالٍ فِي رَمَضَانَ ثُمَّ إِنَّهُ أَفْطَرَ وَأَفْطَرَ مَعَهُ نَاسٌ وَكَرِهَ آخَرُونَ أَنْ يُفْطِرُوا فَلَمَّا رَجَعَ إِلَى قَرْيَتِهِ قَالَ وَاللَّهِ لَقَدْ رَأَيْتُ الْيَوْمَ أَمْرًا مَا كُنْتُ أَظُنُّ أَنِّي أَرَاهُ إِنَّ قَوْمًا رَغِبُوا عَنْ هَدْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابِهِ يَقُولُ ذَلِكَ لِلَّذِينَ صَامُوا ثُمَّ قَالَ عِنْدَ ذَلِكَ اللَّهُمَّ اقْبِضْنِي إِلَيْكَ"
    },
    {
      "number": 2061,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Al Mu'tamir] dari ['Ubaidullah] dari [Nafi'] bahwa [Ibnu Umar] pernah keluar menuju sebuah hutan dan tidak berbuka dan tidak mengqashar. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْمُعْتَمِرُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ يَخْرُجُ إِلَى الْغَابَةِ فَلَا يُفْطِرُ وَلَا يَقْصِرُ"
    },
    {
      "number": 2065,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Yazid bin Al Had], dari [Abu Murrah] mantan budak Ummu Hani` bahwa ia ia bersama Abdullah bin 'Amr menemui ayahnya yaitu ['Amr bin Al 'Ash], kemudian ia mendekatkan makanan kepada keduanya lalu berkata; makanlah. Lalu Abu Murrah berkata; sesungguhnya saya sedang berpuasa. Kemudian 'Amr berkata; makanlah, ini adalah hari yang kami diperintahkan Rasulullah shallallahu 'alaihi wasallam agar berbuka dan melarang kami untuk melakukan puasa padanya. Malik berkata; hari-hari tersebut adalah hari-hari Tasyriq. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ الْهَادِ عَنْ أَبِي مُرَّةَ مَوْلَى أُمِّ هَانِئٍأَنَّهُ دَخَلَ مَعَ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَلَى أَبِيهِ عَمْرِو بْنِ الْعَاصِ فَقَرَّبَ إِلَيْهِمَا طَعَامًا فَقَالَ كُلْ فَقَالَ إِنِّي صَائِمٌ فَقَالَ عَمْرٌو كُلْ فَهَذِهِ الْأَيَّامُ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا بِإِفْطَارِهَا وَيَنْهَانَا عَنْ صِيَامِهَاقَالَ مَالِكٌ وَهِيَ أَيَّامُ التَّشْرِيقِ"
    },
    {
      "number": 2067,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu wa'alaihi wa sallam bersabda: \"Janganlah salah seorang diantara kalian berpuasa pada Hari Jum'at, kecuali ia berpuasa sebelumnya atau setelahnya.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَصُمْ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ إِلَّا أَنْ يَصُومَ قَبْلَهُ بِيَوْمٍ أَوْ بَعْدَهُ"
    },
    {
      "number": 2068,
      "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah], telah menceritakan kepada kami [Sufyan bin Habib], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Yazid bin Qubais] dari penduduk Jabalah, telah menceritakan kepada kami [Al Walid], seluruhnya dari [Tsaur bin Yazid] dari [Khalid bin Ma'dan] dari [Abdullah bin Busr As Sulami], dari [saudarinya], Yazid berkata; Shama`, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian berpuasa pada hari Sabtu kecuali yang diwajibkan atas kalian, dan apabila salah seorang diantara kalian tidak mendapatkan sesuatu kecuali kulit pohon anggur atau ranting pohon maka hendaknya ia mengunyahnya.\" Abu Daud berkata; hadits ini adalah hadits yang telah di naskh (yang hukumnya telah diganti dengan ayat atau hadits yang lain). ",
      "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ ح و حَدَّثَنَا يَزِيدُ بْنُ قُبَيْسٍ مِنْ أَهْلِ جَبَلَةَ حَدَّثَنَا الْوَلِيدُ جَمِيعًا عَنْ ثَوْرِ بْنِ يَزِيدَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ السُّلَمِيِّ عَنْ أُخْتِهِ وَقَالَ يَزِيدُ الصَّمَّاءِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصُومُوا يَوْمَ السَّبْتِ إِلَّا فِي مَا افْتُرِضَ عَلَيْكُمْ وَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا لِحَاءَ عِنَبَةٍ أَوْ عُودَ شَجَرَةٍ فَلْيَمْضَغْهُ قَالَ أَبُو دَاوُد وَهَذَا حَدِيثٌ مَنْسُوخٌ"
    },
    {
      "number": 2069,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah menceritakan kepada kami [Hammam], dari [Qatadah], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Hafsh bin Umar], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah], dari [Abu Ayyub], Hafsh Al 'Ataki dari [Juwairiyah binti Al Harits], bahwa Nabi shallallahu 'alaihi wasallam menemuinya pada Hari Jum'at dalam keadaan sedang berpuasa, kemudian beliau berkata; apakah engkau berpuasa kemarin? Ia berkata; tidak. Beliau berkata: \"Apakah engkau ingin berpuasa besok?\" Ia berkata; tidak. Beliau berkata; \"Berbukalah!\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ ح و حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي أَيُّوبَ قَالَ حَفْصٌ الْعَتَكِيُّ عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا يَوْمَ الْجُمُعَةِ وَهِيَ صَائِمَةٌ فَقَالَ أَصُمْتِ أَمْسِ قَالَتْ لَا قَالَ تُرِيدِينَ أَنْ تَصُومِي غَدًا قَالَتْ لَا قَالَ فَأَفْطِرِي"
    },
    {
      "number": 2070,
      "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib], telah menceritakan kepada kami [Ibnu Wahb], ia berkata; saya mendengar [Al Laits] menceritakan dari [Ibnu Syihab] bahwa ia apabila menyebutkan kepadanya bahwa beliau melarang dari berpuasa pada Hari Sabtu Ibnu Syihab berkata; ini adalah hadits orang Himshi. Telah menceritakan kepada kami [Muhammad bin Ash Shabah bin Sufyan], telah menceritakan kepada kami [Al Walid] dari [Al Auza'i], ia berkata; aku masih menyembunyikannya hingga aku melihatnya telah menyebar. Yang ia maksud adalah hadits Abdullah bin Busr ini yang berbicara mengenai puasa pada Hari Sabtu. Abu Daud berkata; Malik berkata; ini adalah dusta. ",
      "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ اللَّيْثَ يُحَدِّثُ عَنْ ابْنِ شِهَابٍأَنَّهُ كَانَ إِذَا ذَكَرَ لَهُ أَنَّهُ نَهَى عَنْ صِيَامِ يَوْمِ السَّبْتِ يَقُولُ ابْنُ شِهَابٍ هَذَا حَدِيثٌ حِمْصِيٌّحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ قَالَ مَا زِلْتُ لَهُ كَاتِمًا حَتَّى رَأَيْتُهُ انْتَشَرَ يَعْنِي حَدِيثَ عَبْدِ اللَّهِ بْنِ بُسْرٍ هَذَا فِي صَوْمِ يَوْمِ السَّبْتِ قَالَ أَبُو دَاوُد قَالَ مَالِكٌ هَذَا كَذِبٌ"
    },
    {
      "number": 2071,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], dan [Musaddad] mereka berdua berkata; telah menceritakan kepada kami [Hammad bin Zaid], dari [Ghailan bin Jarir], dari [Abdullah bin Ma'bad Az Zimmani] dari [Abu Qatadah], bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, bagaimana anda berpuasa? Kemudian Rasulullah shallallahu 'alaihi wasallam marah karena ucapannya tersebut. Kemudian tatkala Umar melihat hal tersebut ia berkata; kami ridha kepada Allah sebagai Tuhan, dan Islam sebagai agama, serta Muhammad sebagai nabi. Kami berlindung kepada Allah dari kemurkaanNya dan kemarahan rasulNya. Umar terus mengulangi ucapan tersebut hingga berhenti kemarahan Rasulullah shallallahu wa'alaihi wa sallam. Kemudian ia berkata; wahai Rasulullah, bagaimana dengan orang yang berpuasa setahun penuh? Beliau berkata; ia tidak berpuasa dan tidak berbuka. Musaddad berkata; Musaddad berkata; maka ia belum berpuasa dan belum berbuka, atau tidak berpuasa dan tidak berbuka. Ghailan merasa ragu. Umar berkata; wahai Rasulullah, bagaimana dengan orang yang berpuasa dua hari dan berbuka satu hari? Beliau berkata: \"Apakah ada orang yang mampu melakukan hal tersebut?\" Ia berkata; wahai Rasulullah, bagaimana dengan orang yang berpuasa satu hari dan berbuka satu hari? Beliau berkata: \"Itu adalah puasa Daud.\" Ia berkata; wahai Rasulullah, bagaimana dengan orang yang berpuasa satu hari dan berbuka dua hari? Beliau berkata: \"Aku ingin diberikan kemampuan melakukan hal tersebut.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Puasa tiga hari setiap hari setiap bulan, dan Ramadhan hingga Ramadhan yang lain ini adalah puasa setahun penuh. Dan puasa Hari 'Arafah aku berharap kepada Allah agar menggugurkan dosa satu tahun yang sebelumnya, serta satu tahun setelahnya, dan puasa Hari 'Asyura` aku berharap kepada Allah agar menghapuskan dosa sebelumnya.\" Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Mahdi] telah menceritakan kepada kami [Ghailan] dari [Abdullah bin Ma'bad Az Zimmani] dari [Abu Qatadah] dengan hadits ini. Ia menambahkan; Umar berkata; wahai Rasulullah, bagaimana pendapat anda mengenai puasa hari Senin dan hari Kamis? Beliau berkata; padanya aku dilahirkan dan padanya Al Qur'an di turunkan kepadaku. ",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ غَيْلَانَ بْنِ جَرِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ عَنْ أَبِي قَتَادَةَأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ تَصُومُ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قَوْلِهِ فَلَمَّا رَأَى ذَلِكَ عُمَرُ قَالَ رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا نَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَمِنْ غَضَبِ رَسُولِهِ فَلَمْ يَزَلْ عُمَرُ يُرَدِّدُهَا حَتَّى سَكَنَ غَضَبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ الدَّهْرَ كُلَّهُ قَالَ لَا صَامَ وَلَا أَفْطَرَ قَالَ مُسَدَّدٌ لَمْ يَصُمْ وَلَمْ يُفْطِرْ أَوْ مَا صَامَ وَلَا أَفْطَرَ شَكَّ غَيْلَانُ قَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ يَوْمَيْنِ وَيُفْطِرُ يَوْمًا قَالَ أَوَ يُطِيقُ ذَلِكَ أَحَدٌ قَالَ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا قَالَ ذَلِكَ صَوْمُ دَاوُدَ قَالَ يَا رَسُولَ اللَّهِ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمَيْنِ قَالَ وَدِدْتُ أَنِّي طُوِّقْتُ ذَلِكَ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثٌ مِنْ كُلِّ شَهْرٍ وَرَمَضَانُ إِلَى رَمَضَانَ فَهَذَا صِيَامُ الدَّهْرِ كُلِّهِ وَصِيَامُ عَرَفَةَ إِنِّي أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ وَالسَّنَةَ الَّتِي بَعْدَهُ وَصَوْمُ يَوْمِ عَاشُورَاءَ إِنِّي أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُحَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا مَهْدِيٌّ حَدَّثَنَا غَيْلَانُ عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ عَنْ أَبِي قَتَادَةَ بِهَذَا الْحَدِيثِ زَادَ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ صَوْمَ يَوْمِ الِاثْنَيْنِ وَيَوْمِ الْخَمِيسِ قَالَ فِيهِ وُلِدْتُ وَفِيهِ أُنْزِلَ عَلَيَّ الْقُرْآنُ"
    },
    {
      "number": 2073,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], Telah menceritakan kepada kami [Hammad] dari [Sa'id Al Jurairi], dari [Abu As Salil] dari [Mujibah Al Bahili], dari [ayahnya] atau pamannya bahwa ia datang kepada Rasulullah shallallahu 'alaihi wasallam kemudian pergi, kemudian ia datang kepada beliau setelah satu tahun, dan keadaan serta penampilannya telah berubah. Kemudian ia berkata; wahai Rasulullah, apakah engkau mengenalku? Beliau berkata: \"Siapa kamu?\" Ia berkata; saya adalah Al Bahili yang telah datang kepada engkau pada tahun pertama. Beliau berkata: \"Apakah yang telah mengubahmu? Dahulu penampilanmu baik.\" Ia berkata; saya tidak makan kecuali pada malam hari semenjak saya berpisah dengan engkau. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kenapa engkau menyiksa dirimu?\" kemudian beliau berkata: \"Berpuasalah pada bulan yang penuh kesabaran (Bulan Ramadhan), dan satu hari setiap bulan.\" Ia berkata; tambahkan untukku, karena sesungguhnya saya kuat. Beliau berkata: \"Berpuasalah dua hari!\" Ia berkata; tambahkan untukku! Beliau berkata: \"Berpuasalah tiga hari!\" Ia berkata; tambahkan untukku! Beliau berkata: \"Berpuasalah sebagian dari bulan hurum (Rajab, Dzul Qa'dah, Dzul Hijjah dan Al Muharram).\" Beliau mengatakannya dengan memberi isyarat menggunakan ketiga jari-jarinya, beliau menggenggamnya kemudian membukanya. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي السَّلِيلِ عَنْ مُجِيبَةَ الْبَاهِلِيَّةِ عَنْ أَبِيهَا أَوْ عَمِّهَاأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ انْطَلَقَ فَأَتَاهُ بَعْدَ سَنَةٍ وَقَدْ تَغَيَّرَتْ حَالُهُ وَهَيْئَتُهُ فَقَالَ يَا رَسُولَ اللَّهِ أَمَا تَعْرِفُنِي قَالَ وَمَنْ أَنْتَ قَالَ أَنَا الْبَاهِلِيُّ الَّذِي جِئْتُكَ عَامَ الْأَوَّلِ قَالَ فَمَا غَيَّرَكَ وَقَدْ كُنْتَ حَسَنَ الْهَيْئَةِ قَالَ مَا أَكَلْتُ طَعَامًا إِلَّا بِلَيْلٍ مُنْذُ فَارَقْتُكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمَ عَذَّبْتَ نَفْسَكَ ثُمَّ قَالَ صُمْ شَهْرَ الصَّبْرِ وَيَوْمًا مِنْ كُلِّ شَهْرٍ قَالَ زِدْنِي فَإِنَّ بِي قُوَّةً قَالَ صُمْ يَوْمَيْنِ قَالَ زِدْنِي قَالَ صُمْ ثَلَاثَةَ أَيَّامٍ قَالَ زِدْنِي قَالَ صُمْ مِنْ الْحُرُمِ وَاتْرُكْ صُمْ مِنْ الْحُرُمِ وَاتْرُكْ صُمْ مِنْ الْحُرُمِ وَاتْرُكْ وَقَالَ بِأَصَابِعِهِ الثَّلَاثَةِ فَضَمَّهَا ثُمَّ أَرْسَلَهَا"
    },
    {
      "number": 2075,
      "id": "Telah menceritakan kepada kami [Ibrahim bin Musa], telah menceritakan kepada kami [Isa], telah menceritakan kepada kami [Utsman bin Hakim], ia beraka; saya bertanya kepada [Sa'id bin Jubair], mengenai puasa Rajab. Ia berkata; telah mengabarkan kepadaku [Ibnu Abbas], bahwa Rasulullah shallallahu 'alaihi wasallam pernah berpuasa hingga kami mengatakan; beliau tidak berbuka. Dan beliau berbuka hingga kami mengatakan; beliau tidak berpuasa. ",
      "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا عِيسَى حَدَّثَنَا عُثْمَانُ يَعْنِي ابْنَ حَكِيمٍ قَالَ سَأَلْتُ سَعِيدَ بْنَ جُبَيْرٍ عَنْ صِيَامِ رَجَبٍ فَقَالَ أَخْبَرَنِي ابْنُ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ حَتَّى نَقُولَ لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لَا يَصُومُ"
    },
    {
      "number": 2076,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrahman bin Mahdi], dari [Mu'awiyah bin Shalih] dari [Abdullah bin Abu Qais], ia mendengar [Aisyah] berkata; bulan yang paling Rasulullah shallallahu 'alaihi wasallam sukai untuk berpuasa adalah Bulan Sya'ban, kemudian beliau menyambungnya dengan Ramadhan. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ سَمِعَ عَائِشَةَ تَقُولُ كَانَ أَحَبَّ الشُّهُورِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَصُومَهُ شَعْبَانُ ثُمَّ يَصِلُهُ بِرَمَضَانَ"
    },
    {
      "number": 2077,
      "id": "Telah menceritakan kepada kami [Muhammad bin Utsman Al 'Ajli], telah menceritakan kepada kami ['Ubaidullah bin Musa] dari [Harun bin Salman], dari ['Ubaidullah bin Muslim Al Qurasyi], dari [ayahnya], ia berkata; saya bertanya atau Nabi shallallahu 'alaihi wasallam ditanya mengenai puasa setahun, lalu beliau berkata; sesungguhnya keluargamu memiliki hak atasmu. Berpuasalah pada Bulan Ramadhan dan setelahnya, serta setiap hari Rabu dan Kamis, maka engkau telah melakukan puasa setahun. Abu Daud berkata; hal tersebut disepakati oleh Zaid Al 'Ukli, sedangkan Ummu Nu'aim menyelisihinya, ia mengatakan; Muslim bin 'Ubaidullah. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْعِجْلِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ مُوسَى عَنْ هَارُونَ بْنِ سَلْمَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ مُسْلِمٍ الْقُرَشِيِّ عَنْ أَبِيهِ قَالَ سَأَلْتُ أَوْ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صِيَامِ الدَّهْرِ فَقَالَ إِنَّ لِأَهْلِكَ عَلَيْكَ حَقًّا صُمْ رَمَضَانَ وَالَّذِي يَلِيهِ وَكُلَّ أَرْبِعَاءَ وَخَمِيسٍ فَإِذَا أَنْتَ قَدْ صُمْتَ الدَّهْرَ قَالَ أَبُو دَاوُد وَافَقَهُ زَيْدٌ الْعُكْلِيُّ وَخَالَفَهُ أَبُو نُعَيْمٍ قَالَ مُسْلِمُ بْنُ عُبَيْدِ اللَّهِ"
    },
    {
      "number": 2078,
      "id": "Telah menceritakan kepada kami [An Nufaili], Telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Shafwan bin Sulaim] serta [Sa'd bin Sa'id], dari [Umar bin Tsabit Al Anshari], dari [Abu Ayyub] sahabat nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Barangsiapa yang melakukan puasa pada Bulan Ramadhan kemudian ia ikutkan dengan puasa enam hari pada Bulan Syawal, maka seolah-olah ia berpuasa satu tahun.\"",
      "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ وَسَعْدِ بْنِ سَعِيدٍ عَنْ عُمَرَ بْنِ ثَابِتٍ الْأَنْصَارِيِّ عَنْ أَبِي أَيُّوبَ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ بِسِتٍّ مِنْ شَوَّالٍ فَكَأَنَّمَا صَامَ الدَّهْرَ"
    },
    {
      "number": 2079,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah], dari [Malik], dari [Abu An Nadhr] mantan budak Umar bin 'Ubaidullah, dari [Abu Salamah bin Abdurrahman] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam bahwa ia berkata; Rasulullah shallallahu 'alaihi wasallam berpuasa hingga kami mengatakan; beliau tidak berbuka, dan beliau berbuka hingga kami mengatakan; beliau tidak berpuasa. Dan tidaklah aku melihat Rasulullah shallallahu 'alaihi wasallam menyempurnakan puasa satu bulan sama sekali kecuali pada Bulan Ramadhan, dan tidaklah aku melihat beliau dalam satu bulan lebih banyak melakukan puasa daripada berpuasa pada Bulan Sya'ban. Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Muhammad bin 'Amr] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan maknanya. Ia menambahkan; beliau melakukan puasa padanya kecuali sedikit, bahkan beliau pernah berpuasa pada bulan tersebut secara penuh.",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لَا يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَكْمَلَ صِيَامَ شَهْرٍ قَطُّ إِلَّا رَمَضَانَ وَمَا رَأَيْتُهُ فِي شَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَحَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ زَادَ كَانَ يَصُومُهُ إِلَّا قَلِيلًا بَلْ كَانَ يَصُومُهُ كُلَّهُ"
    },
    {
      "number": 2080,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Aban], telah menceritakan kepada kami [Yahya] dari [Umar bin Abu Al Hakam bin Tsauban] dari [mantan budak Qudamah bin Mazh'un] dari [mantan budak Usamah bin Zaid], bahwa ia pernah pergi bersama Usamah menuju bukit Al Qura untuk mencari hartanya, ia berpuasa pada hari Senin dan Kamis. Kemudian mantan budaknya berkata; kenapa engkau berpuasa pada Hari Senin dan Kamis? Dan ia ditanya mengeani hal tersebut, lalu ia berkata; sesungguhnya Nabi shallallahu 'alaihi wasallam berkata: \"Sesungguhnya amalan para hamba disampaikan pada hari Senin dan Kamis.\" Abu Daud berkata; demikianlah yang dikatakan oleh Hisyam Ad Dastuwai dari Yahya dari Umar bin Abu Al Hakam. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ عُمَرَ بْنِ أَبِي الْحَكَمِ بْنِ ثَوْبَانَ عَنْ مَوْلَى قُدَامَةَ بْنِ مَظْعُونٍ عَنْ مَوْلَى أُسَامَةَ بْنِ زَيْدٍأَنَّهُ انْطَلَقَ مَعَ أُسَامَةَ إِلَى وَادِي الْقُرَى فِي طَلَبِ مَالٍ لَهُ فَكَانَ يَصُومُ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَقَالَ لَهُ مَوْلَاهُ لِمَ تَصُومُ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِ وَأَنْتَ شَيْخٌ كَبِيرٌ فَقَالَ إِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِ وَسُئِلَ عَنْ ذَلِكَ فَقَالَ إِنَّ أَعْمَالَ الْعِبَادِ تُعْرَضُ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِقَالَ أَبُو دَاوُد كَذَا قَالَ هِشَامٌ الدَّسْتُوَائِيُّ عَنْ يَحْيَى عَنْ عُمَرَ بْنِ أَبِي الْحَكَمِ"
    },
    {
      "number": 2081,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu 'Awanah] dari [Al Hurr bin Ash Shabbah], dari [Hunaidah bin Khalid] dari [Seorang wanita] dari [sebagian isteri Nabi shallallahu 'alaihi wasallam] ia berkata; Rasulullah shallallahu 'alaihi wasallam berpuasa pada tanggal sembilan Bulan Dzul Hijjah, serta pada Hari 'Asyura` serta tiga hari dari setiap bulan, dan hari Senin serta Kamis pada setiap bulan. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْحُرِّ بْنِ الصَّبَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنْ امْرَأَتِهِ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ تِسْعَ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ وَالْخَمِيسَ"
    },
    {
      "number": 2083,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu 'Awanah], dari [Al A'masy] dari [Ibrahim], dari [Al Aswad] dari [Aisyah], ia berkata; aku pernah melihat Rasulullah shallallahu 'alaihi wasallam berpuasa sepuluh hari sama sekali. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَائِمًا الْعَشْرَ قَطُّ"
    },
    {
      "number": 2084,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], telah menceritakan kepada kami [Hausyab bin 'Uqail], dari [Mahdi Al Hajari], telah menceritakan kepada kami ['Ikrimah], ia berkata; dahulu kami pernah di sisi [Abu Hurairah] di rumahnya, kemudian ia bercerita kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang berpuasa pada hari 'Arafah di 'Arafah. ",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَوْشَبُ بْنُ عُقَيْلٍ عَنْ مَهْدِيٍّ الْهَجَرِيِّ حَدَّثَنَا عِكْرِمَةُ قَالَكُنَّا عِنْدَ أَبِي هُرَيْرَةَ فِي بَيْتِهِ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَةَ"
    },
    {
      "number": 2085,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu An Nadhr] dari ['Umair] mantan budak Abdullah bin Abbas, dari [Ummu Al Fadhl binti Al Harits] bahwa beberapa orang berselisih di hadapannya pada Hari 'Arafah mengenai puasa Rasulullah shallallahu 'alaihi wasallam, kemudian sebagian mereka mengatakan; beliau berpuasa, dan sebagian mereka mengatakan; beliau tidak berpuasa. Kemudian Ummu Al Fadhl mengirimkan mangkuk yang berisi susu kepada beliau sementara beliau sedang berada di atas untanya di 'Arafah lalu beliau meminumnya. ",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي النَّضْرِ عَنْ عُمَيْرٍ مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ أَنَّ نَاسًا تَمَارَوْا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صَوْمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُهُمْ هُوَ صَائِمٌ وَقَالَ بَعْضُهُمْ لَيْسَ بِصَائِمٍ فَأَرْسَلَتْ إِلَيْهِ بِقَدَحِ لَبَنٍ وَهُوَ وَاقِفٌ عَلَى بَعِيرِهِ بِعَرَفَةَ فَشَرِبَ"
    },
    {
      "number": 2086,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata; dahulu Hari 'Asyura adalah berpuasanya orang-orang Quraisy pada masa jahiliyah, dan Rasulullah shallallahu 'alaihi wasallam melakukan puasa pada masa jahiliyah, kemudian tatkala Rasulullah shallallahu 'alaihi wasallam datang ke Madinah beliau berpuasa pada hari tersebut dan beliau memerintahkan untuk berpuasa. Kemudian tatkala diwajibkan puasa pada Bulan Ramadhan maka puasa itulah yang diwajibkan dan puasa hari 'Asyura di tinggalkan. Barangsiapa yang berkeinginan (berpuasa) maka ia (boleh) berpuasa, dan barangsiapa berkeinginan (tidak berpuasa) maka ia (boleh) meninggalkannya. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ يَوْمُ عَاشُورَاءَ يَوْمًا تَصُومُهُ قُرَيْشٌ فِي الْجَاهِلِيَّةِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُهُ فِي الْجَاهِلِيَّةِ فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ صَامَهُ وَأَمَرَ بِصِيَامِهِ فَلَمَّا فُرِضَ رَمَضَانُ كَانَ هُوَ الْفَرِيضَةُ وَتُرِكَ عَاشُورَاءُ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ"
    },
    {
      "number": 2087,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya] dari ['Ubaidullah], ia berkata; telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar], ia berkata; Hari 'Asyura` adalah hari kami berpuasa pada masa jahiliyah. Kemudian tatkala turun kewajiban puasa Bulan Ramadhan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ini adalah hari diantara hari-hari Allah, barangsiapa yang berkeinginan (berpuasa) ia (boleh) berpuasa, dan barangsiapa yang berkeinginan (berbuka) ia (boleh) meninggalkannya (tidak berpuasa).\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَكَانَ عَاشُورَاءُ يَوْمًا نَصُومُهُ فِي الْجَاهِلِيَّةِ فَلَمَّا نَزَلَ رَمَضَانُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا يَوْمٌ مِنْ أَيَّامِ اللَّهِ فَمَنْ شَاءَ صَامَهُ وَمَنْ شَاءَ تَرَكَهُ"
    },
    {
      "number": 2088,
      "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub], Telah menceritakan kepada kami [Husyaim], telah menceritakan kepada kami [Abu Bisyr], dari [Sa'id bin Jubair], dari [Ibnu Abbas], ia berkata; tatkala Nabi shallallahu 'alaihi wasallam datang ke Madinah, beliau mendapati orang-orang Yahudi berpuasa pada hari 'Asyura, kemudian mereka ditanya mengenai hal tersebut. Kemudian mereka berkata; ini adalah hari dimana Allah memenangkan Musa atas Fir'aun, sementara kami sedang berpuasa sebagai pengagungan terhadapnya. Rasulullah shallallahu 'alaihi wasallam berkata; kami lebih berhak terhadap Musa daripada kalian. Dan beliau memerintahkan untuk berpuasa pada hari tersebut. ",
      "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا أَبُو بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَجَدَ الْيَهُودَ يَصُومُونَ عَاشُورَاءَ فَسُئِلُوا عَنْ ذَلِكَ فَقَالُوا هَذَا الْيَوْمُ الَّذِي أَظْهَرَ اللَّهُ فِيهِ مُوسَى عَلَى فِرْعَوْنَ وَنَحْنُ نَصُومُهُ تَعْظِيمًا لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْنُ أَوْلَى بِمُوسَى مِنْكُمْ وَأَمَرَ بِصِيَامِهِ"
    },
    {
      "number": 2089,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri], telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku [Yahya bin Ayyub], bahwa [Isma'il bin Umayyah Al Qurasyi] telah menceritakan kepadanya bahwa ia telah mendengar [Abu Ghatafan] berkata; saya mendengar [Abdullah bin Abbas] ketika Nabi shallallahu 'alaihi wasallam berpuasa pada hari 'Asyura ia berkata; dan beliau memerintahkan kami agar berpuasa pada hari tersebut. Para sahabat kertanya; wahai Rasulullah, itu adalah hari dimana orang-orang yahudi dan nashrani mengagungkannya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila tahun depan maka kita akan berpuasa pada hari kesembilan.\" Kemudian belum datang tahun depan Rasulullah shallallahu 'alaihi wasallam telah meninggal dunia. ",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ أَنَّ إِسْمَعِيلَ بْنَ أُمَيَّةَ الْقُرَشِيَّ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا غَطَفَانَ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ يَقُولُحِينَ صَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَاشُورَاءَ وَأَمَرَنَا بِصِيَامِهِ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ يَوْمٌ تُعَظِّمُهُ الْيَهُودُ وَالنَّصَارَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا كَانَ الْعَامُ الْمُقْبِلُ صُمْنَا يَوْمَ التَّاسِعِ فَلَمْ يَأْتِ الْعَامُ الْمُقْبِلُ حَتَّى تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
    },
    {
      "number": 2090,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya bin Sa'id], dari [Mu'awiyah bin Ghallab]. Dan telah diriwayatkan dari jalur yang lain: dan telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Isma'il], telah mengabarkan kepadaku [Hajib bin Umar] secara makna, dari [Al Hakam bin Al A'raj], ia berkata; aku mendatangi [Ibnu Abbas], sementara ia sedang berbantalkan pakaiannya di Masjid Haram kemudian aku bertanya kepada mengenai puasa Hari 'Asyura`. Kemudian ia berkata; apabila engkau melihat hilal Bulan Muharram maka hitunglah, kemudian apabila pada hari yang kesembilan. Kemudian pada paginya beliau berpuasa. Aku katakan; begitulah Muhammad shallallahu 'alaihi wasallam berpuasa.",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ عَنْ مُعَاوِيَةَ بْنِ غَلَّابٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ أَخْبَرَنِي حَاجِبُ بْنُ عُمَرَ جَمِيعًا الْمَعْنَى عَنْ الْحَكَمِ بْنِ الْأَعْرَجِ قَالَأَتَيْتُ ابْنَ عَبَّاسٍ وَهُوَ مُتَوَسِّدٌ رِدَاءَهُ فِي الْمَسْجِدِ الْحَرَامِ فَسَأَلْتُهُ عَنْ صَوْمِ يَوْمِ عَاشُورَاءَ فَقَالَ إِذَا رَأَيْتَ هِلَالَ الْمُحَرَّمِ فَاعْدُدْ فَإِذَا كَانَ يَوْمُ التَّاسِعِ فَأَصْبِحْ صَائِمًا فَقُلْتُ كَذَا كَانَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ فَقَالَ كَذَلِكَ كَانَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ"
    },
    {
      "number": 2091,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal], telah menceritakan kepada kami [Yazid bin Zurai'], telah menceritakan kepada kami [Sa'id], dari [Qatadah] dari [Abdurrahman bin Maslamah], dari [pamannya] bahwa orang-orang dari Kabilah Aslam datang kepada Nabi shallallahu 'alaihi wasallam kemudian beliau berkata: \"Apakah kalian berpuasa pada hari ini?\" Mereka berkata; tidak. Beliau berkata: \"Sempurnakan sisa hari kalian ini dan gantilah (pada hari yang lain).\" Abu Daud berkata; yang beliau maksudkan adalah Hari 'Asyura. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْلَمَةَ عَنْ عَمِّهِأَنَّ أَسْلَمَ أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ صُمْتُمْ يَوْمَكُمْ هَذَا قَالُوا لَا قَالَ فَأَتِمُّوا بَقِيَّةَ يَوْمِكُمْ وَاقْضُوهُقَالَ أَبُو دَاوُد يَعْنِي يَوْمَ عَاشُورَاءَ"
    },
    {
      "number": 2093,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah menceritakan kepada kami [Hammam], dari [Anas] saudara Muhammad, dari [Ibnu Milhan Al Qaisi] dari [ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami agar berpuasa pada hari Bidh yaitu tanggal tiga belas, empat belas, dan lima belas. Ia berkata; dan beliau berkata; hari-hari tersebut seperti satu tahun. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا هَمَّامٌ عَنْ أَنَسٍ أَخِي مُحَمَّدٍ عَنْ ابْنِ مِلْحَانَ الْقَيْسِيِّ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا أَنْ نَصُومَ الْبِيضَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ قَالَ وَقَالَ هُنَّ كَهَيْئَةِ الدَّهْرِ"
    },
    {
      "number": 2094,
      "id": "Telah menceritakan kepada kami [Abu Kamil], telah menceritakan kepada kami [Abu Daud], telah menceritakan kepada kami [Syaiban], dari ['Ashim] dari [Zirr], dari [Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam berpuasa tiga hari setiap bulan. ",
      "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شَيْبَانُ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ يَعْنِي مِنْ غُرَّةِ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ"
    },
    {
      "number": 2095,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], dari ['Ashim bin Bahlah], dari [Sawa` Al Khuza'i], dari [Hafshah], ia berkata; Rasulullah shallallahu 'alaihi wasallam berpuasa tiga hari setiap bulan hari Senin, dan Kamis, serta hari Senin pada Jum'at yang lain. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ سَوَاءٍ الْخُزَاعِيِّ عَنْ حَفْصَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ ثَلَاثَةَ أَيَّامٍ مِنْ الشَّهْرِ الِاثْنَيْنِ وَالْخَمِيسَ وَالِاثْنَيْنِ مِنْ الْجُمْعَةِ الْأُخْرَى"
    },
    {
      "number": 2096,
      "id": "Telah menceritakan kepada kami [Zuhair bin Harb], telah menceritakan kepada kami [Muhammad bin Fudhail], telah menceritakan kepada kami [Al Hasan bin 'Ubaidullah] dari [Hunaidah Al Khuza'i], dari [ibunya], ia berkata; aku menemui [Ummu Salamah], kemudian bertanya kepadanya mengenai puasa. Lalu ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkanku agar berpuasa tiga hari setiap bulan, yang pertama adalah puasa Senin dan Kamis. ",
      "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا الْحَسَنُ بْنُ عُبَيْدِ اللَّهِ عَنْ هُنَيْدَةَ الْخُزَاعِيِّ عَنْ أُمِّهِ قَالَتْدَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَسَأَلْتُهَا عَنْ الصِّيَامِ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنِي أَنْ أَصُومَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلُهَا الِاثْنَيْنِ وَالْخَمِيسِ"
    },
    {
      "number": 2097,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abdul Warits] dari [Yazid Ar Risyk], dari [Mu'adzah], ia berkata; aku katakan kepada [Aisyah]; apakah Rasulullah shallallahu 'alaihi wasallam melakukan puasa tiga hari setiap bulan? Ia berkata; ya. Aku katakan; pada bulan apakah beliau berpuasa? Ia berkata; beliau tidak perduli pada bulan apakah beliau berpuasa. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ يَزِيدَ الرِّشْكِ عَنْ مُعَاذَةَ قَالَتْقُلْتُ لِعَائِشَةَ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ قَالَتْ نَعَمْ قُلْتُ مِنْ أَيِّ شَهْرٍ كَانَ يَصُومُ قَالَتْ مَا كَانَ يُبَالِي مِنْ أَيِّ أَيَّامِ الشَّهْرِ كَانَ يَصُومُ"
    },
    {
      "number": 2098,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdullah bin Wahb], telah menceritakan kepada kami [Ibnu Lahi'ah], serta [Yahya bin Ayyub] dari [Abdullah bin Abu Bakr bin Hazm] dari [Ibnu Syihab], dari [Salim bin Abdullah] dari [ayahnya] dari [Hafshah] isteri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Barangsiapa yang belum berniat untuk berpuasa sebelum fajar, maka tidak ada (tidak sah) puasa baginya.\" Abu Daud berkata; hadits tersebut diriwayatkan oleh [Al Laits] serta [Ishaq bin Hazim] juga, seluruhnya berasal dari [Abdullah bin Abu Bakr], seperti itu dan meriwayatkannya secara mauquf kepada [Hafshah], Dan diriwayatkan [Ma'mar], [Az Zubaidi] dan [Ibnu 'Uyainah] serta [Yunus Al Aili] seluruhnya berasal dari [Az Zuhri]. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي ابْنُ لَهِيعَةَ وَيَحْيَى بْنُ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ حَفْصَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُجْمِعْ الصِّيَامَ قَبْلَ الْفَجْرِ فَلَا صِيَامَ لَهُقَالَ أَبُو دَاوُد رَوَاهُ اللَّيْثُ وَإِسْحَقُ بْنُ حَازِمٍ أَيْضًا جَمِيعًا عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ مِثْلَهُ وَوَقَفَهُ عَلَى حَفْصَةَ مَعْمَرٌ وَالزُّبَيْدِيُّ وَابْنُ عُيَيْنَةَ وَيُونُسُ الْأَيْلِيُّ كُلُّهُمْ عَنْ الزُّهْرِيِّ"
    },
    {
      "number": 2099,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah menceritakan kepada kami [Sufyan], dan telah diriwayatkan [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Waki'], seluruhnya berasal dari [Thalhah bin Yahya], dari [Aisyah binti Thalhah], dari [Aisyah] radliallahu 'anha, ia berkata; Rasulullah shallallahu 'alaihi wasallam apabila menemuiku beliau mengatakan; apakah kalian memiliki makanan? Apabila kami mengatakan; tidak, maka beliau berkata; sesungguhnya aku berpuasa. Waki' berkata; kemudian pada suatu hari beliau menemui kami, lalu kami katakan; wahai Rasulullah kami telah diberi hadiah hais (makanan dari campuran kurma, keju dan mentega), kemudian kami menyimpannya untuk engkau. Lalu beliau berkata: \"Bawalah kemari!\" Thalhah berkata; maka, pada pagi hari tersebut beliau berpuasa kemudian berbuka. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ جَمِيعًا عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ عَلَيَّ قَالَ هَلْ عِنْدَكُمْ طَعَامٌ فَإِذَا قُلْنَا لَا قَالَ إِنِّي صَائِمٌ زَادَ وَكِيعٌ فَدَخَلَ عَلَيْنَا يَوْمًا آخَرَ فَقُلْنَا يَا رَسُولَ اللَّهِ أُهْدِيَ لَنَا حَيْسٌ فَحَبَسْنَاهُ لَكَ فَقَالَ أَدْنِيهِ قَالَ طَلْحَةُ فَأَصْبَحَ صَائِمًا وَأَفْطَرَ"
    },
    {
      "number": 2100,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Jarir bin Abdul Hamid], dari [Yazid bin Abu Ziyad] dari [Abdullah bin Al Harits], dari [Ummu Hani`], ia berkata; pada saat penaklukan Mekkah Fathimah datang dan duduk di sebelah kiri Rasulullah shallallahu 'alaihi wasallam sementara Ummu Hani` di sisi kanan beliau. Ummu Hani` berkata; kemudian datanglah seorang anak wanita membawa bejana berisi air minum, kemudian ia memberikannya kepada beliau. Lalu beliau minum sebagian darinya kemudian beliau memberikannya kepada Ummu Hani`, lalu ia meminum sebagian darinya dan berkata; wahai Rasulullah, sungguh saya telah berbuka, tadinya aku sedang berpuasa. Kemudian beliau berkata kepadanya: \" Apakah engkau mengqadha` puasa?\" Ia berkata; tidak. Lalu beliau berkata: \"Hal itu tidak mengapa bagimu apabila puasa sunah.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ هَانِئٍ قَالَتْ لَمَّا كَانَ يَوْمُ الْفَتْحِ فَتْحِ مَكَّةَ جَاءَتْ فَاطِمَةُ فَجَلَسَتْ عَنْ يَسَارِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُمُّ هَانِئٍ عَنْ يَمِينِهِ قَالَتْ فَجَاءَتْ الْوَلِيدَةُ بِإِنَاءٍ فِيهِ شَرَابٌ فَنَاوَلَتْهُ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ أُمَّ هَانِئٍ فَشَرِبَتْ مِنْهُ فَقَالَتْ يَا رَسُولَ اللَّهِ لَقَدْ أَفْطَرْتُ وَكُنْتُ صَائِمَةً فَقَالَ لَهَا أَكُنْتِ تَقْضِينَ شَيْئًا قَالَتْ لَا قَالَ فَلَا يَضُرُّكِ إِنْ كَانَ تَطَوُّعًا"
    },
    {
      "number": 2101,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdullah bin Wahb], telah mengabarkan kepadaku [Haiwah bin Syuraih] dari [Ibnu Al Had], dari [Zumail] mantan budak 'Urwah, dari ['Urwah bin Az Zubair] dari [Aisyah], ia berkata; aku dan Hafshah telah diberi hadiah makanan sementara kami sedang berpuasa, kemudian kami berbuka. Lalu Rasulullah shallallahu 'alaihi wasallam berkata: \"Tidak mengapa, berpuasalah pada hari yang lain sebagai gantinya.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي حَيْوَةُ بْنُ شُرَيْحٍ عَنْ ابْنِ الْهَادِ عَنْ زُمَيْلٍ مَوْلَى عُرْوَةَ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْأُهْدِيَ لِي وَلِحَفْصَةَ طَعَامٌ وَكُنَّا صَائِمَتَيْنِ فَأَفْطَرْنَا ثُمَّ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا لَهُ يَا رَسُولَ اللَّهِ إِنَّا أُهْدِيَتْ لَنَا هَدِيَّةٌ فَاشْتَهَيْنَاهَا فَأَفْطَرْنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَلَيْكُمَا صُومَا مَكَانَهُ يَوْمًا آخَرَ"
    },
    {
      "number": 2102,
      "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah menceritakan kepada kami [Ma'mar], dari [Hammam bin Munabbih], bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita tidak boleh berpuasa sementara suaminya berada di sisinya kecuali dengan seizinnya selain puasa pada Bulan Ramadhan dan tidak boleh ia mengizinkan seseorang di dalam rumahnya sementara suaminya berada di sisinya kecuali dengan seizinnya.\"",
      "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَصُومُ الْمَرْأَةُ وَبَعْلُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ غَيْرَ رَمَضَانَ وَلَا تَأْذَنُ فِي بَيْتِهِ وَهُوَ شَاهِدٌ إِلَّا بِإِذْنِهِ"
    },
    {
      "number": 2105,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Sufyan], dari [Abu Az Zinad], dari [Al A'raj], dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang diantara kalian diundang untuk makan sementara ia sedang berpuasa, hendaknya ia mengatakan; saya sedang berpuasa.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيَقُلْ إِنِّي صَائِمٌ"
    },
    {
      "number": 2106,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Az Zuhri] dari ['Urwah] dari [Aisyah], bahwa Nabi shallallahu 'alaihi wasallam beri'tikaf pada sepuluh hari terakhir Bulan Ramadhan hingga Allah mewafatkannya, kemudian para isterinya beri'tikaf setelah beliau. ",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى قَبَضَهُ اللَّهُ ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ"
    },
    {
      "number": 2107,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Tsabit] dari [Abu Rafi'] dari [Ubai bin Ka'bin], bahwa Nabi shallallahu 'alaihi wasallam beri'tikaf sepuluh hari Bulan Ramadhan, dan beliau tidak beri'tikaf satu tahun. Kemudian tatkala pada tahun mendatang beliau beri'tikaf selama dua puluh malam. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ أَبِي رَافِعٍ عَنْ أُبَيِّ بْنِ كَعْبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ فَلَمْ يَعْتَكِفْ عَامًا فَلَمَّا كَانَ فِي الْعَامِ الْمُقْبِلِ اعْتَكَفَ عِشْرِينَ لَيْلَةً"
    },
    {
      "number": 2109,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri], telah mengabarkan kepada kami [Ibnu Wahb], dari [Yunus], bahwa [Nafi'] telah mengabarkan kepadanya dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam beri'tikaf sepuluh hari terakhir Bulan Ramadhan. Nafi' berkata; Abdullah telah memperlihatkan kepadaku tempat yang digunakan Rasulullah shallallahu 'alaihi wasallam untuk beri'tikaf di Masjid. ",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ أَنَّ نَافِعًا أَخْبَرَهُ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَقَالَ نَافِعٌ وَقَدْ أَرَانِي عَبْدُ اللَّهِ الْمَكَانَ الَّذِي كَانَ يَعْتَكِفُ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَسْجِدِ"
    },
    {
      "number": 2110,
      "id": "Telah menceritakan kepada kami [Hannad], dari [Abu Bakr] dari [Abu Hushain] dari [Abu Shalih] dari [Abu Hurairah], ia berkata; Nabi shallallahu 'alaihi wasallam beri'tikaf sepuluh hari setiap Bulan Ramadhan. Kemudian tatkala pada tahun meninggalnya, beliau melakukan i'tikaf sebanyak dua puluh hari.",
      "arab": "حَدَّثَنَا هَنَّادٌ عَنْ أَبِي بَكْرٍ عَنْ أَبِي حُصَيْنٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْتَكِفُ كُلَّ رَمَضَانَ عَشَرَةَ أَيَّامٍ فَلَمَّا كَانَ الْعَامُ الَّذِي قُبِضَ فِيهِ اعْتَكَفَ عِشْرِينَ يَوْمًا"
    },
    {
      "number": 2116,
      "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim], telah menceritakan kepada kami [Abu Daud], telah menceritakan kepada kami [Abdullah bin Budail], dari ['Amr bin Dinar], dari [Ibnu Umar] bahwa Umar radliallahu 'anhu telah mewajibkan dirinya pada masa jahiliyah untuk beri'tikaf satu malam atau satu hari. Kemudian ia bertanya kepada Nabi shallallahu 'alaihi wasallam. Lalu beliau berkata: \"Beri'tikaflah dan berpuasalah!\" Telah menceritakan kepada kami [Abdullah bin Umar bin Muhammad bin Aban bin Shalih Al Qurasyi], telah menceritakan kepada kami ['Amr bin Muhammad Al 'Anqazi] dari [Abdullah bin Budail] dengan sanadnya seperti itu, ia berkata; ketika Abdullah dalam keadaan beri'tikaf, tiba-tiba orang-orang bertakbir. Umar berkata; apa ini wahai Abdullah? Ia berkata; tawanan perang Hawazin, Nabi shallallahu 'alaihi wasallam telah membebaskannya. Umar berkata; dan budak wanita tersebut. Kemudian ia mengirimkannya. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُدَيْلٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ عُمَرَ رَضِيَ اللَّهُ عَنْهُ جَعَلَ عَلَيْهِ أَنْ يَعْتَكِفَ فِي الْجَاهِلِيَّةِ لَيْلَةً أَوْ يَوْمًا عِنْدَ الْكَعْبَةِ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اعْتَكِفْ وَصُمْ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانَ بْنِ صَالِحٍ الْقُرَشِيُّ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ يَعْنِي الْعَنْقَزِيَّ عَنْ عَبْدِ اللَّهِ بْنِ بُدَيْلٍ بِإِسْنَادِهِ نَحْوَهُ قَالَ فَبَيْنَمَا هُوَ مُعْتَكِفٌ إِذْ كَبَّرَ النَّاسُ فَقَالَ مَا هَذَا يَا عَبْدَ اللَّهِ قَالَ سَبْيُ هَوَازِنَ أَعْتَقَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَتِلْكَ الْجَارِيَةُ فَأَرْسَلَهَا مَعَهُمْ"
    },
    {
      "number": 2492,
      "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Abdullah bin 'Atha`], dari [Abdullah bin Buraidah], dari [ayahnya], bahwa seorang wanita datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; dahulu aku bersedekah kepada ibuku dengan memberikan seorang budak wanita, dan beliau meninggal serta meninggalkan budak tersebut. Beliau berkata: \"Telah tetap pahalamu dan budak tersebut kembali kepadamu diantara harta warisan.\" Wanita tersebut berkata; beliau meninggal dalam keadaan memiliki kewajiban berpuasa satu bulan. Apakah sah atau dapat menunaikan untuknya apabila aku berpuasa untuknya? Beliau berkata: \"Ya.\" Wanita tersebtu berkata; sesungguhnya beliau belum berhaji, apakah sah atau dapat menunaikan untuknya apabila aku berhaji untuknya? Beliau berkata: \"Ya.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بَنِ بُرَيْدَةَ عَنْ أَبِيهِ بُرَيْدَةَأَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كُنْتُ تَصَدَّقْتُ عَلَى أُمِّي بِوَلِيدَةٍ وَإِنَّهَا مَاتَتْ وَتَرَكَتْ تِلْكَ الْوَلِيدَةَ قَالَ قَدْ وَجَبَ أَجْرُكِ وَرَجَعَتْ إِلَيْكِ فِي الْمِيرَاثِ قَالَتْ وَإِنَّهَا مَاتَتْ وَعَلَيْهَا صَوْمُ شَهْرٍ أَفَيُجْزِئُ أَوْ يَقْضِي عَنْهَا أَنْ أَصُومَ عَنْهَا قَالَ نَعَمْ قَالَتْ وَإِنَّهَا لَمْ تَحُجَّ أَفَيُجْزِئُ أَوْ يَقْضِي عَنْهَا أَنْ أَحُجَّ عَنْهَا قَالَ نَعَمْ"
    },
    {
      "number": 2865,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan], ia berkata; telah mengabarkan kepadaku [Yahya bin Sa'id Al Anshari], telah mengabarkan kepadaku ['Ubaidullah bin Zahr] bahwa [Abu Sa'id] telah mengabarkan kepadanya bahwa [Abdullah bin Malik] telah mengabarkan kepadanya bahwa ['Uqbah bin 'Amir] telah mengabarkan kepadanya bahwa ia pernah bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai saudara wanitanya yang bernadzar untuk berhaji dengan tidak beralas kaki dan tidak bertutup kepala. Kemudian beliau berkata: \"Perintahkan dia agar menutup kepala, menaiki kendaraan serta berpuasa tiga hari.\" Telah menceritakan kepada kami [Makhlad bin Khalid], telah menceritakan kepada kami [Abdurrazzaq], telah menceritakan kepada kami [Ibnu Juraij], ia berkata; [Yahya bin Sa'id] telah menulis surat kepadaku; telah mengabarkan kepadaku ['Ubaidullah bin Zahr] mantan budak Bani Dhamrah bahwa [Abu Sa'id Ar Ru'aini] telah mengabarkan kepadanya dengan sanad Yahya dan maknanya. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ زَحْرٍ أَنَّ أَبَا سَعِيدٍ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكٍ أَخْبَرَهُ أَنَّ عُقْبَةَ بْنَ عَامِرٍ أَخْبَرَهُأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أُخْتٍ لَهُ نَذَرَتْ أَنْ تَحُجَّ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ فَقَالَ مُرُوهَا فَلْتَخْتَمِرْ وَلْتَرْكَبْ وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍحَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ كَتَبَ إِلَيَّ يَحْيَى بْنُ سَعِيدٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ زَحْرٍ مَوْلًى لِبَنِي ضَمْرَةَ وَكَانَ أَيَّمَا رَجُلٍ أَنَّ أَبَا سَعِيدٍ الرُّعَيْنِيَّ أَخْبَرَهُ بِإِسْنَادِ يَحْيَى وَمَعْنَاهُ"
    },
    {
      "number": 2870,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Wuhaib], telah menceritakan kepada kami [Ayyub] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; ketika Nabi shallallahu 'alaihi wasallam berkhutbah, tiba-tiba terdapat seorang laki-laki yang berdiri di bawah terik matahari. Kemudian beliau bertanya mengenainya. Mereka berkata; orang ini adalah Abu Israil, ia bernadzar untuk berdiri dan tidak duduk, serta tidak bernaung, tidak berbicara, dan berpuasa. Beliau berkata: \"Perintahkan dia agar berbicara, bernaung, duduk dan menyempurnakan puasanya!\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَبَيْنَمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ إِذَا هُوَ بِرَجُلٍ قَائِمٍ فِي الشَّمْسِ فَسَأَلَ عَنْهُ قَالُوا هَذَا أَبُو إِسْرَائِيلَ نَذَرَ أَنْ يَقُومَ وَلَا يَقْعُدَ وَلَا يَسْتَظِلَّ وَلَا يَتَكَلَّمَ وَيَصُومَ قَالَ مُرُوهُ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَقْعُدْ وَلْيُتِمَّ صَوْمَهُ"
    },
    {
      "number": 2877,
      "id": "Telah menceritakan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa seorang wanita mengarungi bahtera, kemudian ia bernadzar seandainya Allah menyelamatkannya maka ia akan berpuasa satu bulan. Kemudian Allah menyelamatkannya dan ia tidak berpuasa hingga ia meninggal. Lalu anak wanitanya atau saudara wanitanya datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau memerintahkannya agar berpuasa untuknya. Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Abdullah bin 'Atho`] dari [Abdullah bin Buraidah] dari [ayahnya] bahwa seorang wanita datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; dahulu aku pernah mensedekahkan budak wanita kepada ibuku, dan ia meninggal dalam keadaan memiliki tanggungan puasa satu bulan. Kemudian Buraidah menyebutkan hadits 'Amr tersebut. ",
      "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ امْرَأَةً رَكِبَتْ الْبَحْرَ فَنَذَرَتْ إِنْ نَجَّاهَا اللَّهُ أَنْ تَصُومَ شَهْرًا فَنَجَّاهَا اللَّهُ فَلَمْ تَصُمْ حَتَّى مَاتَتْ فَجَاءَتْ ابْنَتُهَا أَوْ أُخْتُهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَصُومَ عَنْهَاحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ بُرَيْدَةَ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كُنْتُ تَصَدَّقْتُ عَلَى أُمِّي بِوَلِيدَةٍ وَإِنَّهَا مَاتَتْ وَتَرَكَتْ تِلْكَ الْوَلِيدَةَ قَالَ قَدْ وَجَبَ أَجْرُكِ وَرَجَعَتْ إِلَيْكِ فِي الْمِيرَاثِ قَالَتْ وَإِنَّهَا مَاتَتْ وَعَلَيْهَا صَوْمُ شَهْرٍ فَذَكَرَ نَحْوَ حَدِيثِ عَمْرٍو"
    },
    {
      "number": 2878,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] ia berkata; saya mendengar [Al A'masy].. dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah menceritakan kepada kami [Abu Mu'awiyah] dan [Al A'masy] secara makna, dari [Muslim Al Bathin] dari [Sa'id bin Jubair], dari [Ibnu Abbas] bahwa seorang wanita telah datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; sesungguhnya ibuku memiliki tanggungan puasa satu bulan. Apakah boleh saya menunaikan puasa tersebut untuknya? Kemudian beliau berkata: \"Seandainya ibumu memiliki tanggungan hutang apakah engkau akan menunaikannya?\" Ia berkata; ya. Beliau berkata: \"Maka hutang Allah lebih berhak untuk ditunaikan.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى قَالَ سَمِعْتُ الْأَعْمَشَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ الْمَعْنَى عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ امْرَأَةً جَاءَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّهُ كَانَ عَلَى أُمِّهَا صَوْمُ شَهْرٍ أَفَأَقْضِيهِ عَنْهَا فَقَالَ لَوْ كَانَ عَلَى أُمِّكِ دَيْنٌ أَكُنْتِ قَاضِيَتَهُ قَالَتْ نَعَمْ قَالَ فَدَيْنُ اللَّهِ أَحَقُّ أَنْ يُقْضَى"
    },
    {
      "number": 2879,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku ['Amr bin Al Harits] dari ['Ubaidullah bin Abu Ja'far] dari [Muhammad bin Ja'far bin Az Zubair] dari ['Urwah] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang meninggal dalam keadaan memiliki tanggungan puasa, maka walinya berpuasa (sebagai pengganti) untuknya.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ"
    },
    {
      "number": 2887,
      "id": "Telah menceritakan kepada kami [Ja'far bin Musafir At Tinnisi] dari [Ibnu Abu Fudaik], ia berkata; telah menceritakan kepadaku [Thalhah bin Yahya Al Anshari] dari [Abdullah bin Sa'id bin Abu Hindun], dari [Bukair bin Abdullah bin Al Asyajj] dari [Kuraib], dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang bernadzar dengan tidak menyebutkannya, maka kafarahnya adalah kafarah sumpah. Dan barangsiapa yang bernadzar dalam kemaksiatan maka kafarahnya adalah kafarah bersumpah, dan barangsiapa yang bernadzar sesuatu yang tidak ia mampu maka kafarahnya adalah kafarah puasa. Dan barangsiapa yang bernadzar sesuatu yang ia mampu; maka hendaknya ia memenuhinya.\" Abu Daud berkata; hadits ini diriwayatkan Waki' dan yang lainnya dari Abdullah bin Sa'id bin Abu Al Hind, mereka telah menganggapnya muquf pada Ibnu Abbas. ",
      "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ التِّنِّيسِيُّ عَنْ ابْنِ أَبِي فُدَيْكٍ قَالَ حَدَّثَنِي طَلْحَةُ بْنُ يَحْيَى الْأَنْصَارِيُّ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَذَرَ نَذْرًا لَمْ يُسَمِّهِ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا فِي مَعْصِيَةٍ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا لَا يُطِيقُهُ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا أَطَاقَهُ فَلْيَفِ بِهِقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ وَكِيعٌ وَغَيْرُهُ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي الْهِنْدِ أَوْقَفُوهُ عَلَى ابْنِ عَبَّاسٍ"
    },
    {
      "number": 3228,
      "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Shadaqah bin Khalid] telah menceritakan kepada kami [Zaid bin Waqid] dari [Khalid bin Abdullah bin Husain] dari [Abu Hurairah] ia berkata, \"Aku mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam berpuasa, maka aku menunggu waktu berbukanya beliau dengan menyiapkan perasan nabidz yang aku buat dalam Ad dubba (bejana yang terbuat dari labu kering), ternyata minuman tersebut telah mendidih. Beliau pun bersabda: \"Buanglah ke belakang dinding ini. Sebab ini adalah minuman orang yang tidak beriman kepada Allah dan Hari Akhir.\"",
      "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ حُسَيْنٍ عَنْ أَبِي هُرَيْرَةَ قَالَعَلِمْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ فَتَحَيَّنْتُ فِطْرَهُ بِنَبِيذٍ صَنَعْتُهُ فِي دُبَّاءٍ ثُمَّ أَتَيْتُهُ بِهِ فَإِذَا هُوَ يَنِشُّ فَقَالَ اضْرِبْ بِهَذَا الْحَائِطِ فَإِنَّ هَذَا شَرَابُ مَنْ لَا يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ"
    },
    {
      "number": 3247,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian diundang untuk menghadiri sebuah pesta, maka hendaknya ia mendatanginya!\" Telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Abu Usamah] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda dengan makna yang sama, ia menambahkan, \"Jika tidak berpuasa hendaklah ia makan, jika sedang berpuasa hendaklah ia (memberikan) doa.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَاحَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ زَادَ فَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ وَإِنْ كَانَ صَائِمًا فَلْيَدْعُ"
    },
    {
      "number": 3356,
      "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam datang kepada Sa'd bin 'Ubadah, lalu Sa'd menyuguhkan roti dan minyak samin. Nabi shallallahu 'alaihi wasallam kemudian memakannya, setelah itu beliau bersabda: \"Telah berbuka di rumahmu orang-orang yang berpuasa, dan telah makan makananmu orang-orang yang baik, dan bershalawat kepadamu para Malaikat.\"",
      "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ إِلَى سَعْدِ بْنِ عُبَادَةَ فَجَاءَ بِخُبْزٍ وَزَيْتٍ فَأَكَلَ ثُمَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ عِنْدَكُمْ الصَّائِمُونَ وَأَكَلَ طَعَامَكُمْ الْأَبْرَارُ وَصَلَّتْ عَلَيْكُمْ الْمَلَائِكَةُ"
    },
    {
      "number": 4383,
      "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] ia berkata; telah menceritakan kepadaku [Bapakku] dari [Yahya bin Abu Katsir] ia berkata; telah menceritakan kepada kami [Abu Salamah bin 'Abdurrahman] dari [Ya'isy bin Thakhfah bin Qais Al Ghifari] ia berkata, \"Bapakku termasuk ahli suffah.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Ikutlah bersamaku ke rumah 'Aisyah radliallahu 'anha.\" Kami lalu ikut pergi bersamanya. Beliau bersabda: \"Wahai 'Aisyah, berilah kami makanan.\" 'Aisyah kemudian membawa Hasyisyah (sejenis makanan yang terbuat dari biji gandum yang dilembutkan lalu ditaburi daging atau kurma), lalu kami pun memakannya.\" Beliau kemudian bersabda lagi: \"Wahai 'Aisyah, berilah kami makanan.\" 'Aisyah kemudian membawa Haisah (sejenis makanan yang terbuat dari kurma, terigu dan minyak samin) yang berbentuk seperti burung, lalu kami pun memakannya.\" Beliau kemudian bersabda: \"Wahai 'Aisyah, berilah kami minum.\" 'Aisyah kemudian membawa bejana yang berisi susu, lalu kami pun meminumnya.\" Beliau kemudian bersabda lagi: \"Wahai 'Aisyah, berilah kami minum.\" 'Aisyah kemudian membawa bejana kecil, lalu kami pun meminumnya.\" Beliau kemudian bersabda: \"Jika kalian mau silahkan menginap (di sini), dan jika mau silahkan tidur di dalam masjid.\" Perawai berkata, \"Ketika aku tidur dalam masjid dengan telungkup, tiba-tiba di waktu sahur seseorang membangunkan aku dengan kakinya. Laki-laki itu berkata, \"Ini adalah cara tidur yang dibenci oleh Allah.\" Aku lalu melihatnya, dan ternyata laki-laki itu adalah Rasulullah shallallahu 'alaihi wasallam.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ يَعِيشَ بْنِ طَخْفَةَ بْنِ قَيْسٍ الْغِفَارِيِّ قَالَكَانَ أَبِي مِنْ أَصْحَابِ الصُّفَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْطَلِقُوا بِنَا إِلَى بَيْتِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فَانْطَلَقْنَا فَقَالَ يَا عَائِشَةُ أَطْعِمِينَا فَجَاءَتْ بِحَشِيشَةٍ فَأَكَلْنَا ثُمَّ قَالَ يَا عَائِشَةُ أَطْعِمِينَا فَجَاءَتْ بِحَيْسَةٍ مِثْلِ الْقَطَاةِ فَأَكَلْنَا ثُمَّ قَالَ يَا عَائِشَةُ اسْقِينَا فَجَاءَتْ بِعُسٍّ مِنْ لَبَنٍ فَشَرِبْنَا ثُمَّ قَالَ يَا عَائِشَةُ اسْقِينَا فَجَاءَتْ بِقَدَحٍ صَغِيرٍ فَشَرِبْنَا ثُمَّ قَالَ إِنْ شِئْتُمْ بِتُّمْ وَإِنْ شِئْتُمْ انْطَلَقْتُمْ إِلَى الْمَسْجِدِ قَالَ فَبَيْنَمَا أَنَا مُضْطَجِعٌ فِي الْمَسْجِدِ مِنْ السَّحَرِ عَلَى بَطْنِي إِذَا رَجُلٌ يُحَرِّكُنِي بِرِجْلِهِ فَقَالَ إِنَّ هَذِهِ ضِجْعَةٌ يُبْغِضُهَا اللَّهُ قَالَ فَنَظَرْتُ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ"
    },
    {
      "number": 4423,
      "id": "Telah menceritakan kepada kami Ahmad bin Shalih berkata: telah menceritakan kepada kami Abdullah bin Wahb ia berkata: telah mengabarkan kepadaku Sulaiman bin Bilal dari Suhail bin Abu Shalih dari Bapaknya dari Abu Hurairah ia berkata: Jika Rasulullah shallallahu 'alaihi wa sallam dalam suatu perjalanan, dan masuk waktu sahur, beliau mengucapkan:  SAMI'A SAAMI'UN BIHAMDILLAAHI WA NI'MATIHI WAHUSNI BALAA`IHI 'ALAINAA ALLAAHUMMA SHAAHIBNAA FA`AFDLIL 'ALAINAA 'AAIDZAN BILLAAHI MINAN NAAR (Hendaklah mendengar orang yang mendengar pujian Allah dan nikmat-Nya, serta kebaikan pemberian-Nya kepada kami. Ya Allah, temanilah kami, limpahkanlah karuania-Mu kepada kami, seraya berlindung kepada Allah dari neraka).\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ فِي سَفَرٍ فَأَسْحَرَ يَقُولُ سَمِعَ سَامِعٌ بِحَمْدِ اللَّهِ وَنِعْمَتِهِ وَحُسْنِ بَلَائِهِ عَلَيْنَا اللَّهُمَّ صَاحِبْنَا فَأَفْضِلْ عَلَيْنَا عَائِذًا بِاللَّهِ مِنْ النَّارِ"
    }
  ]
}