{
  "kategori": "Umum",
  "hadits": [
    {
      "number": 23,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Al 'Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Takutlah kalian terhadap perihal dua orang yang terlaknat.\" Mereka (para sahabat) bertanya; \"Siapakah dua orang yang terlaknat itu wahai Rasulullah?\" Beliau menjawab: \"Yaitu orang yang buang air besar di jalanan manusia atau tempat berteduhnya mereka.\"",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اتَّقُوا اللَّاعِنَيْنِ قَالُوا وَمَا اللَّاعِنَانِ يَا رَسُولَ اللَّهِ قَالَ الَّذِي يَتَخَلَّى فِي طَرِيقِ النَّاسِ أَوْ ظِلِّهِمْ"
    },
    {
      "number": 28,
      "id": "Telah menceritakan kepada kami [Amru bin Muhammad An Naqid] telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Isra`il] dari [Yusuf bin Abu Burdah] dari [Ayahnya] telah menceritakan kepada saya [Aisyah] radliallahu 'anha bahwasanya Rasulullah shallallahu 'alaihi wasallam apabila keluar dari WC, beliau mengucapkan: \"GHUFRAANAKA (Aku mohon ampunanMu).\"",
      "arab": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا إِسْرَائِيلُ عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ حَدَّثَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ الْغَائِطِ قَالَ غُفْرَانَكَ"
    },
    {
      "number": 50,
      "id": "Telah menceritakan kepada kami [Muhamamd bin Katsir] telah menceritakan kepada kami [Sufyan] dari [Manshur] dan [Hushain] dari [Abu Wa`il] dari [Hudzaifah] bahwasanya Rasulullah shallallahu 'alaihi wasallam apabila bangun di malam hari, beliau menggosok (gigi-gigi) mulutnya dengan siwak. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَحُصَيْنٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَامَ مِنْ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ"
    },
    {
      "number": 158,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Ja'far] dari [Ayahnya] dari [Jabir] bahwasanya Rasulullah shallallahu 'alaihi wasallam pernah memasuki suatu pasar melalui sebagian jalan atas, sedangkan orang banyak berjalan di kiri kanan beliau. Kemudian beliau melewati bangkai seekor anak kambing yang bertelinga kecil, lalu beliau mengambil anak kambing tersebut dengan memagang telinganya, kemudian bersabda: \"Siapakah di antara kalian yang menyukai, bahwa ini miliknya.\" Lalu beliau melanjutkan Hadits tersebut. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِالسُّوقِ دَاخِلًا مِنْ بَعْضِ الْعَالِيَةِ وَالنَّاسُ كَنَفَتَيْهِ فَمَرَّ بِجَدْيٍ أَسَكَّ مَيِّتٍ فَتَنَاوَلَهُ فَأَخَذَ بِأُذُنِهِ ثُمَّ قَالَ أَيُّكُمْ يُحِبُّ أَنَّ هَذَا لَهُ وَسَاقَ الْحَدِيثَ"
    },
    {
      "number": 185,
      "id": "Telah menceritakan kepada kami [Muhammad bin Mihran Al-Bazzaz Ar-Razi] telah menceritakan kepada kami [Mubasysyir Al Halabi] dari [Muhammad Abu Ghassan] dari [Abu Hazim] dari [Sahl bin Sa'd] telah menceritakan kepada saya [Ubay bin Ka'b] bahwa fatwa yang mereka pegang bahwa air (mandi) itu disebabkan karena keluarnya air (mani) adalah suatu rukhshah (keringanan) yang telah diberikan oleh Rasulullah shallallahu 'alaihi wasallam pada permulaan Islam, kemudian beliau menyuruh untuk mandi setelah itu. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الْبَزَّازُ الرَّازِيُّ حَدَّثَنَا مُبَشِّرٌ الْحَلَبِيُّ عَنْ مُحَمَّدٍ أَبِي غَسَّانَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ حَدَّثَنِي أُبَيُّ بْنُ كَعْبٍأَنَّ الْفُتْيَا الَّتِي كَانُوا يَفْتُونَ أَنَّ الْمَاءَ مِنْ الْمَاءِ كَانَتْ رُخْصَةً رَخَّصَهَا رَسُولُ اللَّهِ فِي بَدْءِ الْإِسْلَامِ ثُمَّ أَمَرَ بِالِاغْتِسَالِ بَعْدُ"
    },
    {
      "number": 288,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] dari [Malik] dari [Shafwan bin Sulaim] dari ['Atha` bin Yasar] dari [Abu Sa'id Al-Kudhri] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari Jum'at adalah wajib atas setiap orang yang telah baligh.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ عَنْ مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ"
    },
    {
      "number": 291,
      "id": "Telah menceritakan kepada kami [Muhammad bin Salamah Al-Muradi] telah menceritakan kepada kami [Ibnu Wahb] dari [Amru bin Al-Harits] bahwasanya [Sa'id bin Abi Hilal] dan [Bukair bin Abdullah bin Al-Asyaj] mereka berdua menceritakan kepadanya dari [Abu Bakr bin Al-Munkadir] dari [Amru bin Sulaim Az-Zuraqi] dari [Abdurrahman bin Abi Sa'id Al-Khudri] dari [Ayahnya] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari Jum'at adalah wajib bagi setiap orang dewasa, demikian pula bersiwak dan memakai wangi-wangian jika mampu.\" Hanya saja Bukair tidak menyebutkan Abdurrahman dan dia menyebutkan tentang wewangian; Meskipun dengan wangi-wangian wanita. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ سَعِيدَ بْنَ أَبِي هِلَالٍ وَبُكَيْرَ بْنَ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ حَدَّثَاهُ عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْغُسْلُ يَوْمَ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ وَالسِّوَاكُ وَيَمَسُّ مِنْ الطِّيبِ مَا قُدِّرَ لَهُإِلَّا أَنَّ بُكَيْرًا لَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ وَقَالَ فِي الطِّيبِ وَلَوْ مِنْ طِيبِ الْمَرْأَةِ"
    },
    {
      "number": 341,
      "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Mauhib Al Hamdani] dan [Qutaibah bin Sa'id Ats Tsaqafi] bahwa [Al Laits] telah menceritakan kepada mereka dari [Ibnu Syihab] dari [Sa'id bin Al Musayyib] dan [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila cuaca panas sangat menyengat maka tunggulah hingga agak mendingin, karena panas yang menyengat merupakan hembusan api jahannam.\"",
      "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ أَنَّ اللَّيْثَ حَدَّثَهُمْ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنْ الصَّلَاةِ قَالَ ابْنُ مَوْهَبٍ بِالصَّلَاةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ"
    },
    {
      "number": 379,
      "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Al Khuza'i] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ayyub] dari [Abu Qilabah] dari [Anas] dan [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak akan tiba Hari Kiamat sampai manusia bermegah-megahan dalam membangun Masjid.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ وَقَتَادَةُ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يَتَبَاهَى النَّاسُ فِي الْمَسَاجِدِ"
    },
    {
      "number": 380,
      "id": "Telah menceritakan kepada kami [Raja` bin Al Murajja] telah menceritakan kepada kami [Abu Hammam Ad Dallal, Muhammad bin Muhabbab] telah menceritakan kepada kami [Sa'id bin As Sa`ib] dari [Muhammad bin Abdullah bin 'Iyadl] dari [Utsman bin Abu Al Ash] bahwasanya Nabi Shallallahu alaihi wasallam pernah memerintahkannya untuk menjadikan masjid bagi penduduk Thaif di tempat yang dahulunya (untuk menyimpan) patung-patung mereka. ",
      "arab": "حَدَّثَنَا رَجَاءُ بْنُ الْمُرَجَّى حَدَّثَنَا أَبُو هَمَّامٍ الدَّلَّالُ مُحَمَّدُ بْنُ مُحَبَّبٍ حَدَّثَنَا سَعِيدُ بْنُ السَّائِبِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عِيَاضٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يَجْعَلَ مَسْجِدَ الطَّائِفِ حَيْثُ كَانَ طَوَاغِيتُهُمْ"
    },
    {
      "number": 385,
      "id": "Telah menceritakan kepada kami [Muhammad bin Dawud bin Sufyan] telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sulaiman bin Musa] telah menceritakan kepada kami [Ja'far bin Sa'd bin Samurah] telah menceritakan kepadaku [Khubaib bin Sulaiman] dari [Ayahnya, Sulaiman bin Samurah] dari [Ayahnya, Samurah] bahwasanya dia pernah menulis surat kepada anaknya (yang berisi); Amma ba'du, sesungguhnya Rasulullah shallallahu 'alaihi wasallam menyuruh kami untuk mendirikan masjid-masjid di rumah-rumah kami, memperbaiki bangunannya dan membersihkannya. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ سُلَيْمَانَ بْنِ سَمُرَةَ عَنْ أَبِيهِ سَمُرَةَأَنَّهُ كَتَبَ إِلَى ابْنِهِ أَمَّا بَعْدُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا بِالْمَسَاجِدِ أَنْ نَصْنَعَهَا فِي دِيَارِنَا وَنُصْلِحَ صَنْعَتَهَا وَنُطَهِّرَهَا"
    },
    {
      "number": 392,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Bakr bin Mudlar] dari [Amru bin Al Harits] dari [Bukair] dari [Nafi'] bahwasanya [Umar bin Al Khattab] melarang laki-laki untuk masuk masjid nabawi melalui pintu masuk wanita. ",
      "arab": "حَدَّثَنَا قُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرٍ عَنْ نَافِعٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِكَانَ يَنْهَى أَنْ يُدْخَلَ مِنْ بَابِ النِّسَاءِ"
    },
    {
      "number": 401,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dan [Syu'bah] dan [Aban] dari [Qatadah] dari [Anas bin Malik] bahwasanya Nabi shallallahu 'alaihi wasallam bersabda; \"Meludah di Masjid adalah suatu kesalahan dan kafaratnya adalah dengan menutupinya\". ",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ وَشُعْبَةُ وَأَبَانُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ التَّفْلُ فِي الْمَسْجِدِ خَطِيئَةٌ وَكَفَّارَتُهُ أَنْ تُوَارِيَهُ"
    },
    {
      "number": 442,
      "id": "Telah menceritakan kepada kami [Ibrahim bin Mahdi] telah menceritakan kepada kami [Ali bin Mushir] dari [Hisyam bin Urwah] dari [Ayahnya] dari [Aisyah] bahwasanya Rasulullah Shallallahu alaihi wasallam apabila mendengarkan muadzdzin mengucapkan syahadat, beliau mengatakan: \"Saya juga, saya juga\". ",
      "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَهْدِيٍّ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَمِعَ الْمُؤَذِّنَ يَتَشَهَّدُ قَالَ وَأَنَا وَأَنَا"
    },
    {
      "number": 443,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al-Mutsanna] telah menceritakan kepadaku [Muhammad bin Jahdlam] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Umarah bin Ghaziyyah] dari [Habib bin Abdurrahman bin Isaf] dari [Hafsh bin Ashim bin Umar] dari [Ayahnya] dari [Kakeknya, Umar bin Al-Khaththab radliallahu 'anhu] bahwasanya Rasulullah Shallallahu alaihi wasallam bersabda: \"Apabila muadzin mengucapkan Allahu Akbar, Allahu Akbar, maka hendaklah salah seorang dari kalian mengucapkan juga Allahu Akbar, Allahu Akbar, kemudian apabila muadzin mengucapkan Asyhadu alla ilaha illallah, maka hendaklah dia mengucapkan asyhadu alla ilaha illallah. Kemudian Apabila muadzin mengucapkan Asyhadu anna Muhammadarrasulullah, maka hendaklah dia mengucapkan asyhadu anna Muhammadarrasulullah. Kemudian Apabila muadzin mengucapkan hayya 'alashshalah, maka hendaklah dia mengucapkan la haula wala quwwata illa billah. Kemudian Apabila muadzin mengucapkan hayya 'alal falah, maka hendaklah dia mengatakan la haula wala quwwata illa billah. Kemudian Apabila muadizn mengucapkan Allahu akbar Allahu akbar, maka hendaklah dia mengucapkan Allahu Akbar Allahu akbar. Kemudian apabila muadizn mengucapkan la ilaha illallah, maka hendaklah dia mengucapkan la ilaha illallah dari dalam hatinya, niscaya dia akan masuk surga.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي مُحَمَّدُ بْنُ جَهْضَمٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ حَبِيبِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ إِسَافٍ عَنْ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ عَنْ أَبِيهِ عَنْ جَدِّهِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْمُؤَذِّنُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ فَقَالَ أَحَدُكُمْ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ فَإِذَا قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ثُمَّ قَالَ حَيَّ عَلَى الصَّلَاةِ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ ثُمَّ قَالَ حَيَّ عَلَى الْفَلَاحِ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ ثُمَّ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ ثُمَّ قَالَ لَا إِلَهَ إِلَّا اللَّهُ قَالَ لَا إِلَهَ إِلَّا اللَّهُ مِنْ قَلْبِهِ دَخَلَ الْجَنَّةَ"
    },
    {
      "number": 450,
      "id": "Telah menceritakan kepada kami [Muhammad bin Maslamah] telah menceritakan kepada kami [Ibnu Wahb] dari [Yahya bin Abdullah bin Salim bin Abdullah bin Umar] dan [Sa'id bin Abdurrahman] dari [Hisyam bin Urwah] dari [Ayahnya] dari [Aisyah] bahwasanya Ibnu Ummi Maktum adalah seorang muadzdzin Rasulullah Shallallahu alaihi wasallam, padahal dia adalah seorang yang buta. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ ابْنَ أُمِّ مَكْتُومٍ كَانَ مُؤَذِّنًا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ أَعْمَى"
    },
    {
      "number": 478,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'i] telah menceritakan kepada kami [Hammad] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menghalangi kaum wanita itu pergi ke masjid masjid Allah, akan tetapi hendaklah mereka itu pergi tanpa memakai wangi-wangian.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ وَلَكِنْ لِيَخْرُجْنَ وَهُنَّ تَفِلَاتٌ"
    },
    {
      "number": 571,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Aban] dari [Qatadah] dari [Anas bin Malik] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Rapatkan shaf shaf kalian, dekatkanlah jarak antara keduanya, dan sejajarkanlah antara leher-leher. Demi Dzat yang jiwaku berada di TanganNya, sesungguhnya saya melihat setan masuk ke dalam celah celah shaf itu, tak ubahnya bagai anak kambing kecil.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُصُّوا صُفُوفَكُمْ وَقَارِبُوا بَيْنَهَا وَحَاذُوا بِالْأَعْنَاقِ فَوَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَرَى الشَّيْطَانَ يَدْخُلُ مِنْ خَلَلِ الصَّفِّ كَأَنَّهَا الْحَذَفُ"
    },
    {
      "number": 623,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid yaitu Ibnu Zurai'] telah menceritakan kepada kami [Al Mas'udi] telah menceritakan kepadaku [Abdul Jabbar bin Wa'il] telah menceritakan kepadaku [keluargaku] dari [ayahku] bahwa dia menceritakan kepada mereka (ahli baitku) bahwa dia (ayahku) pernah melihat Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya sambil bertakbir.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا الْمَسْعُودِيُّ حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ وَائِلٍ حَدَّثَنِي أَهْلُ بَيْتِي عَنْ أَبِي أَنَّهُ حَدَّثَهُمْأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ مَعَ التَّكْبِيرَةِ"
    },
    {
      "number": 664,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam, Abu Bakar, Umar dan Utsman, mereka semua memulai bacaannya dengan \"ALHAMDULILLAHI RABBIL 'AALAMIN.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ كَانُوا يَفْتَتِحُونَ الْقِرَاءَةَ بِ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ }"
    },
    {
      "number": 721,
      "id": "Telah menceritakan kepada kami [Mu`ammal bin Al Fadl Al Harrani] telah menceritakan kepada kami [Al Walid]. dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Abu Mushir]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu As Sarh] telah menceritakan kepada kami [Bisyr bin Bakr]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Mahmud bin Mush'ab] telah menceritakan kepada kami [Abdullah bin Yusuf] semuanya dari [Sa'id bin Abdul Aziz] dari ['Athiyah bin Qais] dari [Qaza'ah bin Yahya] dari [Abu Sa'id Al Khudri] bahwa ketika Rasulullah shallallahu 'alaihi wasallam mengucapkan; \"Sami'allaahu liman hamidah\" maka beliau melanjutkan dengan \"RABBANAA LAKAL HAMDU MIL`US SAMAA`I -Mu`ammil mengatakan; MIL`US SAMAAWATI- WAMIL`UL ARDLI WAMIL`U MAASYI`TA MIN SYAI`IN BA'DU AHLUTS TSANAA`I WAL MAJDI AHAQQU MAA QAALAL 'ABDU WA KULLANAA MAA QAALAL 'ABDU WA KULLANAA LAKAL 'ABDU LAA MAANI'A LIMAA A'THAITA (Ya Allah Rabb kami, hanya untuk Engkau lah segala pujian sepenuh langit dan bumi dan sepenuh apa saja yang Engkau kehendaki, wahai Allah yang berhak menerima sanjungan dan kehormatan, Ucapan yang paling pantas di ucapkan oleh seorang hamba, dan kami semua adalah hamba-Mu, tak seorang pun yang dapat melarang apa yang telah Engkau berikan).\" -Mahmud menambahkan- WALAA MU'THIYA LIMAA MANA'TA (begitu pula tak seorang pun yang dapat memberikan apa yang Engkau cegah).\" -kemudian riwayat mereka bersambung lagi- WALAA YANFA'U DZAL JADDI MINKAL JADDU (dan sekali-kali tidak bermanfa'at bagi orang yang mempunyai kebesaran, dari Engkau lah kebesaran itu).\" Bisyr mengatakan; \"RABBANAA LAKAL HAMDU (Wahai Rabb kami, bagi-Mu lah segala pujian) \" tidak menyebutkan; \"ALLAHUMMA.\" Begitu juga dalam riwayatnya Mahmud, dia tidak mengatakan; \"ALLAHUMMA\" namun hanya mengatakan; \"RABBANAA WA LAKAL HAMDU.\"",
      "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ حَدَّثَنَا الْوَلِيدُ ح و حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو مُسْهِرٍ ح و حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ كُلُّهُمْ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَطِيَّةَ بْنِ قَيْسٍ عَنْ قَزَعَةَ بْنِ يَحْيَى عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ حِينَ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ قَالَ مُؤَمَّلٌ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ أَهْلَ الثَّنَاءِ وَالْمَجْدِ أَحَقُّ مَا قَالَ الْعَبْدُ وَكُلُّنَا لَكَ عَبْدٌ لَا مَانِعَ لِمَا أَعْطَيْتَ زَادَ مَحْمُودٌ وَلَا مُعْطِيَ لِمَا مَنَعْتَ ثُمَّ اتَّفَقُوا وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ وَقَالَ بِشْرٌ رَبَّنَا لَكَ الْحَمْدُ لَمْ يَقُلْ اللَّهُمَّ لَمْ يَقُلْ مَحْمُودٌ اللَّهُمَّ قَالَ رَبَّنَا وَلَكَ الْحَمْدُ"
    },
    {
      "number": 749,
      "id": "Telah menceritakan kepada kami [Zuhair bin harb] telah menceritakan kepada kami [Waki'] dari [Isra'il] dari [Abu Ishaq] dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa apabila Nabi shallallahu 'alaihi wasallam membaca; \"Sabbihisma rabbikal a'la.\" Maka beliau mengucapkan; \"Subhaana rabbiyal a'la (Maha suci Rabbku yang Maha tinggi.\" Abu Daud mengatakan; riwayat Waki' di perselisihkan dalam hadits ini, hadits ini juga di riwayatkan oleh [Abu Waki'] dan [Syu'bah] dari [Abu Ishaq] dari [Sa'id bin Jubair] dari [Ibnu Abbas] secara mauquf. ",
      "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَرَأَ{ سَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى }قَالَ سُبْحَانَ رَبِّيَ الْأَعْلَىقَالَ أَبُو دَاوُد خُولِفَ وَكِيعٌ فِي هَذَا الْحَدِيثِ وَرَوَاهُ أَبُو وَكِيعٍ وَشُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ مَوْقُوفًا"
    },
    {
      "number": 884,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Ibnu 'Amru yaitu Ibnu Al Harits] bahwa [Al Julah bekas budak Abdul Aziz] telah menceritakan kepadanya, bahwa [Abu Salamah yaitu Ibnu Abdurrahman] telah menceritakan kepadanya, dari [Jabir bin Abdullah] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda; \"Hari jum'at itu dua belas -maksudnya jam- dan tidak di dapati seorang muslim pun yang meminta kepada Allah kecuali Allah 'azza wajalla akan mengabulkannya, maka bersegeralah untuk mendapatkannya pada waktu-waktu akhir setelah Ashar.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو يَعْنِي ابْنَ الْحَارِثِ أَنَّ الْجُلَاحَ مَوْلَى عَبْدِ الْعَزِيزِ حَدَّثَهُ أَنَّ أَبَا سَلَمَةَ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ يَوْمُ الْجُمُعَةِ ثِنْتَا عَشْرَةَ يُرِيدُ سَاعَةً لَا يُوجَدُ مُسْلِمٌ يَسْأَلُ اللَّهَ عَزَّ وَجَلَّ شَيْئًا إِلَّا أَتَاهُ اللَّهُ عَزَّ وَجَلَّ فَالْتَمِسُوهَا آخِرَ سَاعَةٍ بَعْدَ الْعَصْرِ"
    },
    {
      "number": 889,
      "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Qudamah bin Wabarah Al 'Ujaifi] dari [Samurah bin Jundab] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggalkan Jum'at tanpa ada udzur (syar'i) hendaknya ia bersedekah satu Dinar, apabila ia tidak mendapati (satu Dinar), maka dengan setengah Dinar.\" Abu Daud mengatakan; \"Demikianlah yang di riwayatkan Khalid bin Qais, ia menyelisihinya dalam isnad, namun sepakat pada matan-nya.\"",
      "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ قُدَامَةَ بْنِ وَبَرَةَ الْعُجَيْفِيِّ عَنْ سَمُرَةَ بْنِ جُنْدُبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ فَلْيَتَصَدَّقْ بِدِينَارٍ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍقَالَ أَبُو دَاوُد وَهَكَذَا رَوَاهُ خَالِدُ بْنُ قَيْسٍ وَخَالَفَهُ فِي الْإِسْنَادِ وَوَافَقَهُ فِي الْمَتْنِ"
    },
    {
      "number": 925,
      "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu 'Ashim] telah menceritakan kepada kami ['Imran] dari [Qatadah] dari ['Abd Rabbihi] dari [Abu 'Iyadl] dari [Ibnu Mas'ud] bahwa apabila Rasulullah shallallahu 'alaihi wasallam bertasyahhud (memulai khutbahnya), beliau mengucapkan: \"ALHAMDULILLAH NASTA'IINUHU WANASTAGHFIRUHU WANA'UDZU BILLAHI MIN SYURURI ANFUSINA MAN YAHDIHILLAHU FALA MUDHILLA LAHU WAMAN YUDHLIL FALA HADIYA LAHU. WAASYHADU ALLA ILAAHA ILLALLAH WAASYHADU ANNA MUHAMMADAN ABDUHU WA RASULUHU ARSALAHU BIL HUDA, BASYIRAW WANADZIRAN BAINA YADAYISSA'AH MAN YUTHI'ILLAHA WARASULAHU FAQAD RASYAD WAMAN YA'SHIHIMA FAINNAHU LA YADHURRU ILLA NAFSAHUWALA YADHURRU-LLAHA SYAIAN (segala puji bagi Allah, kita memohon ampun kepada-Nya dan memohon pertolongan kepada-Nya dan berlindung kepada Allah dari kejahatan-kejahatan diri kita, barang siapa yang di beri petunjuk oleh Allah, maka tidak ada seorangpun yang dapat menyesatkannya dan barangsiapa di sesatkan-Nya, maka tidak ada seorangpun yang dapat memberikannya petunjuk. Aku bersaksi bahwa tidak ada ilah yang berhak disembah kecuali Allah dan aku bersaksi bahwa Muhammad adalah hamba dan rasul-Nya yang diutus dengan kebenaran sebagai pamberi kabar gembira dan sekaligus pemberi peringatan sebelum datangnya hari Kiamat. Barangsiapa menaati Allah dan rasul-Nya, maka dia telah mendapatkan petunjuk dan barangsiapa bermaksiat kepada keduanya, maka sesungguhnya dia tidaklah mencelakakan kecuali dirinya sendiri dan Allah tidak rugi sedikitpun).\" Telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah mengabarkan kepadaku [Ibnu Wahb] dari [Yunus] bahwa dia bertanya kepada [Ibnu Syihab] tentang tasyahhudnya Rasulullah shallallahu 'alaihi wasallam pada khutbah Jum'at, maka dia menyebutkan seperti diatas dengan tambahan; \"WAMAN YA'SHIHIMA FAQAD GHAWA WANAS'ALULLAHA RABBANA AN YAJ'ALANA MIMMAN YUTHI'UHU WA YUTHI'I RASULAHU WA YATTABI' RIDHWANAHU WA YAJTANIB SAKHATHAHU FAINNAMA NAHNU BIHI WA LAHU\" (Dan barangsiapa bermaksiat kepada keduanya, maka dia telah tersesat, kami memohon kepada Allah Rabb kami agar menjadikan kami termasuk orang-orang yang taat kepada-Nya dan taat kepada rasul-Nya dan termasuk orang yang mengikuti keridhaan-Nya serta menjauhi kamurkaan-Nya, sesungguhnya kami adalah orang-orang yang selalu merindukan keridhaan-Nya dan menjauhi kamurkaan-Nya).\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا عِمْرَانُ عَنْ قَتَادَةَ عَنْ عَبْدِ رَبِّهِ عَنْ أَبِي عِيَاضٍ عَنْ ابْنِ مَسْعُودٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا تَشَهَّدَ قَالَ الْحَمْدُ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا مِنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَرْسَلَهُ بِالْحَقِّ بَشِيرًا وَنَذِيرًا بَيْنَ يَدَيْ السَّاعَةِ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَإِنَّهُ لَا يَضُرُّ إِلَّا نَفْسَهُ وَلَا يَضُرُّ اللَّهَ شَيْئًاحَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ تَشَهُّدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ فَذَكَرَ نَحْوَهُ قَالَ وَمَنْ يَعْصِهِمَا فَقَدْ غَوَى وَنَسْأَلُ اللَّهَ رَبَّنَا أَنْ يَجْعَلَنَا مِمَّنْ يُطِيعُهُ وَيُطِيعُ رَسُولَهُ وَيَتَّبِعُ رِضْوَانَهُ وَيَجْتَنِبُ سَخَطَهُ فَإِنَّمَا نَحْنُ بِهِ وَلَهُ"
    },
    {
      "number": 926,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan bin Sa'id] telah menceritakan kepadaku [Abdul Aziz bin Rufai'] dari [Tamim Ath Tha`i] dari ['Adi bin Hatim] bahwa seprang Khatib menyampaikan khutbahnya di samping Nabi shallallahu 'alaihi wasallam, katanya; \"Barangsiapa mena'ati Allah dan Rasul-Nya, sungguh ia akan memperoleh petunjuk. Dan barangsiapa bermaksiat kepada keduanya, (maka telah tersesat).\" Maka beliau bersabda: \"Berdirilah dan pergi, kamu adalah seburuk-buruk Khatib.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ بْنِ سَعِيدٍ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ عَنْ تَمِيمٍ الطَّائِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّ خَطِيبًا خَطَبَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَقَالَ قُمْ أَوْ اذْهَبْ بِئْسَ الْخَطِيبُ أَنْتَ"
    },
    {
      "number": 948,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Dlamrah bin Sa'id Al Mazini] dari ['Ubaidullah bin Abdullah bin 'Utbah] bahwa Dlahhak bin Qais bertanya kepada [Nu'man bin Basyir]; \"Surat apakah yang biasa di baca Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at setelah surat Al Jum'ah?\" dia menjawab; \"Beliau biasa membaca dengan; \"Hal ataaka hadiitsul Ghaasyiyah.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَأَنَّ الضَّحَّاكَ بْنَ قَيْسٍ سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ مَاذَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ فَقَالَ كَانَ يَقْرَأُ بِهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ"
    },
    {
      "number": 987,
      "id": "Telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah mengabarkan kepada kami [Ibnu wahb] dari [Haiwah] dan [Umar bin Malik] dari [Ibnul Had] dari [Muhammad bin Ibrahim] dari ['Umair bekas budak Bani Abu Lahm] bahwa dia melihat Nabi shallallahu 'alaihi wasallam memohon supaya di turunkannya hujan di Ahjaruz Zait dekat Zaura` dengan berdiri sambil berdo'a memohon diturunkannya hujan seraya mengangkat kedua tangannya ke depan dan tidak melebihi kepalanya.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ حَيْوَةَ وَعُمَرَ بْنِ مَالِكٍ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عُمَيْرٍ مَوْلَى بَنِي آبِي اللَّحْمِأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَسْقِي عِنْدَ أَحْجَارِ الزَّيْتِ قَرِيبًا مِنْ الزَّوْرَاءِ قَائِمًا يَدْعُو يَسْتَسْقِي رَافِعًا يَدَيْهِ قِبَلَ وَجْهِهِ لَا يُجَاوِزُ بِهِمَا رَأْسَهُ"
    },
    {
      "number": 989,
      "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam tidak pernah mengangkat kedua tangannya ketika berdo'a kecuali ketika meminta hujan, ketika itu beliau mengangkat kedua tangan beliau sehingga terlihat putih ketiaknya.\"",
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ الدُّعَاءِ إِلَّا فِي الِاسْتِسْقَاءِ فَإِنَّهُ كَانَ يَرْفَعُ يَدَيْهِ حَتَّى يُرَى بَيَاضُ إِبِطَيْهِ"
    },
    {
      "number": 990,
      "id": "Telah menceritakan kepada kami [Al Hasan bin Muhammad Az Za'farani] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam meminta hujan dengan begini maksudnya beliau memanjangkan kedua tangannya dengan menjadikan punggung telapak tangannya menghadap ke arah bumi, sehingga aku melihat putih ketiaknya.\"",
      "arab": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَسْقِي هَكَذَا يَعْنِي وَمَدَّ يَدَيْهِ وَجَعَلَ بُطُونَهُمَا مِمَّا يَلِي الْأَرْضَ حَتَّى رَأَيْتُ بَيَاضَ إِبِطَيْهِ"
    },
    {
      "number": 991,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari ['Abdi Rabbihi bin Sa'id] dari [Muhammad bin Ibrahim] telah mengabarkan kepadaku [seorang yang pernah melihat Nabi shallallahu 'alaihi wasallam] bahwa beliau pernah berdo'a dekat Ahjaariz Zait sambil membentangkan kedua telapak tangan beliau.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ أَخْبَرَنِي مَنْرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو عِنْدَ أَحْجَارِ الزَّيْتِ بَاسِطًا كَفَّيْهِ"
    },
    {
      "number": 1006,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Hisyam bin 'Urwah] dari ['Urwah] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Terjadinya gerhana Matahari dan bulan bukanlah karena mati atau hidupnya salah seorang, apabila kalian melihat hal itu, maka berdo'alah kepada Allah 'azza wajalla, bertakbirlah serta perbanyak sedekah.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشَّمْسُ وَالْقَمَرُ لَا يُخْسَفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَادْعُوا اللَّهَ عَزَّ وَجَلَّ وَكَبِّرُوا وَتَصَدَّقُوا"
    },
    {
      "number": 1069,
      "id": "Telah menceritakan kepada kami [Muhammad bin As Shabbah bin Sufyan] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Utsman bin Umar yaitu Ibnu Musa] dari [Abu Al Ghaits] dari [Abu Hurairah] bahwa dia mendengar Nabi shallallahu 'alaihi wasallam membaca dalam dua raka'at fajar dengan; \"Katakanlah: \"Kami beriman kepada Allah dan kepada apa yang diturunkan kepada kami…\" QS Ali Imran; 84, ayat ini beliau baca di raka'at pertama, sedangkan di raka'at kedua, beliau membaca dengan ayat ini; \"Ya Tuhan kami, kami Telah beriman kepada apa yang Telah Engkau turunkan dan Telah kami ikuti rasul, Karena itu masukanlah kami ke dalam golongan orang-orang yang menjadi saksi (tentang keesaan Allah) \" (QS Ali Imran; 53) atau membaca; \"Sesungguhnya kami Telah mengutusmu (Muhammad) dengan kebenaran; sebagai pembawa berita gembira dan pemberi peringatan, dan kamu tidak akan diminta (pertanggungan jawab) tentang penghuni-penghuni neraka Jahannam.\" (QS Al Baqarah; 119) -Ad Darawardi ragu mengenai redaksi hadits ini-.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عُمَرَ يَعْنِي ابْنَ مُوسَى عَنْ أَبِي الْغَيْثِ عَنْ أَبِي هُرَيْرَةَأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي رَكْعَتَيْ الْفَجْرِ{ قُلْ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ عَلَيْنَا }فِي الرَّكْعَةِ الْأُولَى وَفِي الرَّكْعَةِ الْأُخْرَى بِهَذِهِ الْآيَةِ{ رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ }أَوْ{ إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ }شَكَّ الدَّارَوَرْدِيُّ"
    },
    {
      "number": 1120,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dan dari [Abdullah Al Agharru] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb kita Tabaraka wa Ta'ala turun di setiap malamnya ke langit dunia pada sepertiga malam terakhir, lalu Dia berfirman: \"barangsiapa berdo'a kepada-Ku, niscaya Aku kabulkan, barangsiapa memohon kepada-Ku, niscaya Aku akan memberinya, barangsiapa memohon ampunan kepada-Ku, niscaya Aku akan mengampuninya.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَعَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى سَمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ"
    },
    {
      "number": 1161,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Sa'id Al Maqburi] dari [Abu Salamah] dari [Aisyah] radliallahu 'anha bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kerjakanlah suatu amalan itu sesuai dengan kemampuan kalian, karena Allah tidak akan bosan sehingga diri kalianlah yang bosan, sesungguhnya amalan yang paling di cintai Allah adalah yang di kerjakan secara terus menerus walaupun sedikit.\" apabila beliau mengerjakan suatu amalan, beliau akan mengerjakannya secara rutin.\"",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اكْلَفُوا مِنْ الْعَمَلِ مَا تُطِيقُونَ فَإِنَّ اللَّهَ لَا يَمَلُّ حَتَّى تَمَلُّوا وَإِنَّ أَحَبَّ الْعَمَلِ إِلَى اللَّهِ أَدْوَمُهُ وَإِنْ قَلَّ وَكَانَ إِذَا عَمِلَ عَمَلًا أَثْبَتَهُ"
    },
    {
      "number": 1173,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah mengabarkan kepada kami [Ayyub] dari ['Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Carilah lailatul qadar pada sepuluh terakhir bulan Ramadlan, sembilan tersisa, tujuh tersisa atau lima tersisa.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ أَخْبَرَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ فِي تَاسِعَةٍ تَبْقَى وَفِي سَابِعَةٍ تَبْقَى وَفِي خَامِسَةٍ تَبْقَى"
    },
    {
      "number": 1178,
      "id": "Telah menceritakan kepada kami ['Ubaidullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] bahwa dia mendengar [Muttharif] dari [Mu'awiyah bin Abu Sufyan] dari Nabi shallallahu 'alaihi wasallam mengenai lailatul qadr, beliau bersabda: \"Lailatul qadr adalah malam ke dua puluh tujuh.\"",
      "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ أَنَّهُ سَمِعَ مُطَرِّفًا عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي لَيْلَةِ الْقَدْرِ قَالَ لَيْلَةُ الْقَدْرِ لَيْلَةُ سَبْعٍ وَعِشْرِينَ"
    },
    {
      "number": 1187,
      "id": "Telah menceritakan kepada kami [Nuh bin Habib] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Simak bin Al Fadl] dari [Wahb bin Munabbih] dari [Abdullah bin 'Amru] bahwa dia bertanya kepada Nabi shallallahu 'alaihi wasallam; \"Berapa lamakah Al Qur'an di baca (hingga khatam)?\" beliau bersabda: \"Dalam jangka waktu empat puluh hari.\" Kemudian beliau bersabda: \"Dalam jangka waktu sebulan.\" Kemudian beliau bersabda: \"Dalam jangka waktu dua puluh hari.\" Kemudian beliau bersabda: \"Dalam jangka waktu lima belas hari.\" Kemudian beliau bersabda: \"Dalam jangka waktu sepuluh hari.\" Kemudian beliau bersabda: \"Dalam jangka waktu tujuh hari, dan tidak kurang dari tujuh hari.\"",
      "arab": "حَدَّثَنَا نُوحُ بْنُ حَبِيبٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ سِمَاكِ بْنِ الْفَضْلِ عَنْ وَهْبِ بْنِ مُنَبِّهٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كَمْ يُقْرَأُ الْقُرْآنُ قَالَ فِي أَرْبَعِينَ يَوْمًا ثُمَّ قَالَ فِي شَهْرٍ ثُمَّ قَالَ فِي عِشْرِينَ ثُمَّ قَالَ فِي خَمْسَ عَشْرَةَ ثُمَّ قَالَ فِي عَشْرٍ ثُمَّ قَالَ فِي سَبْعٍ لَمْ يَنْزِلْ مِنْ سَبْعٍ"
    },
    {
      "number": 1192,
      "id": "Telah menceritakan kepada kami ['Amru bin Marzuq] telah mengabarkan kepada kami [Syu'bah] telah mengabarkan kepada kami [Qatadah] dari ['Abbas Al Jusyami] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: 'Ada suatu surat dari al qur'an yang terdiri dari tiga puluh ayat dan dapat memberi syafa'at bagi yang membacanya, sampai dia di ampuni, yaitu; \"Tabaarakalladzii biyadihil mulku…\"",
      "arab": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ أَخْبَرَنَا قَتَادَةُ عَنْ عَبَّاسٍ الْجُشَمِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سُورَةٌ مِنْ الْقُرْآنِ ثَلَاثُونَ آيَةً تَشْفَعُ لِصَاحِبِهَا حَتَّى يُغْفَرَ لَهُ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ"
    },
    {
      "number": 1233,
      "id": "Telah menceritakan kepada Kami [Abu Al Walid Ath Thayalisi], telah menceritakan kepada Kami [Hammad bin Salamah] dari [Anas bin Sirin] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam melakukan qunut selama satu bulan kemudian beliau meninggalkannya. ",
      "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ شَهْرًا ثُمَّ تَرَكَهُ"
    },
    {
      "number": 1240,
      "id": "Telah menceritakan kepada Kami [Hafsh bin Umar] telah menceritakan kepada Kami [Syu'bah] dari ['Alqamah bin Martsad] dari [Sa'd bin 'Ubaidah] dari [Abu Abdurrahman] dari [Utsman] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik kalian adalah orang yang mempelajari Al Qur'an dan mengajarkannya.\"",
      "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عُثْمَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ"
    },
    {
      "number": 1241,
      "id": "Telah menceritakan kepada Kami [Ahmad bin 'Amr bin As Sarh] telah mengabarkan kepada Kami [Ibnu Wahb] telah mengabarkan kepada Kami [Yahya bin Ayyub] dari [Zabban bin Faid] dari [Sahl bin Muadz Al Juhani] dari [ayahnya] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barangsiapa yang membaca AlQur'an dan melaksanakan apa yang terkandung di dalamnya, maka kedua orang tuanya pada hari kiamat nanti akan dipakaikan mahkota yang sinarnya lebih terang dari pada sinar matahari di dalam rumah-rumah didunia, jika matahari tersebut ada diantara kalian, maka bagaimana perkiraan kalian dengan orang yang melaksanakan isi Al Qur'an?\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ زَبَّانِ بْنِ فَائِدٍ عَنْ سَهْلِ بْنِ مُعَاذٍ الْجُهَنِيِّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَرَأَ الْقُرْآنَ وَعَمِلَ بِمَا فِيهِ أُلْبِسَ وَالِدَاهُ تَاجًا يَوْمَ الْقِيَامَةِ ضَوْءُهُ أَحْسَنُ مِنْ ضَوْءِ الشَّمْسِ فِي بُيُوتِ الدُّنْيَا لَوْ كَانَتْ فِيكُمْ فَمَا ظَنُّكُمْ بِالَّذِي عَمِلَ بِهَذَا"
    },
    {
      "number": 1242,
      "id": "Telah menceritakan kepada Kami [Muslim bin Ibrahim], telah menceritakan kepada Kami [Hisyam] dan [Hammam] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Orang yang membaca Al Qur'an dan ia pandai membacanya maka ia bersama para malaikat yang mulia, dan orang yang membaca Al Qur'an sedangkan ia mengalami kesulitan dalam membacanya maka baginya dua pahala.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ وَهَمَّامٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِي يَقْرَأُ الْقُرْآنَ وَهُوَ مَاهِرٌ بِهِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَؤُهُ وَهُوَ يَشْتَدُّ عَلَيْهِ فَلَهُ أَجْرَانِ"
    },
    {
      "number": 1243,
      "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah] telah menceritakan kepada Kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidaklah sebuah kaum berkumpul di dalam rumah diantara rumah-rumah Allah ta'ala, membaca kitab Allah, dan saling mempelajarinya diantara mereka melainkan akan turun kepada mereka ketenangan, mereka diliputi rahmat, serta dikelilingi malaikat, dan Allah menyebut-nyebut mereka diantara malaikat yang ada di sisiNya.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ تَعَالَى يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلَّا نَزَلَتْ عَلَيْهِمْ السَّكِينَةُ وَغَشِيَتْهُمْ الرَّحْمَةُ وَحَفَّتْهُمْ الْمَلَائِكَةُ وَذَكَرَهُمْ اللَّهُ فِيمَنْ عِنْدَهُ"
    },
    {
      "number": 1249,
      "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Abdurrahman bin Abdullah bin Abdurrahman] dari [Ayahnya] dari [Abu Sa'id Al Khudri] bahwa seorang laki-laki mendengar orang lain membaca; QUL HUWALLAAHU AHAD, ia mengulang-ulangnya. Kemudian tatkala pagi hari ia datang kepada Rasulullah shallAllahu wa'alaihi wa sallam dan menyebutkannya kepada beliau, seolah-olah orang tersebut menganggapnya sedikit. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku ada di tangannya, sesungguhnya ayat tersebut sama dengan sepertiga Al Qur'an.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَجُلًا سَمِعَ رَجُلًا يَقْرَأُ قُلْ هُوَ اللَّهُ أَحَدٌ يُرَدِّدُهَا فَلَمَّا أَصْبَحَ جَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ لَهُ وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ"
    },
    {
      "number": 1259,
      "id": "Telah menceritakan kepada Kami [Sulaiman bin Daud Al Mahri], telah mengabarkan kepada Kami [Ibnu Wahb], telah menceritakan kepadaku [Umar bin Malik] serta [Haiwah] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim bin Al Harits] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidaklah Allah memberikan izin untuk melakukan sesuatu sebagaimana Allah memberikan izin kepada seorang nabi yang indah suaranya memperindah bacaan Al Qur'an, dan mengeraskannya.\"",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي عُمَرُ بْنُ مَالِكٍ وَحَيْوَةُ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ حَسَنِ الصَّوْتِ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ"
    },
    {
      "number": 1306,
      "id": "Telah menceritakan kepada Kami [Muhammad bin Rafi'], telah menceritakan kepada Kami [Abu Al Husain Zaid bin Al Hubab], telah menceritakan kepada Kami [Abdurrahman bin Syuraih Al Iskandarani], telah menceritakan kepadaku [Abu Hani` Al Khaulani] bahwa ia mendengar [Abu Ali Al Hanbi] bahwa ia mendengar [Abu Sa'id Alkhudri] radliallahu 'anhu mengatakan bahwa Rasulullah shallla Allahu 'alaihi wa sallam bersabda: \"Barangsiapa yang mengatakan; RADHIITU BILLAAHI RABBAN WA BIL-ISLAAMI DIINAN WA BIMUHAMMADIN RASUULAN (Aku ridha Allah sebagai Tuhanku, Islam sebagai agamaku dan Muhammad sebagai rasul), maka wajib baginya untuk masuk Surga. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو الْحُسَيْنِ زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شُرَيْحٍ الْإِسْكَنْدَرَانِيُّ حَدَّثَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ أَنَّهُ سَمِعَ أَبَا عَلِيٍّ الْجَنْبِيَّ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا وَجَبَتْ لَهُ الْجَنَّةُ"
    },
    {
      "number": 1312,
      "id": "Telah menceritakan kepada Kami [Ahmad bin 'Amru bin As Sarh], telah menceritakan kepada Kami [Ibnu Wahb], telah menceritakan kepadaku [Abdurrahman bin Ziyad] dari [Abu Abdurrahman] dari [Abdullah bin 'Amr bin Al 'Ash] bahwa Rasulullah shallla Allahu 'alaihi wa sallam bersabda: \"Sesungguhnya do'a yang paling cepat dikabulkan adalah do'a orang yang ghaib (tidak hadir) untuk saudaranya yang tidak hadir.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَسْرَعَ الدُّعَاءِ إِجَابَةً دَعْوَةُ غَائِبٍ لِغَائِبٍ"
    },
    {
      "number": 1320,
      "id": "Telah menceritakan kepada Kami [Musa bin Ismail], telah menceritakan kepada Kami [Hammad], telah mengabarkan kepada Kami [Ishaq bin Abdullah] dari [Sa'id? bin Yasar] dari [Abu Hurairah] rhadhiyAllahu 'anhu bahwa Nabi shallallahu 'alaihi wasallam pernah mengucapkan: \"ALLAAHUMMA INNII A'UUDZU BIKA MINAL FAQRI WALQILLATI WADZ DZILLATI, WA A'UUDZU BIKA MIN AN AZHLIMA AU UZHLAMA\" (Ya Allah aku berlindung kepada-Mu dari kafakiran, kekurangan dan kehinaan dan aku berlindung kepada-Mu dari aku berbuat dzalim atau didzalimi). ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ"
    },
    {
      "number": 1329,
      "id": "Telah menceritakan kepada Kami [Musa bin Ismail], telah menceritakan kepada Kami [Hammad], telah mengabarkan kepada Kami [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam mengucapkan: \"ALLAAHUMMA INNII A'UUDZU BIKA MINAL BARASHI WAL JUNUUNI WAL JUDZAAMI WA MIN SAYYI-IL ASQAAM\" (Ya Allah, aku berlindung kepadaMu dari kusta, gila, lepra, dan dari penyakit yang buruk). ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا قَتَادَةُ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ وَمِنْ سَيِّئْ الْأَسْقَامِ"
    },
    {
      "number": 1401,
      "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari ['Atho` bin Yazid Al Laitsi] dari [Abu Sa'id Al Khudri] bahwa beberapa orang Anshar meminta kepada Rasulullah, lalu beliau memberi mereka. Kemudian mereka meminta lagi kepadanya, lalu beliau beliau memberi mereka hingga habis apa yang beliau miliki. Beliau bersabda: \"Kebaikan (harta) yang ada padaku tidak akan aku simpan dari kalian. Dan barang siapa yang menjaga kehormatan dirinya maka Allah Azza wa Jalla akan menjaga kehormatannya, dan barang siapa yang bersabar maka Allah akan menjadikannya bersabar. Tidaklah seseorang diberi suatu pemberian yang lebih baik dan lebih luas daripada kesabaran.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ نَاسًا مِنْ الْأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَاهُمْ ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ حَتَّى إِذَا نَفَدَ مَا عِنْدَهُ قَالَ مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اللَّهُ وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ وَمَا أَعْطَى اللَّهُ أَحَدًا مِنْ عَطَاءٍ أَوْسَعَ مِنْ الصَّبْرِ"
    },
    {
      "number": 1445,
      "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Sufyan] dari [Az Zuhri] dari [Muhammad bin Jubair bin Muth'im] dari [ayahnya] ia membawanya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak akan masuk Surga orang yang memutuskan hubungan kekerabatan.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ قَاطِعُ رَحِمٍ"
    },
    {
      "number": 1457,
      "id": "Telah menceritakan kepada Kami [Al Haitsam bin Khalid Al Juhani], telah menceritakan kepada Kami [Waki'] dari [Sa'd bin Aus] dari [Bilal bin Yahya Al 'Absi] dari [Ali Bin Abu Thalib radliallahu 'anhu] bahwa ia menemukan uang satu dinar lalu dia menggunakannya untuk membeli tepung, pedagang tepung mengetahuinya, kemudian ia mengembalikan uang dinar tersebut kepadanya dan Ali pun mengambilnya lalu dia memotongn sebagian darinya dua kirath lalu ia gunakan untuk membeli daging. ",
      "arab": "حَدَّثَنَا الْهَيْثَمُ بْنُ خَالِدٍ الْجُهَنِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سَعْدِ بْنِ أَوْسٍ عَنْ بِلَالِ بْنِ يَحْيَى الْعَبْسِيِّ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُأَنَّهُ الْتَقَطَ دِينَارًا فَاشْتَرَى بِهِ دَقِيقًا فَعَرَفَهُ صَاحِبُ الدَّقِيقِ فَرَدَّ عَلَيْهِ الدِّينَارَ فَأَخَذَهُ عَلِيٌّ وَقَطَعَ مِنْهُ قِيرَاطَيْنِ فَاشْتَرَى بِهِ لَحْمًا"
    },
    {
      "number": 1468,
      "id": "Telah menceritakan kepada Kami [Nashr bin Ali], telah menceritakan kepada Kami [Abu Ahmad], telah menceritakan kepada Kami [Sufyan] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma bahwa ia membonceng budak wanitanya yang bernama Shafiyyah ketika bepergian ke Mekkah.",
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ يُرْدِفُ مَوْلَاةً لَهُ يُقَالُ لَهَا صَفِيَّةُ تُسَافِرُ مَعَهُ إِلَى مَكَّةَ"
    },
    {
      "number": 1477,
      "id": "Telah menceritakan kepada Kami [Hisyam bin Bahram Al Madaini], telah menceritakan kepada Kami [Al Mu'afi bin 'Imran] dari [Aflah yaitu Ibnu Humaid] dari [Al Qasim bin Muhammad] dari [Aisyah] radliallahu 'anha bahwa Rasulullah shallla Allahu 'alaihi wa sallam menetapkan Dzatu 'Irq sebagai miqat bagi penduduk Irak. ",
      "arab": "حَدَّثَنَا هِشَامُ بْنُ بَهْرَامَ الْمَدَائِنِيُّ حَدَّثَنَا الْمُعَافِىُّ بْنُ عِمْرَانَ عَنْ أَفْلَحَ يَعْنِي ابْنَ حُمَيْدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِأَهْلِ الْعِرَاقِ ذَاتَ عِرْقٍ"
    },
    {
      "number": 1486,
      "id": "Telah menceritakan kepada Kami ['Ubaidullah bin Umar], telah menceritakan kepada Kami [Abdul A'la], telah menceritakan kepada Kami [Muhammad bin Ishaq] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam mencelup rambut kepalanya menggunakan madu. ",
      "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّدَ رَأْسَهُ بِالْعَسَلِ"
    },
    {
      "number": 1492,
      "id": "Telah menceritakan kepada Kami [Hannad] telah menceritakan kepada Kami [Waki'] dari [Sufyan] dari [Manshur] dan [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam berkurban dengan kambing yang telah digantungi kalung. ",
      "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ وَالْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْدَى غَنَمًا مُقَلَّدَةً"
    },
    {
      "number": 1548,
      "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Abdullah bin Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari [Abdul Malik bin Abu Bakr bin Abdurrahman bin Al Haritsb Hisyam] dari [Khallad bin As Saib Al Anshari] dari [ayahnya] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Jibril shallallahu 'alaihi wasallam telah datang kepadaku dan memerintahkanku agar memerintahkan para sahabatku dan orang-orang yang bersamanya agar mengeraskan suara mereka ketika bertahlil atau beliau mengatakan dengan talbiyah.\" Beliau menginginkan salah satu darinya. ",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ خَلَّادِ بْنِ السَّائِبِ الْأَنْصَارِيِّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَانِي جِبْرِيلُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَنِي أَنْ آمُرَ أَصْحَابِي وَمَنْ مَعِي أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالْإِهْلَالِ أَوْ قَالَ بِالتَّلْبِيَةِ يُرِيدُ أَحَدَهُمَا"
    },
    {
      "number": 1579,
      "id": "Telah menceritakan kepada Kami [Muhammad bin Isa] telah menceritakan kepada Kami [Hammad] dari [Maimun bin Jaban] dari [Abu Rafi'] dari [Abu Hurairah] dari Nabi shalla Allahu 'alaihi wa sallam, beliau bersabda: belalang adalah termasuk binatang buruan laut. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَمَّادٌ عَنْ مَيْمُونِ بْنِ جَابَانَ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجَرَادُ مِنْ صَيْدِ الْبَحْرِ"
    },
    {
      "number": 1585,
      "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Al Laits] dari [Nafi'] bahwa [seorang laki-laki anshar] telah mengabarkan kepadanya dari [Ka'b bin 'Ujrah] dan ia telah tertimpa sesuatu yang mengganggu. Kemudian Nabi shallallahu 'alaihi wasallam memerintahkannya agar menyembelih hewan kurban sapi. ",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ أَخْبَرَهُ عَنْ كَعْبِ بْنِ عُجْرَةَوَكَانَ قَدْ أَصَابَهُ فِي رَأْسِهِ أَذًى فَحَلَقَ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُهْدِيَ هَدْيًا بَقَرَةً"
    },
    {
      "number": 1589,
      "id": "Telah menceritakan kepada Kami [Muhammad bin 'Ubaid], telah menceritakan kepada Kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] apabila datang ke Mekkah, beliau bermalam di Dzu Thuwa hingga pagi, dan beliau mandi kemudian masuk Mekkah pada siang hari, dan ia menyebutkan dari Nabi shallallahu 'alaihi wasallam bahwa beliau telah melakukannya. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ إِذَا قَدِمَ مَكَّةَ بَاتَ بِذِي طَوًى حَتَّى يُصْبِحَ وَيَغْتَسِلَ ثُمَّ يَدْخُلَ مَكَّةَ نَهَارًا وَيَذْكُرُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَعَلَهُ"
    },
    {
      "number": 1590,
      "id": "Telah menceritakan kepada Kami [Abdullah bin Ja'far Al Barmaki], telah menceritakan kepada Kami [Ma'n] dari [Malik], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Musaddad] dan [Ibnu Hanbal] dari [Yahya]. Telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Abu Usamah] semuanya dari ['Ubaidullah], dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam memasuki Mekkah, dari Kada` dari Tsaniyah Al Bathha`, dan beliau keluar dari Tsaniyah yang rendah. Al Barmaki menambahkan yaitu dua Tsaniyah yang ada di Mekkah. Dan hadits Musaddad lebih sempurna. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْبَرْمَكِيُّ حَدَّثَنَا مَعِنٌ عَنْ مَالِكٍ ح و حَدَّثَنَا مُسَدَّدٌ وَابْنُ حَنْبَلٍ عَنْ يَحْيَى ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ جَمِيعًا عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْخُلُ مَكَّةَ مِنْ الثَّنِيَّةِ الْعُلْيَا قَالَا عَنْ يَحْيَى إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْخُلُ مَكَّةَ مِنْ كَدَاءَ مِنْ ثَنِيَّةِ الْبَطْحَاءِ وَيَخْرُجُ مِنْ الثَّنِيَّةِ السُّفْلَى زَادَ الْبَرْمَكِيُّ يَعْنِي ثَنِيَّتَيْ مَكَّةَوَحَدِيثُ مُسَدَّدٍ أَتَمُّ"
    },
    {
      "number": 1593,
      "id": "Telah menceritakan kepada Kami [Ibnu Al Mutsanna], telah menceritakan kepada Kami [Sufyan bin 'Uyainah] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam apabila masuk Mekkah, beliau memasuki dari bagian Mekkah yang paling atas, dan keluar dari paling bawah. ",
      "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ مَكَّةَ دَخَلَ مِنْ أَعْلَاهَا وَخَرَجَ مِنْ أَسْفَلِهَا"
    },
    {
      "number": 1615,
      "id": "Telah menceritakan kepada Kami [Abu Kamil], telah menceritakan kepada Kami [Sulaim bin Akhdhar], telah menceritakan kepada Kami ['Ubaidullah] dari [Nafi] bahwa [Ibnu Umar] berlari-lari kecil dari Hajar Aswad hingga Hajar Aswad, dan ia menyebutkan bahwa Rasulullah shallAllahu wa'alaihi wa sallam melakukan hal tersebut. ",
      "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا سُلَيْمُ بْنُ أَخْضَرَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ رَمَلَ مِنْ الْحَجَرِ إِلَى الْحَجَرِ وَذَكَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ ذَلِكَ"
    },
    {
      "number": 1686,
      "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Sufyan] dari [Abdullah] dan [Muhammad] dua anak Abu Bakr, dari [ayah mereka], dari [Abu Al Baddah bin 'Adi] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam memberikan keringanan untuk para penggembala untuk melempar satu hari dan tidak melempar satu hari. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ وَمُحَمَّدُ ابْنَيْ أَبِي بَكْرٍ عَنْ أَبِيهِمَا عَنْ أَبِي الْبَدَّاحِ بْنِ عَدِيٍّ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلرِّعَاءِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا"
    },
    {
      "number": 1706,
      "id": "Telah menceritakan kepada kami [Daud bin Rusyaid], telah menceritakan kepada kami [Yahya bin Zakariya], telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Aban bin Shalih] dan dari [Ibnu Abu Najih] dari [Mujahid] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bermukim di Mekkah pada waktu umratul qadha selama tiga hari. ",
      "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ أَبَانَ بْنِ صَالِحٍ وَعَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ فِي عُمْرَةِ الْقَضَاءِ ثَلَاثًا"
    },
    {
      "number": 1716,
      "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], telah menceritakan kepada kami [Hisyam bin Yusuf] dari [Ibnu Juraij], telah mengabarkan kepadaku ['Ubaidullah bin Abu Yazid] bahwa [Abdurrahman bin Thariq] telah mengabarkan kepadanya dari [ibunya] bahwa Rasulullah shallallahu 'alaihi wasallam apabila melewati suatu tempat di Daru Ya'la -Ubaidullah lupa- beliau menghadap kiblat dan lansung berdo'a. ",
      "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ طَارِقٍ أَخْبَرَهُ عَنْ أُمِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا جَازَ مَكَانًا مِنْ دَارِ يَعْلَى نَسِيَهُ عُبَيْدُ اللَّهِ اسْتَقْبَلَ الْبَيْتَ فَدَعَا"
    },
    {
      "number": 1720,
      "id": "Telah menceritakan kepada kami [Musa Abu Salamah], telah menceritakan kepada kami [Hammad] dari [Humaid], dari [Bakr bin Abdullah] serta [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] tidur di Al Bathha`, kemudian masuk ke Mekkah dan mengaku bahwa Rasulullah shallallahu 'alaihi wasallam melakukan hal tersebut. ",
      "arab": "حَدَّثَنَا مُوسَى أَبُو سَلَمَةَ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ وَأَيُّوبَ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ يَهْجَعُ هَجْعَةً بِالْبَطْحَاءِ ثُمَّ يَدْخُلُ مَكَّةَ وَيَزْعُمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ"
    },
    {
      "number": 1758,
      "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah mengabarkan kepada kami [Abu 'Awanah] dari [Qatadah] dan [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam telah membebaskan Shafiyyah dan menjadikan pembebasannya sebagai maharnya. ",
      "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْتَقَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا صَدَاقَهَا"
    },
    {
      "number": 1770,
      "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Khaththab bin Al Qasim], dari [Khushaif] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau tidak menyukai untuk menggabungkan (dalam satu perkawinan) antara seorang bibi (dari pihak bapak) dengan bibi (dari pihak ibu), serta antara dua bibi (dari pihak ibu) dengan dua bibi (dari pihak ayah). ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا خَطَّابُ بْنُ الْقَاسِمِ عَنْ خُصَيْفٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَرِهَ أَنْ يُجْمَعَ بَيْنَ الْعَمَّةِ وَالْخَالَةِ وَبَيْنَ الْخَالَتَيْنِ وَالْعَمَّتَيْنِ"
    },
    {
      "number": 1827,
      "id": "Telah menceritakan kepada kami [Isa bin Hammad], telah mengabarkan kepadaku [Al Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Sesungguhnya syarat yang paling berhak untuk dipenuhi adalah (syarat) yang kalian gunakan untuk menghalalkan farji.\"",
      "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ أَخْبَرَنِي اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ أَحَقَّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ"
    },
    {
      "number": 1835,
      "id": "Telah menceritakan kepada kami [Zuhair bin Harb], telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Abu 'Awanah] dari [Daud bin Abdullah Al Audi] dari [Abdurrahman Al Musli] dari [Al Asy'ats bin Qais] dari [Umar bin Al Khathab] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang laki-laki tidaklah ditanya kenapa ia memukul isterinya.\"",
      "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ الْأَوْدِيِّ عَنْ عَبْدِ الرَّحْمَنِ الْمُسْلِيِّ عَنْ الْأَشْعَثِ بْنِ قَيْسٍ عَنْ عُمَرَ بْنِ الْخَطَّابِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُسْأَلُ الرَّجُلُ فِيمَا ضَرَبَ امْرَأَتَهُ"
    },
    {
      "number": 1863,
      "id": "Telah menceritakan kepada kami [Katsir bin 'Ubaid], telah menceritakan kepada kami [Muhammad bin Khalid] dari [Mu'arrif bin Washil] dari [Muharib bin Ditsar] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Perkara halal yang paling Allah benci adalah perceraian.\"",
      "arab": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ عَنْ مُعَرِّفِ بْنِ وَاصِلٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبْغَضُ الْحَلَالِ إِلَى اللَّهِ تَعَالَى الطَّلَاقُ"
    },
    {
      "number": 1888,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam] dari [Qatadah], dari [Zurarah bin Aufa], dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah mengampuni bagi umatku apa yang belum mereka ucapkan dan belum mereka lakukan, serta sesuatu yang terbetik dalam pikirannya.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَجَاوَزَ لِأُمَّتِي عَمَّا لَمْ تَتَكَلَّمْ بِهِ أَوْ تَعْمَلْ بِهِ وَبِمَا حَدَّثَتْ بِهِ أَنْفُسَهَا"
    },
    {
      "number": 1896,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Hisyam bin 'Urwah] bahwa Jamilah adalah isteri Aus bin Ash Shamit, dan ia adalah orang yang memiliki kekaguman kepada wanita, apabila telah besar kekagumannya ia menzhihar isterinya, kemudian Allah menurunkan padanya ayat mengenai kafarah zhihar. Telah menceritakan kepada kami [Harun bin Abdullah], telah menceritakan kepada kami [Muhammad bin Al Fadhl], telah menceritakan kepada kami [Hammad bin Salamah] dari [Hisyam bin 'Urwah] dari ['Urwah] dari [Aisyah] seperti itu. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ عُرْوَةَأَنَّ جَمِيلَةَ كَانَتْ تَحْتَ أَوْسِ بْنِ الصَّامِتِ وَكَانَ رَجُلًا بِهِ لَمَمٌ فَكَانَ إِذَا اشْتَدَّ لَمَمُهُ ظَاهَرَ مِنْ امْرَأَتِهِ فَأَنْزَلَ اللَّهُ تَعَالَى فِيهِ كَفَّارَةَ الظِّهَارِحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ مِثْلَهُ"
    },
    {
      "number": 1928,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku ['Amr bin Al Harits] dari [Ibnu Al Had] dari [Abdullah bin Yunus] dari [Sa'id Al Maburi] dari [Abu Hurairah] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam ketika telah turun ayat mengenai li'an beliau bersabda: \"Bagi setiap wanita yang memasukkan kepada kaumnya seseorang yang bukan berasal dari mereka, maka ia bukan termasuk golongan Allah sama sekali, dan tidak akan Allah masukkan ke dalam Surga. Dan bagi setiap laki-laki yang mengingkari anaknya sementara ia mengetahui bahwa anak tersebut benar-benar anaknya, maka Allah menutup diri darinya, dan Allah akan mempermalukan dirinya di hadapan orang-orang terdahulu dan yang terakhir.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو يَعْنِي ابْنَ الْحَارِثِ عَنْ ابْنِ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ يُونُسَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حِينَ نَزَلَتْ آيَةُ الْمُتَلَاعِنَيْنِ أَيُّمَا امْرَأَةٍ أَدْخَلَتْ عَلَى قَوْمٍ مَنْ لَيْسَ مِنْهُمْ فَلَيْسَتْ مِنْ اللَّهِ فِي شَيْءٍ وَلَنْ يُدْخِلَهَا اللَّهُ جَنَّتَهُ وَأَيُّمَا رَجُلٍ جَحَدَ وَلَدَهُ وَهُوَ يَنْظُرُ إِلَيْهِ احْتَجَبَ اللَّهُ مِنْهُ وَفَضَحَهُ عَلَى رُءُوسِ الْأَوَّلِينَ وَالْآخِرِينَ"
    },
    {
      "number": 1953,
      "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad Al Marwazi], telah menceritakan kepadaku [Ali bin Al Husain bin Waqid] dari [ayahnya], dari [Yazid An Nahwi], dari [Ikrimah], dari [Ibnu Abbas]: \"Dan orang-orang yang akan meninggal dunia di antara kamu dan meninggalkan isteri, hendaklah berwasiat untuk isteri-isterinya, (yaitu) diberi nafkah hingga setahun lamanya dan tidak disuruh pindah (dari rumahnya).\" Kemudian hal tersebut dihapus dengan ayat mengenai warisan dengan bagian yang telah Allah tentukan bagi mereka, yaitu seperempat dan seperdelapan. Dan waktunya satu tahun digantikan menjadi empat bulan sepuluh hari. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ{ وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لِأَزْوَاجِهِمْ مَتَاعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ }فَنُسِخَ ذَلِكَ بِآيَةِ الْمِيرَاثِ بِمَا فَرَضَ لَهُنَّ مِنْ الرُّبُعِ وَالثُّمُنِ وَنُسِخَ أَجَلُ الْحَوْلِ بِأَنْ جُعِلَ أَجَلُهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا"
    },
    {
      "number": 2191,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya] dari ['Ubaidullah] dari [Nafi'], dari [Salim], dari [Abu Al Jarrah] mantan budak Ummu Habibah, dari [Ummu Habibah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Malaikat tidak menyertai rombongan yang membawa lonceng.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ سَالِمٍ عَنْ أَبِي الْجَرَّاحِ مَوْلَى أُمِّ حَبِيبَةَ عَنْ أُمِّ حَبِيبَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصْحَبُ الْمَلَائِكَةُ رِفْقَةً فِيهَا جَرَسٌ"
    },
    {
      "number": 2193,
      "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'], telah menceritakan kepada kami [Abu Bakr bin Uwais], telah menceritakan kepadaku [Sulaiman bin Bilal], dari [Al 'Ala` bin Abdurrahman] dari [ayahnya], dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam bersabda mengenai lonceng: \"Itu adalah seruling syetan.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ أُوَيْسٍ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَرَسِ مِزْمَارُ الشَّيْطَانِ"
    },
    {
      "number": 2196,
      "id": "Telah menceritakan kepada kami [Hannad bin As Sari], dari [Abu Al Ajwash] dari [Abu Ishaq], dari ['Amr bin Maimun], dari [Mu'adz], ia berkaa; aku pernah membonceng Rasulullah shallallahu 'alaihi wasallam di atas keledai yang bernama 'Ufair. ",
      "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ مُعَاذٍ قَالَكُنْتُ رِدْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حِمَارٍ يُقَالُ لَهُ عُفَيْرٌ"
    },
    {
      "number": 2211,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah], dari [Malik], dari [Nafi'], dari [Abdullah bin Umar], bahwa Rasulullah shallallahu 'alaihi wasallam memperlombakan antara kuda yang telah dipersiapkan untuk berlomba dari Al Hafya`, dan berakhir di Tsaniyah Al Qada`. Dan beliau melombakan kuda yang tidak dipersiapkan untuk berlomba dari Tsaniyah hingga masjid Bani Zuraiq, dan Abdullah adalah temasuk orang yang melombakannya. ",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَابَقَ بَيْنَ الْخَيْلِ الَّتِي قَدْ ضُمِّرَتْ مِنْ الْحَفْيَاءِ وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تُضَمَّرْ مِنْ الثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ وَإِنَّ عَبْدَ اللَّهِ كَانَ مِمَّنْ سَابَقَ بِهَا"
    },
    {
      "number": 2212,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Mu'tamir] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam mempersiapkan kuda untuk berlomba. ",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا مُعْتَمِرٌ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُضَمِّرُ الْخَيْلَ يُسَابِقُ بِهَا"
    },
    {
      "number": 2213,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami ['Uqbah bin Khalid], dari ['Ubaidullah] dari [Nafi'], dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam melombakan antar kuda. Dan beliau lebih memilih kuda yang masuk pada umur lima tahun. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبَّقَ بَيْنَ الْخَيْلِ وَفَضَّلَ الْقُرَّحَ فِي الْغَايَةِ"
    },
    {
      "number": 2216,
      "id": "Telah menceritakan kepada kami [Yahya bin Khalaf], telah menceritakan kepada kami [Abdul Wahhab bin Abdul Majid], telah menceritakan kepada kami ['Anbasah], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Bisyr bin Al Mufadhdhal], dari [Humaid Ath Thawil], seluruhnya dari [Al Hasan] dari [Imran bin Hushain] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada jalab (seseorang meminta orang lain mengikuti kudanya untuk menghardiknya supaya berlari cepat), janab (mengiringkan kuda lain di samping kuda yang digunakan untuk lomba kemudian apabila telah lelah maka ia berpindah kepada kuda yang lain).\" Yahya menambahkan dalam haditsnya; dalam pacuan.",
      "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا عَنْبَسَةُ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ حُمَيْدٍ الطَّوِيلِ جَمِيعًا عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا جَلَبَ وَلَا جَنَبَ زَادَ يَحْيَى فِي حَدِيثِهِ فِي الرِّهَانِ حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ قَالَ الْجَلَبُ وَالْجَنَبُ فِي الرِّهَانِ"
    },
    {
      "number": 2219,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Al Laits], dari [Abu Az Zubair], dari [Jabir], dari Rasulullah shallallahu wa'alaihi wa sallam bahwa beliau telah memerintahkan seorang laki-laki yang telah bersedekah dengan anak panah di Masjid, agar tidak melewatinya kecuali ia memegang mata panahnya. ",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَمَرَ رَجُلًا كَانَ يَتَصَدَّقُ بِالنَّبْلِ فِي الْمَسْجِدِ أَنْ لَا يَمُرَّ بِهَا إِلَّا وَهُوَ آخِذٌ بِنُصُولِهَا"
    },
    {
      "number": 2221,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], dari [Abu Az Zubair], dari [Jabir], bahwa Nabi shallallahu 'alaihi wasallam telah melarang menerima pedang dalam keadaan terhunus. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُتَعَاطَى السَّيْفُ مَسْلُولًا"
    },
    {
      "number": 2222,
      "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Quraisy bin Anas], telah menceritakan kepada kami [Asy'ats] dari [Al Hasan] dari [Samrah bin Jundub], bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang mengerat tali kulit diantara kedua jari. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُقَدَّ السَّيْرُ بَيْنَ إِصْبَعَيْنِ"
    },
    {
      "number": 2225,
      "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Al Marwazi bin Rahawai], telah menceritakan kepada kami [Yahya bin Adam], telah menceritakan kepada kami [Syarik] dari ['Ammar Ad Duhni], dari [Abu Az Zubair], dari [Jabir], dan ia memarfu'kannya kepada Nabi shallallahu 'alaihi wasallam, bahwa bendera beliau pada saat memasuki Mekkah berwarna putih. ",
      "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْمَرْوَزِيُّ وَهُوَ ابْنُ رَاهَوَيْهِ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا شَرِيكٌ عَنْ عَمَّارٍ الدُّهْنِيِّ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ يَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ لِوَاؤُهُ يَوْمَ دَخَلَ مَكَّةَ أَبْيَضَ"
    },
    {
      "number": 2257,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya] dan ['Ubaidullah], telah menceritakan kepadaku [Nafi'], dari [Abdullah] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Kewajiban seorang muslim adalah mendengar dan mentaati dalam perkara yang ia senangi maupun ia benci, selama ia tidak diperintahkan untuk bermaksiat. Apabila ia diperintakan untuk bermaksiat, maka tidak boleh mendengar dan mentaati.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ السَّمْعُ وَالطَّاعَةُ عَلَى الْمَرْءِ الْمُسْلِمِ فِيمَا أَحَبَّ وَكَرِهَ مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلَا سَمْعَ وَلَا طَاعَةَ"
    },
    {
      "number": 2345,
      "id": "Telah menceritakan kepada kami [Sa'd bin Manshur?], telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Shafwan bin 'Amr] dari [Abdurrahman bin Jubair bin Nufair] dari [ayahnya], dari ['Auf bin Malik Al Asyja'i], dan [Khalid bin Al Walid] bahwa Rasulullah shallallahu 'alaihi wasallam telah memutuskan bahwa salab adalah untuk orang yang membunuh, dan beliau tidak membagi menjadi lima bagian. ",
      "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ صَفْوَانَ بْنِ عَمْرٍو عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ وَخَالِدِ بْنِ الْوَلِيدِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالسَّلَبِ لِلْقَاتِلِ وَلَمْ يُخَمِّسْ السَّلَبَ"
    },
    {
      "number": 2357,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan tiga saham kepada seseorang dan kudanya, satu saham untuknya dan dua saham untuk kudanya. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْهَمَ لِرَجُلٍ وَلِفَرَسِهِ ثَلَاثَةَ أَسْهُمٍ سَهْمًا لَهُ وَسَهْمَيْنِ لِفَرَسِهِ"
    },
    {
      "number": 2375,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik], dari [Abdullah bin Dinar] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang berkhianat akan dikibarkan baginya bendera pada Hari Kiamat dan dikatakan; ini adalah pengkhianatan Fulan bin Fulan.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْغَادِرَ يُنْصَبُ لَهُ لِوَاءٌ يَوْمَ الْقِيَامَةِ فَيُقَالُ هَذِهِ غَدْرَةُ فُلَانِ بْنِ فُلَانٍ"
    },
    {
      "number": 2412,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam berkurban dengan dua domba yang bertanduk dan berwarna abu-Abu. Beliau menyembelih, bertakbir dan membaca bismilah, serta beliau meletakkan kakinya di atas sebelah kepalanya. ",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَّى بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ يَذْبَحُ وَيُكَبِّرُ وَيُسَمِّي وَيَضَعُ رِجْلَهُ عَلَى صَفْحَتِهِمَا"
    },
    {
      "number": 2428,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], bahwa [Abu Usamah] telah menceritakan kepada mereka dari [Usamah] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam menyembelih kurbannya di lapangan, dan Ibnu Umar melakukan hal tersebut. ",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ أَنَّ أَبَا أُسَامَةَ حَدَّثَهُمْ عَنْ أُسَامَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَذْبَحُ أُضْحِيَّتَهُ بِالْمُصَلَّىوَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ"
    },
    {
      "number": 2443,
      "id": "Telah menceritakan kepada kami [Hannad bin As Sari], dan [Al Hasan bin Isa] mantan budak Ibnu Al Mubarak, dari [Ibnu Al Mubarak] dari [Ma'mar] dari ['Amr bin Abdullah], dari [Ikrimah] dari [Ibnu Abbas], Ibnu Isa menambahkan; dan dari [Abu Hurairah] mereka berdua mengatakan; Rasulullah shallallahu 'alaihi wasallam melarang dari syarithatu syaithan (hewan yang ketika disembelih urat lehernya tidak terpotong dengan sempurna), Ibnu Isa menambahkan dalam haditsnya; yaitu yang disembelih dengan memotong kulit dan urat-urat leher tidak dipotong kemudian dibiarkan hingga mati. ",
      "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ وَالْحَسَنُ بْنُ عِيسَى مَوْلَى ابْنِ الْمُبَارَكِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ زَادَ ابْنُ عِيسَى وَأَبِي هُرَيْرَةَ قَالَانَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَرِيطَةِ الشَّيْطَانِ زَادَ ابْنُ عِيسَى فِي حَدِيثِهِ وَهِيَ الَّتِي تُذْبَحُ فَيُقْطَعُ الْجِلْدُ وَلَا تُفْرَى الْأَوْدَاجُ ثُمَّ تُتْرَكُ حَتَّى تَمُوتَ"
    },
    {
      "number": 2458,
      "id": "Telah menceritakan kepada kami [Abu Ma'mar Abdullah bin 'Amr], telah menceritakan kepada kami [Abdul Warits], telah menceritakan kepada kami [Ayyub] dari [Ikrimah] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam menyembelih aqiqah untuk Al Hasan dan Al Husain satu domba, satu domba. ",
      "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقَّ عَنْ الْحَسَنِ وَالْحُسَيْنِ كَبْشًا كَبْشًا"
    },
    {
      "number": 2485,
      "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad Al Marwazi], telah menceritakan kepadaku [Ali bin Husain bin Waqid], dari [ayahnya], dari [Yazid An Nahwi], dari [Ikrimah] dari [Ibnu Abbas], \"Jika ia meninggalkan harta yang banyak, berwasiat untuk ibu-bapak dan karib kerabatnya.\" Maka wasiat adalah demikian hingga dihapus oleh ayat warisan. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ{ إِنْ تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالْأَقْرَبِينَ }فَكَانَتْ الْوَصِيَّةُ كَذَلِكَ حَتَّى نَسَخَتْهَا آيَةُ الْمِيرَاثِ"
    },
    {
      "number": 2486,
      "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah], telah menceritakan kepada kami [Ibnu 'Ayyasy], dari [Syurahbil bin Muslim], saya mendengar [Abu Umamah], saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah memberikan hak kepada setiap yang memiliki hak, maka tidak ada wasiat bagi pewaris.\"",
      "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا ابْنُ عَيَّاشٍ عَنْ شُرَحْبِيلَ بْنِ مُسْلِمٍ سَمِعْتُ أَبَا أُمَامَةَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ فَلَا وَصِيَّةَ لِوَارِثٍ"
    },
    {
      "number": 2506,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Aban], telah menceritakan kepada kami [Qatadah], telah menceritakan kepadaku [Abu Hassan] dari [Al Aswad bin Yazid?] bahwa [Mu'adz bin Jabarl], telah memberikan warisan kepada seorang saudara wanita dan anak wanita. Ia memberikan setiap mereka setengah bagian, pada saat ia berada di Yaman, sedang Nabi shallallahu 'alaihi wasallam pada saat itu masih hidup. ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنِي أَبُو حَسَّانَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَأَنَّ مُعَاذَ بْنَ جَبَلٍ وَرَّثَ أُخْتًا وَابْنَةً فَجَعَلَ لِكُلِّ وَاحِدَةٍ مِنْهُمَا النِّصْفَ وَهُوَ بِالْيَمَنِ وَنَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ حَيٌّ"
    },
    {
      "number": 2508,
      "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Aziz bin Abu Rizmah], telah mengabarkan kepadaku [ayahku], telah menceritakan kepada kami ['Ubaidullah Abu Al Munib Al 'Ataki], dari [Ibnu Buraidah] dari [ayahnya], bahwa Nabi shallallahu 'alaihi wasallam telah memberikan nenek bagian seperenam apabila tidak ada ibu bersamanya. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ أَخْبَرَنِي أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ أَبُو الْمُنِيبِ الْعَتَكِيِّ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ لِلْجَدَّةِ السُّدُسَ إِذَا لَمْ يَكُنْ دُونَهَا أُمٌّ"
    },
    {
      "number": 2519,
      "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi], telah menceritakan kepada kami [Muhammad bin Harb], telah menceritakan kepadaku [Umar bin Ru`bah At Taghlibi], dari [Abdul Wahid bin Abdullah An Nashri], dari [Watsilah bin Al Asqa'] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Seorang wanita menjaga tiga orang yang mewarisi; budak yang ia bebaskan, anak temuannya, dan anaknya yang karenanya ia melakukan li'an.\"",
      "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنِي عُمَرُ بْنُ رُؤْبَةَ التَّغْلِبِيُّ عَنْ عَبْدِ الْوَاحِدِ بْنِ عَبْدِ اللَّهِ النَّصْرِيِّ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَرْأَةُ تُحْرِزُ ثَلَاثَةَ مَوَارِيثَ عَتِيقَهَا وَلَقِيطَهَا وَوَلَدَهَا الَّذِي لَاعَنَتْ عَنْهُ"
    },
    {
      "number": 2521,
      "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Ali bin Husain] dari ['Amr bin Utsman] dari [Usamah bin Zaid] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Orang muslim tidak mewarisi orang kafir, dan orang kafir tidak mewarisi orang muslim.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ"
    },
    {
      "number": 2531,
      "id": "Telah menceritakan kepada kami [Husain bin Muadz], telah menceritakan kepada kami [Abdul A'la], telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yazid? bin Abdullah bin Qusaith] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila anak yang lahir (dalam keadaan) menangis, maka ia diwarisi.\"",
      "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُعَاذٍ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ إِسْحَقَ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَهَلَّ الْمَوْلُودُ وُرِّثَ"
    },
    {
      "number": 2542,
      "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Al Mukharrami], telah menceritakan kepada kami [Abdurrahman bin Mahdi], telah menceritakan kepada kami [Imran Al Qaththan] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam menunjuk Ibnu Ummi Maktum menggantikan beliau di Madinah dua kali. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْمُخَرَّمِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَخْلَفَ ابْنَ أُمِّ مَكْتُومٍ عَلَى الْمَدِينَةِ مَرَّتَيْنِ"
    },
    {
      "number": 2554,
      "id": "Telah menceritakan kepada kami [Zaid bin Akhzam Abu Thalib], telah menceritakan kepada kami [Abu 'Ashim] dari [Abdul Warits bin Sa'id] dari [Husain Al Mu'allim] dari [Abdullah bin Buraidah], dari [ayahnya], dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang kami beri jabatan untuk mengurusi suatu pekerjaan kemudian kami berikan kepadanya suatu pemberian (gaji), maka apa yang ia ambil setelah itu (selain gaji) adalah suatu bentuk pengkhianatan.\"",
      "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ أَبُو طَالِبٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ الْوَارِثِ بْنِ سَعِيدٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَرَزَقْنَاهُ رِزْقًا فَمَا أَخَذَ بَعْدَ ذَلِكَ فَهُوَ غُلُولٌ"
    },
    {
      "number": 2567,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrazzaq], dari [Ma'mar] dari [Az Zuhri], dari [Abu Salamah] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Aku adalah orang yang lebih utama terhadap setiap mukmin daripada dirinya sendiri. Siapapun laki-laki yang meninggal dunia dan ia meninggalkan hutang maka kembalinya kepadaku, dan barang siapa yang meninggalkan harta, maka untuk para pewarisnya.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ فَأَيُّمَا رَجُلٍ مَاتَ وَتَرَكَ دَيْنًا فَإِلَيَّ وَمَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ"
    },
    {
      "number": 2611,
      "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ibnu Juraij] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar], bahwa orang-orang yahudi Bani Nadhir dan Quraizhah memerangi Rasulullah shallallahu 'alaihi wasallam, kemudian beliau mengusir Bani Nadhir dan membiarkan Quraizhah dan memberikan kebebasan kepada mereka hingga orang-orang Bani Quraizhah setelah itu memerangi beliau. Maka beliau membunuh laki-laki mereka dan membagikan para wanita dan anak-anak mereka serta harta mereka diantara orang-orang muslim, kecuali sebagiannya kembali kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau memberikan kebebasan kepada mereka hingga mereka masuk Islam. Dan Rasulullah shallallahu 'alaihi wasallam mengusir orang-orang seluruh orang yahudi Bani Qainuqa' dari Madinah. Mereka adalah kaumnya Abdullah bin Salam, dan yahudi Bani Haritsah serta seluruh orang yahudi di Manidah. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ يَهُودَ النَّضِيرِ وَقُرَيْظَةَ حَارَبُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَجْلَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَنِي النَّضِيرِ وَأَقَرَّ قُرَيْظَةَ وَمَنَّ عَلَيْهِمْ حَتَّى حَارَبَتْ قُرَيْظَةُ بَعْدَ ذَلِكَ فَقَتَلَ رِجَالَهُمْ وَقَسَمَ نِسَاءَهُمْ وَأَوْلَادَهُمْ وَأَمْوَالَهُمْ بَيْنَ الْمُسْلِمِينَ إِلَّا بَعْضَهُمْ لَحِقُوا بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّنَهُمْ وَأَسْلَمُوا وَأَجْلَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَهُودَ الْمَدِينَةِ كُلَّهُمْ بَنِي قَيْنُقَاعَ وَهُمْ قَوْمُ عَبْدِ اللَّهِ بْنِ سَلَامٍ وَيَهُودَ بَنِي حَارِثَةَ وَكُلَّ يَهُودِيٍّ كَانَ بِالْمَدِينَةِ"
    },
    {
      "number": 2615,
      "id": "Telah menceritakan kepada kami [Daud bin Mu'adz], telah menceritakan kepada kami [Abdul Warits]. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ya'qub bin Ibrahim], dan [Ziyad bin Ayyub], bahwa [Isma'il bin Ibrahim] telah menceritakan kepada mereka dari [Abdul Aziz bin Shuhaib], dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam memerangi Khaibar dan mendapatkannya dengan kekerasan, kemudian dikumpulkan tawanannya. ",
      "arab": "حَدَّثَنَا دَاوُدُ بْنُ مُعَاذٍ حَدَّثَنَا عَبْدُ الْوَارِثِ ح و حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ وَزِيَادُ بْنُ أَيُّوبَ أَنَّ إِسْمَعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَهُمْ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزَا خَيْبَرَ فَأَصَبْنَاهَا عَنْوَةً فَجُمِعَ السَّبْيُ"
    },
    {
      "number": 2619,
      "id": "Telah menceritakan kepada kami [Muhammad bin Miskin Al Yamami], telah menceritakan kepada kami [Yahya bin Hassan], telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] bahwa Rasulullah shallallahu 'alaihi wasallam tatkala Allah memberikan fa` yang berupa Khaibar kepadanya beliau membaginya menjadi tiga puluh enam saham. Kemudian beliau memisahkan setengah yaitu delapan belas saham untuk orang-orang muslim, setiap saham menghimpun seratus saham. Nabi shallallahu 'alaihi wasallam bersama mereka, beliau mendapatkan saham seperti saham salah seorang diantara mereka. Dan Rasulullah shallallahu 'alaihi wasallam memisahkan delapan belas saham yang merukan setengah bagian untuk musibah-musibah yang kemungkinan menimpa dan urusan muslimin yang terjadi. Setengah bagian tersebut adalah benteng Wathih, daerah Kutaibah, Salalim dan yang mengikutinya. Kemudian tatkala harta tersebut telah berada di tangan Nabi shallallahu 'alaihi wasallam dan muslimin, mereka tidak memiliki pekerja yang mengerjakan pekerjaannya untuk mereka. Kemudian Rasulullah shallallahu 'alaihi wasallam memanggil orang-orang yahudi dan mempekerjakan mereka. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِسْكِينٍ الْيَمَامِيُّ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَفَاءَ اللَّهُ عَلَيْهِ خَيْبَرَ قَسَمَهَا سِتَّةً وَثَلَاثِينَ سَهْمًا جَمْعُ فَعَزَلَ لِلْمُسْلِمِينَ الشَّطْرَ ثَمَانِيَةَ عَشَرَ سَهْمًا يَجْمَعُ كُلُّ سَهْمٍ مِائَةً النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَهُمْ لَهُ سَهْمٌ كَسَهْمِ أَحَدِهِمْ وَعَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيَةَ عَشَرَ سَهْمًا وَهُوَ الشَّطْرُ لِنَوَائِبِهِ وَمَا يَنْزِلُ بِهِ مِنْ أَمْرِ الْمُسْلِمِينَ فَكَانَ ذَلِكَ الْوَطِيحَ وَالْكُتَيْبَةَ وَالسَّلَالِمَ وَتَوَابِعَهَا فَلَمَّا صَارَتْ الْأَمْوَالُ بِيَدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُسْلِمِينَ لَمْ يَكُنْ لَهُمْ عُمَّالٌ يَكْفُونَهُمْ عَمَلَهَا فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْيَهُودَ فَعَامَلَهُمْ"
    },
    {
      "number": 2641,
      "id": "Telah menceritakan kepada kami [Al Abbas bin Abdul 'Azhim], telah menceritakan kepada kami [Sahl bin Muhammad], telah menceritakan kepada kami [Yahya bin Abu Zaidah], dari [Muhammad bin Ishaq] dari ['Ashim bin Umar], dari [Anas bin Malik], dan dari [Utsman bin Abu Sulaiman], bahwa Nabi shallallahu 'alaihi wasallam telah mengirimkan Khalid bin Al Walid ke Ukaidir Dumah, kemudian ia ditangkap, lalu mereka membawanya kepada beliau. Kemudian beliau memampatkan darahnya dan berdamai dengan syarat ia memberikan jizyah. ",
      "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ حَدَّثَنَا سَهْلُ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَاصِمِ بْنِ عُمَرَ عَنْ أَنَسِ بْنِ مَالِكٍ وَعَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ خَالِدَ بْنَ الْوَلِيدِ إِلَى أُكَيْدِرِ دُومَةَ فَأُخِذَ فَأَتَوْهُ بِهِ فَحَقَنَ لَهُ دَمَهُ وَصَالَحَهُ عَلَى الْجِزْيَةِ"
    },
    {
      "number": 2658,
      "id": "Telah menceritakan kepada kami ['Amr bin Marzuq], telah mengabarkan kepada kami [Syu'bah], dari [Simak] dari ['Alqamah bin Wail] dari [ayahnya], bahwa Nabi shallallahu 'alaihi wasallam telah mengalokasikan untuknya lahan di Hadhramaut. Telah menceritakan kepada kami [Hafsh bin Umar], telah menceritakan kepada kami [Jami' bin Mathar], dari ['Alqamah bin Wail] dengan sanadnya seperti itu. ",
      "arab": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ عَنْ سِمَاكٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَهُ أَرْضًا بِحَضْرَمُوتَحَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا جَامِعُ بْنُ مَطَرٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ بِإِسْنَادِهِ مِثْلَهُ"
    },
    {
      "number": 2713,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrazzaq], telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri], dari [Abu Salamah], dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam ditutup dengan baju hibarah (baju yang terbuat dari kapas di Yaman). ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُجِّيَ فِي ثَوْبِ حِبَرَةٍ"
    },
    {
      "number": 2736,
      "id": "Telah menceritakan kepada kami [Hudbah bin Khalid], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah] dari [Muhammad bin Sirin] bahwa ia mengambil (cara) memandikan (mayat) dari [Ummu 'Athiyyah] dengan daun bidara dua kali dan ketiganya dengan air dan kapur barus. ",
      "arab": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ مُحَمَّدِ بْنِ سِيرِينَأَنَّهُ كَانَ يَأْخُذُ الْغُسْلَ عَنْ أُمِّ عَطِيَّةَ يَغْسِلُ بِالسِّدْرِ مَرَّتَيْنِ وَالثَّالِثَةَ بِالْمَاءِ وَالْكَافُورِ"
    },
    {
      "number": 2744,
      "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepadaku [Ibnu Wahb], telah menceritakan kepadaku [Hisyam bin Sa'dan] dari [Hatim bin Abu Nashr] dari ['Ubadah bin Nusai] dari [ayahnya] dari ['Ubadah bin Ash Shamit] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Sebaik-baik kafan adalah hullah (pakaian yang terdiri dari jubah, sarung dan serempang), dan sebaik-baik kurban adalah domba yang bertanduk.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنِي ابْنُ وَهْبٍ حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ عَنْ حَاتِمِ بْنِ أَبِي نَصْرٍ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ أَبِيهِ عَنْ عُبَادَةَ بْنِ الصَّامِتِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ الْكَفَنِ الْحُلَّةُ وَخَيْرُ الْأُضْحِيَّةِ الْكَبْشُ الْأَقْرَنُ"
    },
    {
      "number": 2844,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas], bahwa Abu Bakr telah bersumpah kepada Nabi shallallahu 'alaihi wasallam kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan engkau bersumpah!\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍأَنَّ أَبَا بَكْرٍ أَقْسَمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقْسِمْ"
    },
    {
      "number": 2848,
      "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah Adh Dhabbi], telah menceritakan kepada kami [Al Mughirah bin Abdurrahman], telah menceritakan kepadaku [Abu Abdurrahman] dari ['Amr bin Syu'aib], dari [ayahnya], dari [kakeknya], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh ada nadzar kecuali pada sesuatu yang diharapkan padanya wajah Allah, dan tidak boleh ada sumpah dalam memutuskan hubungan kekerabatan.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ إِلَّا فِيمَا يُبْتَغَى بِهِ وَجْهُ اللَّهِ وَلَا يَمِينَ فِي قَطِيعَةِ رَحِمٍ"
    },
    {
      "number": 2851,
      "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], telah menceritakan kepada kami [Hammad], telah menceritakan kepada kami [Ghailan bin Jarir], dari [Abu Burdah], dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Allah, insya Allah aku tidak bersumpah dengan suatu sumpah kemudian aku melihat yang lainnya lebih baik darinya kecuali aku membayar kafarah sumpahku dan aku melakukan yang lebih baik.\" Atau beliau mengatakan: \"melainkan aku melakukan yang lebih baik dan membayar kafarah sumpahku.\"",
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا غَيْلَانُ بْنُ جَرِيرٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لَا أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلَّا كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ أَوْ قَالَ إِلَّا أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَكَفَّرْتُ يَمِينِي"
    },
    {
      "number": 2867,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Abu Al Walid], telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] bahwa saudari 'Uqbah bin 'Amir telah bernadzar untuk berjalan kaki menuju Ka'bah kemudian Nabi shallallahu 'alaihi wasallam memerintahkannya agar berkendaraan dan menyembelih kurban. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ أُخْتَ عُقْبَةَ بْنِ عَامِرٍ نَذَرَتْ أَنْ تَمْشِيَ إِلَى الْبَيْتِ فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَرْكَبَ وَتُهْدِيَ هَدْيًا"
    },
    {
      "number": 2914,
      "id": "Telah menceritakan kepada kami [Yazid? bin Khalid Al Hamdani], dan [Qutaibah bin Sa'id Ats Tsaqafi], bahwa [Al Laits] telah menceritakan kepada mereka dari [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam membeli seorang budak dibayar dengan dua orang budak. ",
      "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الْهَمْدَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ أَنَّ اللَّيْثَ حَدَّثَهُمْ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى عَبْدًا بِعَبْدَيْنِ"
    },
    {
      "number": 2959,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Yahya], dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam mempekerjakan penduduk Khaibar dengan upah setengah buah atau tanaman yang keluar. ",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْ ثَمَرٍ أَوْ زَرْعٍ"
    },
    {
      "number": 3051,
      "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] ia mendengar ['Amru bin Asy Syarid] ia mendengar [Abu Rafi'] mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak terhadap apa yang dekat dengan rumahnya.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ سَمِعَ عَمْرَو بْنَ الشَّرِيدِ سَمِعَ أَبَا رَافِعٍسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْجَارُ أَحَقُّ بِسَقَبِهِ"
    },
    {
      "number": 3052,
      "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tetangga rumah lebih berhak terhadap rumah tetangganya atau lahannya.\"",
      "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَارُ الدَّارِ أَحَقُّ بِدَارِ الْجَارِ أَوْ الْأَرْضِ"
    },
    {
      "number": 3054,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Zuhair] secara makna, dari [Yahya bin Sa'id] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Umar bin Abdul Aziz] dari [Abu Bakr bin Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lelaki mana saja yang mengalami kebangkrutan kemudian orang lain mendapatkan barangnya, maka ia lebih berhak terhadapnya daripada selainnya.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ ح و حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ الْمَعْنَى عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا رَجُلٍ أَفْلَسَ فَأَدْرَكَ الرَّجُلُ مَتَاعَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ"
    },
    {
      "number": 3058,
      "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] dari [Hammad bin Zaid] dari [Khalid Al Hadzdza`] dari ['Ubaidullah bin Humaid bin Abdurrahman] dari [Asy Sya'bi] dan ia memarfu'kan hadits tersebut kepada Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa meninggalkan hewan kendaraan dalam kondisi kritis, kemudian seseorang merawat hewan tersebut, maka hewan itu adalah milik orang yang telah merawatnya.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ عَنْ حَمَّادٍ يَعْنِي ابْنَ زَيْدٍ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عُبَيْدِ اللَّهِ بْنِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ الشَّعْبِيِّيَرْفَعُ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ تَرَكَ دَابَّةً بِمَهْلَكٍ فَأَحْيَاهَا رَجُلٌ فَهِيَ لِمَنْ أَحْيَاهَا"
    },
    {
      "number": 3081,
      "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [An Nadlr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"'Umra itu dibolehkan.\" Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" ",
      "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعُمْرَى جَائِزَةٌحَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ"
    },
    {
      "number": 3082,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban] dari [Yahya] dari [Abu Salamah] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"'Umra itu untuk orang yang diberi.\" ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ الْعُمْرَى لِمَنْ وُهِبَتْ لَهُ"
    },
    {
      "number": 3086,
      "id": "Telah menceritakan kepada kami [Ishaq bin Isma'il] telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij] dari ['Atha] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah memberikan Ruqba atau Umra. Barangsiapa diberi Ruqba atau Umra maka hal tersebut untuk para pewarisnya.\" ",
      "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُرْقِبُوا وَلَا تُعْمِرُوا فَمَنْ أُرْقِبَ شَيْئًا أَوْ أُعْمِرَهُ فَهُوَ لِوَرَثَتِهِ"
    },
    {
      "number": 3091,
      "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] telah menceritakan kepada kami [Yahya] dari [Ibnu Abu 'Arubah] dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tangan bertanggung jawab atas apa yang ia ambil hingga ia menunaikannya, -kemudian Al Hasan lupa lanjutannya-. Lantas ia menyebutkan, \"…. dia adalah orang yang engkau percayai, tidak ada tanggung jawab atasnya.\"",
      "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا يَحْيَى عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَى الْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَ ثُمَّ إِنَّ الْحَسَنَ نَسِيَ فَقَالَ هُوَ أَمِينُكَ لَا ضَمَانَ عَلَيْهِ"
    },
    {
      "number": 3126,
      "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yahya bin Ayyub] serta [Nafi' bin Yazid] dari [Ibnu Al Had] dari [Muhammad bin 'Amru bin 'Atha] dari ['Atha bin Yasar] dari [Abu Hurairah] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Persaksian orang pelosok tidak berlaku untuk penduduk kota.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمَدَانِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ وَنَافِعُ بْنُ يَزِيدَ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ"
    },
    {
      "number": 3135,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ibnu Abu 'Arubah] dari [Qatadah] dari [Khilas] dari [Abu Rafi'] dari [Abu Hurairah] bahwa dua orang laki-laki mengadukan perselisihan tentang sebuah barang kepada Nabi shallallahu 'alaihi wasallam, sementara keduanya tidak memiliki bukti. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Undilah untuk melakukan sumpah!\" Baik keduanya menyukai hal tersebut atau membencinya.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلَيْنِ اخْتَصَمَا فِي مَتَاعٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَهِمَا عَلَى الْيَمِينِ مَا كَانَ أَحَبَّا ذَلِكَ أَوْ كَرِهَا"
    },
    {
      "number": 3149,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Al Mutsanna bin Sa'id] telah menceritakan kepada kami [Qatadah] dari [Busyair bin Ka'b Al 'Adawi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika kalian berselisih dengan (batas), maka jadikanlah jalan tersebut lebarnya adalah tujuh hasta!\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ حَدَّثَنَا قَتَادَةُ عَنْ بُشَيْرِ بْنِ كَعْبٍ الْعَدَوِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَدَارَأْتُمْ فِي طَرِيقٍ فَاجْعَلُوهُ سَبْعَةَ أَذْرُعٍ"
    },
    {
      "number": 3151,
      "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Yahya] dari [Muhammad bin Yahya bin Habban] dari [Luluah] dari [Abu Shirmah] -selain Qutaibah telah menyebutkan hadits ini dari Shirmah- sahabat Nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa menimpakan madharat (keburukan) kepada orang lain maka Allah akan menimpakan madharat kepadanya, dan barangsiapa memperberat orang lain maka Allah akan memperberat dirinya.\"",
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ لُؤْلُؤَةَ عَنْ أَبِي صِرْمَةَ قَالَ غَيْرَ قُتَيْبَةَ فِي هَذَا الْحَدِيثِ عَنْ أَبِي صِرْمَةَ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَاقَّ اللَّهُ عَلَيْهِ"
    },
    {
      "number": 3154,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir] dari [Abu Malik bin Tsa'labah] dari [Tsa'labah bin Malik] bahwa ia mendengar [para pembesar] mereka menyebutkan bahwa seorang laki-laki Quraisy memiliki saham pada Bani Quraizhah, kemudian ia memperkarakan kepada Rasulullah shallallahu 'alaihi wasallam mengenai aliran yang mereka berbagi dengan airnya. Kemudian Rasulullah shallallahu 'alaihi wasallam memberi putusan untuk mereka, bahwa batas genangan air adalah sebatas mata kaki, orang yang lahannya di atas tidak boleh menahan dari yang di bawah.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ يَعْنِي ابْنَ كَثِيرٍ عَنْ أَبِي مَالِكِ بْنِ ثَعْلَبَةَ عَنْ أَبِيهِ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ أَنَّهُ سَمِعَ كُبَرَاءَهُمْيَذْكُرُونَ أَنَّ رَجُلًا مِنْ قُرَيْشٍ كَانَ لَهُ سَهْمٌ فِي بَنِي قُرَيْظَةَ فَخَاصَمَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَهْزُورٍ يَعْنِي السَّيْلَ الَّذِي يَقْتَسِمُونَ مَاءَهُ فَقَضَى بَيْنَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْمَاءَ إِلَى الْكَعْبَيْنِ لَا يَحْبِسُ الْأَعْلَى عَلَى الْأَسْفَلِ"
    },
    {
      "number": 3155,
      "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah menceritakan kepada kami [Al Mughirah bin Abdurrahman] telah menceritakan kepadaku ayahku [Abdurrahman bin Al Harits] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam memberi putusan dalampembagian air, bahwa batas genangan air (pada tanaman) adalah setinggi mata kaki. Setelah itu orang yang lahannya di bagian atas memberikannya kepada orang yang lahannya di bawah.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي السَّيْلِ الْمَهْزُورِ أَنْ يُمْسَكَ حَتَّى يَبْلُغَ الْكَعْبَيْنِ ثُمَّ يُرْسِلُ الْأَعْلَى عَلَى الْأَسْفَلِ"
    },
    {
      "number": 3168,
      "id": "Telah menceritakan kepada kami ['Amru bin Marzuq] telah mengabarkan kepada kami [Syu'bah] dari [Abu 'Aqil Hasyim bin Bilal] dari [Sabiq bin Najiyah] dari [Abu Sallam] dari [Seorang laki-laki] yang melayani Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam apabila menceritakan suatu hadits maka beliau mengulanginya sebanyak tiga kali.\"",
      "arab": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ عَنْ أَبِي عَقِيلٍ هَاشِمِ بْنِ بِلَالٍ عَنْ سَابِقِ بْنِ نَاجِيَةَ عَنْ أَبِي سَلَّامٍ عَنْ رَجُلٍ خَدَمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا حَدَّثَ حَدِيثًا أَعَادَهُ ثَلَاثَ مَرَّاتٍ"
    },
    {
      "number": 3171,
      "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah menceritakan kepada kami [Isa] dari [Al Auza'i] dari [Abdullah bin Sa'dan] dari [Ash Shunabihi] dari [Mu'awiyah] bahwa Nabi shallallahu 'alaihi wasallam telah melarang dari permasalahan-permasalahan yang sulit.\"",
      "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ حَدَّثَنَا عِيسَى عَنْ الْأَوْزَاعِيِّ عَنْ عَبْدِ اللَّهِ بْنِ سَعْدٍ عَنْ الصُّنَابِحِيِّ عَنْ مُعَاوِيَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْغُلُوطَاتِ"
    },
    {
      "number": 3190,
      "id": "Telah menceritakan kepada kami [Zuhair bin Hazb] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [As Saddi] dari [Abu Hubairah] dari [Anas bin Malik] bahwa Abu Thalhah bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai anak-anak yatim yang mewarisi khamer. Beliau bersabda: \"Tumpahkanlah khamer tersebut!\" Abu Thalhah bertanya, \"Bolehkah aku jadikan cuka?\" Beliau menjawab: \"Tidak.\"",
      "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ السُّدِّيِّ عَنْ أَبِي هُبَيْرَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ أَبَا طَلْحَةَ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَيْتَامٍ وَرِثُوا خَمْرًا قَالَ أَهْرِقْهَا قَالَ أَفَلَا أَجْعَلُهَا خَلًّا قَالَ لَا"
    },
    {
      "number": 3264,
      "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] dari [Abdussalam bin Harb] dari [Abu Khalid Ad Dalani] dari [Abu Al 'Ala Al Audi] dari [Humaid bin Abdurrahman Al Himyari] dari [seorang] sahabat Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila terdapat dua orang yang mengundang dengan bersama-sama maka penuhilah undangan orang yang paling dekat pintunya, karena sesungguhnya orang yang paling dekat pintunya adalah orang yang paling dekat pertolongannya. Dan apabila ada yang lebih dahulu di antara keduanya, maka penuhilah undangan orang yang terlebih dahulu!\"",
      "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدِ السَّلَامِ بْنِ حَرْبٍ عَنْ أَبِي خَالِدٍ الدَّالَانِيِّ عَنْ أَبِي الْعَلَاءِ الْأَوْدِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اجْتَمَعَ الدَّاعِيَانِ فَأَجِبْ أَقْرَبَهُمَا بَابًا فَإِنَّ أَقْرَبَهُمَا بَابًا أَقْرَبَهُمَا جِوَارًا وَإِنْ سَبَقَ أَحَدُهُمَا فَأَجِبْ الَّذِي سَبَقَ"
    },
    {
      "number": 3310,
      "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa Al Himshi] telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Marwan bin Ru`bah At Taghlibi] dari [Abdurrahman bin Abu 'Auf] dari [Al Miqdam bin Ma'dikarib] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Ketahuilah, tidak halal hewan buas yang memiliki taring, keledai jinak, barang temuan dari harta orang kafir Mu'ahad (yang menjalin perjanjian dengan negara Islam) kecuali ia tidak membutuhkannya. Dan siapapun laki-laki yang bertamu kepada suatu kaum dan mereka tidak menjamunya, maka baginya untuk menuntut ganti yang seperti jamuan untuknya.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ مَرْوَانَ بْنِ رُؤْبَةَ التَّغْلِبِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَوْفٍ عَنْ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا لَا يَحِلُّ ذُو نَابٍ مِنْ السِّبَاعِ وَلَا الْحِمَارُ الْأَهْلِيُّ وَلَا اللُّقَطَةُ مِنْ مَالِ مُعَاهَدٍ إِلَّا أَنْ يَسْتَغْنِيَ عَنْهَا وَأَيُّمَا رَجُلٍ ضَافَ قَوْمًا فَلَمْ يَقْرُوهُ فَإِنَّ لَهُ أَنْ يُعْقِبَهُمْ بِمِثْلِ قِرَاهُ"
    },
    {
      "number": 3324,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Mu'awiyah bin Hisyam] telah menceritakan kepada kami [Sufyan] dari [Muharib bin Ditsar] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik lauk adalah cuka.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نِعْمَ الْإِدَامُ الْخَلُّ"
    },
    {
      "number": 3359,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ada sesuatu yang lebih baik untuk kalian gunakan berobat, maka sesuatu tersebut adalah bekam.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرِةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ كَانَ فِي شَيْءٍ مِمَّا تَدَاوَيْتُمْ بِهِ خَيْرٌ فَالْحِجَامَةُ"
    },
    {
      "number": 3365,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam berbekam pada sisi pantatnya karena penyakit cacar yang beliau derita.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَى وِرْكِهِ مِنْ وَثْءٍ كَانَ بِهِ"
    },
    {
      "number": 3368,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam pernah melakukan pengobatan kay untuk Sa'd bin Mu'adz karena luka panah yang ia derita.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَوَى سَعْدَ بْنَ مُعَاذٍ مِنْ رَمِيَّتِهِ"
    },
    {
      "number": 3369,
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepadaku [Ahmad bin Ishaq] telah menceritakan kepada kami [Wuhaib] dari [Abdullah bin Thawus] dari [Ayahnya] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam memakai obat yang dimasukkan ke hidung.\"",
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ حَدَّثَنَا وُهَيْبٌ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعَطَ"
    },
    {
      "number": 3373,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Ibnu Abu Dzi`b] dari [Sa'id bin Khalid] dari [Sa'id bin Al Musayyab] dari [Abdurrahman bin Utsman] bahwa seorang dokter pernah bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai katak yang ia jadikan sebagai campuran obat. Kemudian Nabi shallallahu 'alaihi wasallam melarang dari membunuhnya.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثيِرٍ أَخْبَرَنَا سُفْيَانُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ خَالِدٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَأَنَّ طَبِيبًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ضِفْدَعٍ يَجْعَلُهَا فِي دَوَاءٍ فَنَهَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا"
    },
    {
      "number": 3386,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Daud] dari [Malik bin Mighwal] dari [Hushain] dari [Asy Sya'bi] dari [Imran bin Hushain] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada jampi kecuali karena 'ain (pengaruh mata orang yang dengki), atau dari racun.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ عِمْرَانَ بْنَ حُصَيْنٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ"
    },
    {
      "number": 3395,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Muhammad bin Ishaq] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengajari mereka beberapa kalimat karena adanya rasa takut, yaitu: A'UUDZU BIKALIMAATILLAAHIT TAAMMATI MIN GHADLABIHI WA SYARRI 'IBAADIHI WA MIN HAMAZAATISY SYAYAATHIINI WA AN YAHDLURUUNA (Aku berlindung kepada kalimat-kalimat Allah yang sempurna dari kemurkaan-Nya serta kejahatan para hamba-Nya, dan dari bisikan setan serta kedatangan mereka kepadaku) '. Abdullah bin Umar mengajarkan kalimat-kalimat tersebut kepada orang yang telah berakal di antara anak-anaknya serta orang yang belum berakal. Ia menulisnya dan menggantungkannya kepadanya.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعَلِّمُهُمْ مِنْ الْفَزَعِ كَلِمَاتٍ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ غَضَبِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِوَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يُعَلِّمُهُنَّ مَنْ عَقَلَ مِنْ بَنِيهِ وَمَنْ لَمْ يَعْقِلْ كَتَبَهُ فَأَعْلَقَهُ عَلَيْهِ"
    },
    {
      "number": 3403,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam apabila sakit maka beliau membacakan surat-surat mu'awwidzat (minta perlindungan) dan meniupkannya. Ketika sakit beliau semakin keras, maka aku yang membacakan kepada beliau dan aku usapkan kepadanya dengan tangan beliau, dengan harapan mendapatkan berkahnya.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى يَقْرَأُ فِي نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفُثُ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ عَلَيْهِ بِيَدِهِ رَجَاءَ بَرَكَتِهَا"
    },
    {
      "number": 3411,
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepadaku [Sufyan] dari [Salamah bin Kuhail] dari [Isa bin 'Ashim] dari [Zir bin Hubaisy] dari [Abdullah bin Mas'ud] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Thiyarah adalah syirik, thiyarah adalah syirik -tiga kali-. Tidaklah di antara kita kecuali beranggapan seperti itu, akan tetapi Allah menghilangkannya dengan tawakal.\"",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَيْسَى بْنِ عَاصِمٍ عَنْ زِرِ بْنِ حُبَيْشٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الطِّيَرَةُ شِرْكٌ الطِّيَرَةُ شِرْكٌ ثَلَاثًا وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ"
    },
    {
      "number": 3415,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada 'Adwa dan tidak ada thiyarah, aku tertarik dengan Al fa'l (optimisme) yang baik, dan optimisme yang baik adalah perkataan yang baik.\"",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا طِيَرَةَ وَيُعْجِبُنِي الْفَأْلُ الصَّالِحُ وَالْفَأْلُ الصَّالِحُ الْكَلِمَةُ الْحَسَنَةُ"
    },
    {
      "number": 3419,
      "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Abdullah bin Buraidah] dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam tidak melakukan tathuyyur dari sesuatupun, beliau apabila telah mengutus seorang pekerja maka beliau bertanya mengenai namanya, apabila tertarik dengan namanya maka beliau senang dan terlihat kesenangan kepada hal tersebut pada wajah beliau. Dan apabila tidak menyukai namanya maka terlihat ketidak senangan kepada hal tersebut pada wajah beliau. Apabila beliau memasuki sebuah kampung maka beliau bertanya mengenai namanya, apabila tertarik dengan namanya maka beliau senang dan terlihat kesenangan kepada hal tersebut pada wajah beliau. Dan apabila beliau tidak menyukai nama tersebut maka terlihat ketidak senangan kepada hal tersebut pada wajah beliau.\" ",
      "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَتَطَيَّرُ مِنْ شَيْءٍ وَكَانَ إِذَا بَعَثَ عَامِلًا سَأَلَ عَنْ اسْمِهِ فَإِذَا أَعْجَبَهُ اسْمُهُ فَرِحَ بِهِ وَرُئِيَ بِشْرُ ذَلِكَ فِي وَجْهِهِ وَإِنْ كَرِهَ اسْمَهُ رُئِيَ كَرَاهِيَةُ ذَلِكَ فِي وَجْهِهِ وَإِذَا دَخَلَ قَرْيَةً سَأَلَ عَنْ اسْمِهَا فَإِنْ أَعْجَبَهُ اسْمُهَا فَرِحَ وَرُئِيَ بِشْرُ ذَلِكَ فِي وَجْهِهِ وَإِنْ كَرِهَ اسْمَهَا رُئِيَ كَرَاهِيَةُ ذَلِكَ فِي وَجْهِهِ"
    },
    {
      "number": 3425,
      "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Abu Badr] telah menceritakan kepadaku [Abu 'Utbah Isma'il bin 'Ayyasy] telah menceritakan kepadaku [Sulaiman bin Sulaim] dari ['Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang mukatab tetap sebagai seorang budak selama ia belum menyelesaikan tanggungan pembebasannya meskipun satu dirham.\" ",
      "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو بَدْرٍ حَدَّثَنِي أَبُو عُتْبَةَ إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنِي سُلَيْمَانُ بْنُ سُلَيْمٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتَبَتِهِ دِرْهَمٌ"
    },
    {
      "number": 3437,
      "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membebaskan bagiannya dalam diri seorang budak, maka ia berkewajiban membebaskan bagian yang tersisa jika uangnya mencukupi nilai harga budak tersebut.\"",
      "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ عَتَقَ مِنْهُ مَا بَقِيَ فِي مَالِهِ إِذَا كَانَ لَهُ مَا يَبْلُغُ ثَمَنَ الْعَبْدِ"
    },
    {
      "number": 3438,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Sufyan] dari ['Amru bin Dinar] dari [Salim] dari [Ayahnya] dan sampai kepada Nabi shallallahu 'alaihi wasallam, \"Jika seorang budak milik dua orang, kemudian salah seorang dari mereka membebaskan bagian yang menjadi miliknya, jika ia masih memiliki kelebihan harta maka budak tersebut hendaklah dihargai (tidak dilebihkan atau dikurangi), kemudian dibebaskan.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَالِمٍ عَنْ أَبِيهِيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ الْعَبْدُ بَيْنَ اثْنَيْنِ فَأَعْتَقَ أَحَدُهُمَا نَصِيبَهُ فَإِنْ كَانَ مُوسِرًا يُقَوَّمُ عَلَيْهِ قِيمَةً لَا وَكْسَ وَلَا شَطَطَ ثُمَّ يُعْتَقُ"
    },
    {
      "number": 3446,
      "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Ayyub] dari [Abu Az Zubair] dari [Jabir], bahwa seorang laki-laki anshar yang bernama Abu Madzkur telah membebaskan seorang budaknya yang bernama Ya'qub (dengan syarat ia telah meninggal), dan ia tidak memiliki harta selain budak tersebut. Kemudian Rasulullah shallallahu 'alaihi wasallam meminta untuk membawanya dan bersabda: \"Siapakah yang mau membelinya?\" Kemudian Nu'aim bin Abdullah bin An Nahham membelinya dengan harga delapan ratus dirham. Beliau lalu menyerahkan uang tersebut kepadanya seraya bersabda: \"Jika salah seorang di antara kalian fakir, maka hendaknya ia memulai (sedekah) kepada dirinya sendiri, jika ada kelebihan maka ia berikan kepada keluarganya, jika ada kelebihan maka ia berikan kepada orang yang memiliki hubungan kekerabatan, kemudian jika masih ada kelebihan maka ia bisa memberikannya kepada siapa saja.\"",
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ أَبُو مَذْكُورٍ أَعْتَقَ غُلَامًا لَهُ يُقَالُ لَهُ يَعْقُوبُ عَنْ دُبُرٍ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَدَعَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ يَشْتَرِيهِ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ بْنِ النَّحَّامِ بِثَمَانِ مِائَةِ دِرْهَمٍ فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ إِذَا كَانَ أَحَدُكُمْ فَقِيرًا فَلْيَبْدَأْ بِنَفْسِهِ فَإِنْ كَانَ فِيهَا فَضْلٌ فَعَلَى عِيَالِهِ فَإِنْ كَانَ فِيهَا فَضْلٌ فَعَلَى ذِي قَرَابَتِهِ أَوْ قَالَ عَلَى ذِي رَحِمِهِ فَإِنْ كَانَ فَضْلًا فَهَاهُنَا وَهَاهُنَا"
    },
    {
      "number": 3448,
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin 'Atiq] dan [Ayyub] dari [Muhammad bin Sirin] dari [Imran bin Hushain], bahwa seorang laki-laki telah memerdekakan enam budak dengan syarat sepeninggalnya, sementara ia tidak memiliki harta selain mereka. Kemudian hal tersebut sampai kepada Nabi shallallahu 'alaihi wasallam. Beliau pun mengundi di antara mereka dan memerdekakan dua orang dan menyisakan empat orang sebagai budak.\"",
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ عَتِيقٍ وَأَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا أَعْتَقَ سِتَّةَ أَعْبُدٍ عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً"
    },
    {
      "number": 3465,
      "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Qutha'i] telah menceritakan kepada kami ['Ubaid bin 'Aqil] dari [Harun] dari [Abdullah bin Jabir] dari ['Athiyyah] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau membaca: 'MIN DLU'FIN (dari kelemahan) (Qs. Ar Ruum: 54). -dengan harakat dlammah-. ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ حَدَّثَنَا عُبَيْدٌ يَعْنِي ابْنَ عَقِيلٍ عَنْ هَارُونَ عَنْ عَبْدِ اللَّهِ بْنِ جَابِرٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ضُعْفٍ"
    },
    {
      "number": 3467,
      "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah] telah menceritakan kepada kami [Al Mughirah bin Salamah] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Al Ajlah] telah menceritakan kepadaku [Abdullah bin Abdurrahman bin Abza] dari [ayahnya] dari [Ubai] bahwa Nabi shallallahu 'alaihi wasallam pernah membaca ayat: BIFADHLILLAAHI WA RAHMATIHI, FABIDZAALIKA FAL TAFRAHUU, HUWA KHAIRUN MIMMAA TAJMA'UUN (Katakanlah: \"Dengan karunia Allah dan rahmat-Nya, hendaklah dengan itu kalian bergembira. Karunia Allah dan rahmat-Nya itu adalah lebih baik dari apa yang kalian kumpulkan.\"); ",
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ الْأَجْلَحِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ{ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْتَفْرَحُوا هُوَ خَيْرٌ مِمَّا تَجْمَعُونَ }"
    },
    {
      "number": 3468,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Syahr bin Hausyab] dari [Asma` binti Yazid], bahwa ia pernah mendengar Nabi shallallahu 'alaihi wasallam membaca: 'INNAHUU 'AMILA GHAIRA SHAALIH (Sesungguhnya ia telah melakukan perbuatan yang tidak baik) '. (Qs. Huud: 46). ",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَأَنَّهَا سَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ{ إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ }"
    },
    {
      "number": 3494,
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Abdullah bin Syaddad] dari [Abu 'Udzrah] dari [Aisyah] radliallahu 'anhuma, bahwa Rasulullah shallallahu 'alaihi wasallam melarang memasuki tempat-tempat pemandian umum. Dan beliau memberi keringanan bagi kaum laki-laki dengan syarat mengenakan kain sarung.\"",
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ أَبِي عُذْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ دُخُولِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ أَنْ يَدْخُلُوهَا فِي الْمَيَازِرِ"
    },
    {
      "number": 4162,
      "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam pernah melewati seorang laki-laki Anshar yang sedang menasihati saudaranya karena sikap malu. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Biarkanlah ia, sesungguhnya malu itu bagian dari iman.\"",
      "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى رَجُلٍ مِنْ الْأَنْصَارِ وَهُوَ يَعِظُ أَخَاهُ فِي الْحَيَاءِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُ فَإِنَّ الْحَيَاءَ مِنْ الْإِيمَانِ"
    },
    {
      "number": 4264,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian saling marah, saling hasad, dan saling membelakangi. Jadilah kalian hamba-hamba Allah yang bersaudara. Dan tidak halal seorang muslim menjauhi (mendiamkan) saudaranya lebih dari tiga malam.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا وَلَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثِ لَيَالٍ"
    },
    {
      "number": 4265,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Atha bin Yazid Al Laitsi] dari [Abu Ayyub Al Anshari] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang muslim mendiamkan saudaranya lebih dari tiga hari; saat keduanya bertemu yang ini berpaling dan yang lain juga berpaling. Yang paling baik dari keduanya adalah yang memulai mengucapkan salam.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثَةِ أَيَّامٍ يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلَامِ"
    },
    {
      "number": 4287,
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Musa bin Maisarah] dari [Sa'id bin Abu Hind] dari [Abu Musa Al Asy'ari] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang bermain-main dengan dadu, maka ia telah bermaksiat kepada Allah dan Rasul-Nya.\"",
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ مُوسَى بْنِ مَيْسَرَةَ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَعِبَ بِالنَّرْدِ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ"
    }
  ]
}